{
  "id": "dirigir-un-e-commerce-bajo-objetivos-de-crecimiento-y-transformacion",
  "title": "Dirigir un e-commerce bajo objetivos de crecimiento y transformación",
  "description": "Charlamos con Sora Sans, CEO de Bulevip, sobre cómo dirigir un e-commerce en crecimiento y sus principales palancas operativas",
  "date": "2025-01-10T20:38:14.617Z",
  "duration": 0,
  "audio_url": "https://chrt.fm/track/D992D/media.transistor.fm/a45d1b67/e41a5e29.mp3",
  "transcript_url": "<p>Estas son algunas de las preguntas y temas que hablamos con Sora en este episodio:</p><ul><li>¿Cuales son las claves para que un e-commerce funcione correctamente, cuales son las piezas fundamentales que lo componen?</li><li>¿Y las mayores vulnerabilidades que tiene un e-commerce?</li><li>La conversión es generalmente una métrica obsesión para un e-commerce, ¿qué palancas son las que tienes claro que hay que tocar?</li><li>CEO son las siglas de Chief Executive Officer, ¿qué hace la CEO de un e-commerce como Bulevip?</li><li>¿En qué medida la conversión depende de la planificación?</li><li>¿Cuales son los indicadores clave que todo e-commerce debería medir y controlar?</li><li>Tú has trabajado en e-commerce de varios sectores, ¿qué similitudes y diferencias has visto en el tratamiento del e-commerce entre distintas empresas?</li><li>Si tuvieras que repartir tu tiempo entre planificación, ejecución, medición, ideación de acciones, ¿cual sería tu reparto ideal de tiempo?</li><li>Ninguno de nosotros estamos específicamente formados para e-commerce. No hay una carrera oficial de e-commerce, ¿qué conocimientos consideras deben ser básicos para cualquier persona que quiera crear o más bien dirigir un e-commerce?</li><li>Si tuvieras que lanzar una serie de aprendizajes, experiencias o consejos a una empresa que quiere crear su e-commerce, ¿qué le dirías?</li><li>¿Se puede innovar en e-commerce, no se ha caido en la repetición de patrones de diseño en los e-commerce?, ¿qué diseños digitales te han sorprendido últimamente en positivo?</li></ul>",
  "show_notes": "<ul><li>https://www.linkedin.com/in/sorasans/</li><li>https://bulevip.com/es/</li></ul>",
  "guests": [
    {
      "id": "sora-sans",
      "name": "Sora Sans",
      "role": "CEO",
      "bio": "",
      "image_url": "sora-sans.jpeg",
      "social_links": [],
      "language": "es",
      "type": "guest"
    },
    {
      "id": "cristian-de-la-maza",
      "name": "Cristian de la Maza",
      "role": "Analítica Web y Optimización",
      "bio": "",
      "image_url": "cristian-de-la-maza.jpeg",
      "social_links": [],
      "language": "es",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "dirigir-un-e-commerce-bajo-objetivos-de-crecimiento-y-transformacion.jpg",
  "language": "es",
  "type": "podcast"
}