{
  "id": "inteligencia-artificial-etica-y-buscadores",
  "title": "Inteligencia artificial, ética y buscadores",
  "description": "Hablamos sobre inteligencia artificial, ética y sistemas de búsqueda y cómo consumimos internet hoy día y como ello nos condiciona en cómo compramos.",
  "date": "2025-01-10T20:38:14.617Z",
  "duration": 0,
  "audio_url": "https://chrt.fm/track/D992D/media.transistor.fm/b6b404be/c0121430.mp3",
  "transcript_url": "<p>En este episodio hablamos con Ricardo Baeza-Yates sobre una gran diversidad de temas que nos afectan en como consumimos y compramos en internet: uso de buscadores, ciencia de datos, inteligencia artificial, sesgos cognitivos y ética.</p><p>Algunos de los temas que abordamos con Ricardo en esta apasionante conversación fueron:</p><ul><li>¿Cómo funciona un buscador y cómo las personas nos hemos relacionado con ellos a lo largo de la historia de internet?</li><li>¿Los buscadores son en realidad herramientas para descubrir información nueva o más bien nos dirigen a donde está el interés de algunas corporaciones?</li><li>Todos hemos oido hablar de los sesgos cognitivos y la economía conductual, ¿en qué medida y cómo nos encontramos con sesgos en las experiencias de búsqueda?</li><li>¿Cual es el futuro inmediato de los sistemas de búsqueda?</li><li>Como investigador en el área y tras el auge de documentales como por ejemplo “El dilema de las redes”, ¿qué papel juega la ética en las experiencias de búsqueda que condicionan tanto nuestro comportamiento?</li><li>¿Qué deberíamos hacer para buscar de la mejor forma posible?</li><li>¿El uso de los buscadores nos ha hecho menos exigentes con los resultados que recibimos, menos críticos, hemos perdido la curiosidad porque la respuesta está a un clic?</li></ul>",
  "show_notes": "<ul><li><a href=\"https://www.linkedin.com/in/ricardobaezayates/\"><em>https://www.linkedin.com/in/ricardobaezayates/</em></a><em>&nbsp;</em></li><li><a href=\"http://www.baeza.cl/\"><em>http://www.baeza.cl/</em></a><em>&nbsp;</em></li></ul>",
  "guests": [],
  "youtube_url": "",
  "main_image": "inteligencia-artificial-etica-y-buscadores.jpg",
  "language": "es",
  "type": "podcast"
}