{
  "id": "la-moda-como-ecosistema-de-negocio-digital",
  "title": "La moda como ecosistema de negocio digital",
  "description": "Hablamos de la industria de la moda y cómo explota y se adapta al canal digital con Ainara Simón, CDO de Bobochoses.",
  "date": "2025-01-10T20:38:14.617Z",
  "duration": 0,
  "audio_url": "https://chrt.fm/track/D992D/media.transistor.fm/7a57e915/f92c6036.mp3",
  "transcript_url": "<p>En este episodio le planteamos a Ainara las siguientes cuestiones principales, sobre las que desarrollamos una conversación muy muy rica.</p><ul><li>Llevas varios años de experiencia en el sector moda en su capa digital, ¿cómo ha evolucionado el ecosistema digital en estos años en lo que se refiere a cómo se vende?</li><li>La omnicanalidad implica que los activos digitales tienen mucho peso en la venta en dos direcciones, como canal de compra directo tras tener experiencia física en tienda y como canal de consulta y catálogo para ir posteriormente a tienda, ¿en qué medida se mide o puede medirse cada tipo de comportamiento y cómo puede mejorarse?</li><li>El mundo de la moda tiene unas particularidades muy propias, ¿cuales son los principales drivers de conversión que tiene y cómo debemos explotarlos en web y app?</li><li>Hay una gran diferencia en el rendimiento de marcas nuevas, emergentes y consolidadas, ¿cuales son las acciones que mejor funcionan en cada caso?, ¿y los grandes errores?</li><li>Bajo tu punto de vista y desde tu posición, ¿qué cosas se hacen mejor y peor en las organizaciones dedicadas a la moda cuando se habla de CRO?, ¿dónde están los retos para los próximos 2 o 3 años?</li><li>La mejora de conversión y experiencia es un campo tremendamente amplio que además depende mucho del modelo de negocio de cada compañía, ¿cómo crees que una empresa de moda debe iniciarse en CRO y crecer poco a poco para alcanzar unos resultados graduales cada vez mejores?</li><li>Parte de nuestro trabajo como optimizadores consiste en identificar patrones de comportamiento que se repiten y crear soluciones para casos concretos, ¿qué comportamientos ves que se repiten una y otra vez y sobre los que es necesario trabajar para optimizar la experiencia?</li><li>En base a tu experiencia dime tres o cuatro prácticas de conversión y mejora que consideras son necesarias de implementar, unos básicos que siempre o casi siempre funcionan.</li><li>¿Dónde están los principales puntos de dolor en un proceso de compra online y por qué?</li><li>Cada vez más hay propuestas muy sofisticadas en materia de conversión: scoring, propensión, personalización one to one, medición in store… ¿qué será lo siguiente?, ¿qué crees que es lo que va a ser clave en el futuro?</li></ul>",
  "show_notes": "<ul><li><a href=\"https://www.linkedin.com/in/ainara-sim%C3%B3n-8a336832/\">https://www.linkedin.com/in/ainara-sim%C3%B3n-8a336832/</a></li><li><a href=\"https://ochodoses.com/\">https://ochodoses.com/</a></li></ul>",
  "guests": [],
  "youtube_url": "",
  "main_image": "la-moda-como-ecosistema-de-negocio-digital.jpg",
  "language": "es",
  "type": "podcast"
}