{
  "id": "persuasion-y-psicologia-asi-manejan-nuestro-hilos-los-negocios-digitales-para-vendernos-mas",
  "title": "Persuasión y psicología. Así manejan nuestro hilos los negocios digitales para vendernos más.",
  "description": "Charlamos con el psicólogo Ramón Nogueras sobre cómo los sesgos cognitivos son aprovechados por múltiples e-commerce y negocios digitales para vendernos más.",
  "date": "2025-01-10T20:38:14.617Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/3ab70f9d/f467d42a.mp3",
  "transcript_url": "<p>En el transcurso de esta charla con Ramón pudimos hablar de muchos temas vinculados a la economía conductual, a la psicología y a cómo los sesgos cognitivos son empleados por los negocios para generarnos más necesidades y que compremos más.</p><p>Algunas de las cuestiones que tratamos fueron:</p><ul><li>En los 70 conocimos la economía conductual a través de Kahneman y otros autores que demostraron que nuestras decisiones no son todo lo racionales que nos gustaba creer, ¿qué es un sesgo cognitivo y por qué nos influye tanto en todas las decisiones que tomamos?¿Es el arte, el diseño, un activo de valor para un e-commerce?</li><li>¿El marketing moderno explota nuestros sesgos para vendernos más?</li><li>¿Cual es la línea en el uso de los sesgos que diferencia la persuasión de la manipulación?</li><li>Este es un podcast sobre CRO y CXO, por lo que nuestro principal interés es crear productos y servicios digitales que sean eficientes en sus objetivos de negocio, ¿los sesgos cognitivos están muy presentes en nuestra relación con un e-commerce, por ejemplo?, ¿cómo?</li><li>Como psicólogo y especialista en este tema, ¿qué debemos hacer las personas para llevar una vida mentalmente sana que no nos convierta en esclavos de nuestros sesgos?</li><li>¿Cuales son las técnicas que ves cada día en e-commerce y apps que intentan explotar nuestros sesgos de forma más descarada?, ¿y los más eficaces?</li><li>¿Hay espacio para la ética en la explotación de sesgos de los usuarios?</li><li>En nuestro sector, en el campo digital, se habla mucho de neuromarketing cuando en realidad se quiere hablar del uso de sesgos, ¿qué diferencia podríamos trazar entre ambos conceptos o cómo están relacionados?</li><li>¿Estamos siendo cada día más manipulados y no somos conscientes de ello?, ¿somos ya un producto para muchas corporaciones?</li></ul>",
  "show_notes": "<ul><li>https://www.linkedin.com/in/ramonnogueras/</li><li>https://twitter.com/RamonNogueras</li><li>https://sesgodeconfirmacion.com/</li></ul>",
  "guests": [],
  "youtube_url": "",
  "main_image": "persuasion-y-psicologia-asi-manejan-nuestro-hilos-los-negocios-digitales-para-vendernos-mas.jpeg",
  "language": "es",
  "type": "podcast"
}