{
  "id": "trafico-si-pero-trafico-util",
  "title": "Tráfico sí, pero tráfico útil.",
  "description": "Hablamos con Aleyda Solis sobre la importancia de que las estrategias de captación de tráfico no se centren solo en el volumen, sino en la calidad transaccional",
  "date": "2025-01-10T20:38:14.617Z",
  "duration": 0,
  "audio_url": "https://chrt.fm/track/D992D/media.transistor.fm/8253f61d/342227a0.mp3",
  "transcript_url": "<p>Estas son algunas de las preguntas y temáticas que hemos tratado en este episodio:</p><ul><li>El SEO es la fuente de tráfico quizás más fiable e importante en cualquier negocio digital establecido, y suele ser la fuente de tráfico más regular en lo relativo a conversión, aunque hay todavía empresas obsesionadas con la cantidad de tráfico, ¿cómo equilibramos cantidad de tráfico con calidad, cuando podemos ver que no nos interesa cantidad y sí calidad?</li><li>El SEO es siempre una estrategia de captación a medio plazo, que busca estabilidad, recurrencia, posicionamiento de marca. Si pensamos en conversión, ¿cómo debemos trabajar el SEO junto con otras fuentes o medios de tráfico?</li><li>¿Cómo encontramos nichos o territorios digitales que nos den un tráfico cualificado?</li><li>Bajo tu criterio, ¿cuales son las buenas prácticas para orientar la captación de tráfico a conversión?</li><li>Tú has trabajado en e-commerce de varios sectores, ¿cuales son las estrategias SEO más comunes, y las más eficaces?</li><li>El análisis del tráfico es fundamental para determinar si estamos haciendo las cosas bien o no, ¿cuales son los indicadores que siempre deberíamos consultar y por qué?</li><li>No hay una carrera oficial de SEO, todos somos intrusos en gran medida, ¿qué tipo de conocimientos de base debería tener un buen profesional del SEO?</li></ul>",
  "show_notes": "<ul><li>https://www.orainti.com/</li><li>https://twitter.com/aleyda</li><li>https://learningseo.io/</li><li>https://www.linkedin.com/in/aleyda/</li></ul>",
  "guests": [
    {
      "id": "aleyda-solis",
      "name": "Aleyda Solis",
      "role": "CEO",
      "bio": "",
      "image_url": "aleyda-solis.jpg",
      "social_links": [],
      "language": "es",
      "type": "guest"
    },
    {
      "id": "cristian-de-la-maza",
      "name": "Cristian de la Maza",
      "role": "Analítica Web y Optimización",
      "bio": "",
      "image_url": "cristian-de-la-maza.jpeg",
      "social_links": [],
      "language": "es",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "trafico-si-pero-trafico-util.jpg",
  "language": "es",
  "type": "podcast"
}