{
  "id": "acting-on-your-analytics-data-in-an-increasingly-cookieless-world-with-weiwi-lie-schroder-google",
  "title": "Acting on your analytics data in an increasingly cookieless world",
  "description": "Discover how data can still be activated within the scope of recent changes, and how some of our largest clients have approached this challenge.",
  "date": "2025-01-09T14:36:18.242Z",
  "duration": 1172,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/1ba104c6.mp3",
  "transcript_url": "<p>Guido X Jansen: [00:00:00] Spanish now? Yes. Okay. I don't speak Spanish. So Goma SAS. Yeah. Okay. I understand that one. Welcome. You just had a session. Could you shortly introduce yourself? </p><p>WeiWei: [00:00:18] Sure. I'm wary. I'm working at Google for the GFC product and I'm the solutions lead on JT 64. </p><p>Guido X Jansen: [00:00:26] Yeah. And you just had a keynote, before, after lunch, that's </p><p>WeiWei: [00:00:30] about, you don't want to be the avant, sitting between you </p><p>Guido X Jansen: [00:00:34] exactly </p><p>WeiWei: [00:00:36] the audience </p><p>Guido X Jansen: [00:00:37] or your session was about very relevant and something.</p><p>a lot of us might be a bit scared. Scary or scared about, or maybe, yeah, or just blocking and ignoring, acting on your analytics data in an increasingly calculus world. So please tell us about that. </p><p>WeiWei: [00:00:56] I think I was three weeks ago on the dmexco and half of the sessions, actually it was about calculus world.</p><p>I think it's a very relevant topic right now, especially since the launch of the new ETP and ITP. So I think, this is why this topic might be relevant for people would be interested in, so this is the reason why we chose this. Yeah. And, but still, we were going to still be relevant to the user and that's Google always puts the user first.</p><p>Yep. in my, keynote, I wanted to open up new ideas for what you can do still to be relevant to the user. And yeah. Rather than in a way that you can still do something and, The worst would be like going back to the eighties and just have, tailored messages shouting at you, right?</p><p>Guido X Jansen: [00:01:38] Yeah. the MOA, the organization buying the conference today, they're already 80 years </p><p>WeiWei: [00:01:43] old, so </p><p>Guido X Jansen: [00:01:45] they already existed before we had internet. No, I learned that today two </p><p>WeiWei: [00:01:51] 80 years ago. </p><p>Guido X Jansen: [00:01:54] it's marketing insights, research and, analytics. so more in general. Yeah. But more for magazines or for companies that do marketing in general.</p><p>Of course. of course we will have the luxury today that we have much more data. Yeah. You just </p><p>WeiWei: [00:02:07] forget about this. that advertising also existed offline. Yeah, </p><p>Guido X Jansen: [00:02:12] we did. We didn't invent AB testing. They already did that before with magazines. </p><p>WeiWei: [00:02:17] I just came out of the Getty, was doing the, a session here just right now.</p><p>And, and she's saying about, how old people are actually also do buy online and that you don't wrap your head of it, but her 90 all's, mother's actually ordering clothes online and tries them on. And I was like, yeah, actually, why not? Makes sense, right? You don't, you're not so flexible anymore.</p><p>You don't physically, these, this is not a typical bucket group. You think of people who are using online shopping. So I was quite refreshing </p><p>Guido X Jansen: [00:02:46] to have the thought. Yeah, that's a great example. So today of course we talk about women and analytics is a, is also a topic today. And diversity is a great topic again, for a second of your users that you might not think of as might be very relevant.</p><p>it's </p><p>WeiWei: [00:03:00] not only closing the gender gap, but also the. </p><p>Guido X Jansen: [00:03:03] Yeah, yeah, gender is just one of the dimensions you can score people on, but, there are a lot of, we spoke about age, when you're in eCommerce, there's probably a big difference between people that already did a purchase already our clients, or are still exploring.</p><p>we spoke to Transavia airline, trying to create a different experience for people that bought something. I bought a ticket or people that, they already bought a ticket and they're leaving in two days. They probably want a different experience. They wouldn't want to check in or something.</p><p>Or, </p><p>Bart van der Meer: [00:03:27] if physical shops are near you, there are so many ways to segment and to, to make sure that you have the right audience and you're not biased in any way. </p><p>WeiWei: [00:03:37] exactly. Yeah. Again, the relevance for the user and yeah. </p><p>Guido X Jansen: [00:03:40] Yeah. Yep. Yep. so back to your talk. Yeah. How do we. Create that relevance in more and more calculus worlds.</p><p>WeiWei: [00:03:47] so there's yeah, I try to spot like the easy opportunities, low hanging fruits, easy solutions would be go through Google audiences where you have already audited. I built me to just select them demographics, affinity in market. Then of course you can use your first party data. So the best way to measure anyway is that you, use tools which put cookies on the same domain as a website, right?</p><p>So it was first party data, and they are also less effected by the changes. the legal and technical changes, and the third party cookies. and the third one actually is about cloud solutions. And what other signals we can use. Which are out of the box thinking. I, we had some case studies shown up there where, for example, you can use this a great case study, which actually won also.</p><p>It bronze a lion in Canada this year. the tariff tracker. So it's, they used a lot of data from medical, institutes. They had weather data, social data, search data, and a lot of data points that could create basically a model which predicted in which one of the 32 different districts in Mexico with the flu will break out and show relevant ads in that region.</p><p>The temperature with the likelihood, of, and it's awesome because it is taking data points outside of the cookie world. But then how powerful is that you see, even in a moment where he gets sick or even before you get sick, like the predicts already that you, that this app could be relevant for you.</p><p>and using machine learning, which is the Google cloud machine learning, which can predict this. And, and then use GMP the Google market platform to actually activate on that. for example, having, and then creators where it puts automatically different, parts of the creative. So for example, the background of the city, you are in the temperature, you are facing red now using and elements of that in one creative.</p><p>And I'm doing, I think it was 250 different versions of the ad, with a very low budget. I think the whole campaign was only costing 200 cakes. I'm just very low on cost. And if you think about this of solution five years ago would cost probably 10 times. No, there wasn't anything like that before and yeah.</p><p>This easy pieces of Google cloud platform together with the Google marketing platform. I think this is very powerful. because Justin just cut machine power behind that. just, if you think about this kind of things, 10 years ago, people said, Oh, it's the future, but it's not possible yet. We are in the future now where this kind of things are possible and it's even very easy to start with.</p><p>So I think this is a, the last piece which I talked about in terms of solutions or cloud solutions or using Google cloud API. a vision API where we can, for example, we had a case study with Unilever in Indonesia that, during Ramadan, they were looking at all the pictures in Instagram and they looked at the different, products like food, and they could use the most popular food in there, directly in the eighth graders and saying, you're looking for the other cookies here.</p><p>We have a good recipe for you. And I think this kind of things is very powerful because it uses much more data from the outside world. And not too much on not relying too much on the cookie based pay data. Yeah. and also I think one important part, if we look at the future and we talk about the future in the sense of how can technology help me staying relevant to a user, how can I still measure, plan optimize on data?</p><p>Then we definitely need to talk about the new app and buy properties in Google. so I also showed a bit of what we can do. It's an open beater. So we encourage everyone to use that and to give us feedback as well. And, this is also something which we really invest a lot into from the Google analytics side.</p><p>So this is definitely our vision of the future. And, we will also look into this. Much more in 2020. So I showed also a couple of, features we're planning. It's like bit the roadmap. We are planning what we can expect 2020 to bring for the alphabet properties. this was also definitely a topic, at the end of my, </p><p>Bart van der Meer: [00:08:04] and, does it also integrate in some way with </p><p>WeiWei: [00:08:06] YouTube?</p><p>It will integrate with so we are building that product upon, Firebase, modeling and everything we have in a product right now, we try to also bring into the new product. So whatever we have on, GA classic on the web and on five is for app. we know which features are popular, which are needed.</p><p>we will also definitely looking into the degration of all this products into. The new app of our properties. For example, next year we have we plan definitely to bring in eCommerce, the integration with, DV three 60 as a three 60 cm is definitely also in the plans of, the next two years.</p><p>And, we gonna, yeah, look into big query integration. we will talk about &nbsp;all of the, so it's, it's very exciting to be part of the whole story and to yeah. To see what the future brings. </p><p>Guido X Jansen: [00:08:57] Is there any known, period for the beta? Is that the ending. is there, </p><p>WeiWei: [00:09:03] we just try it to get as many people as possible on it now, so just have to learn.</p><p>Exactly. So also part of the new trend words are AI machine learning, all of this, but I'm taking one step back. What does it actually, what is machine learning? What is AI? It can predict, it can make decisions. Millions of physicians, in a minute where you monumentally probably not be able to do. And it learns three examples.</p><p>But yeah. That therefore we need data a lot of, and also not alone, the quantity of data, but also the quality of data. So we need as many people as possible to just, try it out and we can learn from that and make it better. And then that's where we are at a stage right now. So this is why it's an open beat term.</p><p>Everyone can just start on it. </p><p>Bart van der Meer: [00:09:45] Nope, no restrictions in, how many visitors your site or short meet or </p><p>WeiWei: [00:09:49] no? And half the tagging in place. And also if you are doubting of what we can do with, cause you have already a very good property and on your whiteboard, and you. Yeah, you think about, okay, I don't want to retake.</p><p>you can always do dual tagging dual taggings, what we recommend. So that's something we can start off already. So that's available right now. So you can do it today, tomorrow. Exactly. Yeah. </p><p>Guido X Jansen: [00:10:12] That's definitely something that we all need to look in. And also we had just pulled out another, keynote speaker.</p><p>Telling us. Yeah, this is going to be the future. So I don't know why everything we should just ditch universal. </p><p>WeiWei: [00:10:25] it's, as I said, there's still some functionality lacking, so we know that. So this is why we don't say </p><p>Guido X Jansen: [00:10:31] this. </p><p>WeiWei: [00:10:32] That's why it's a beta. Exactly. So for example, e-commerce is not there yet.</p><p>So I think this is a big part of, Of the strategy of a lot of clients. And that's definitely something which you should keep doing, and you should not throw away this, but the move, which is upcoming, you should have it in the back of your mind. You should not forget about us. And if possible, stat testing that out with a small branch of your company or with a little sub group of, of a business, because that is easier.</p><p>If you do ready the first baby steps. Then it's easier to at some point switch, to add </p><p>Bart van der Meer: [00:11:03] 20, 20 sounds like a good year to take the first baby steps. </p><p>WeiWei: [00:11:07] Definitely. Yes. Yes. So 2020 is definitely a year of changes for Google as well. </p><p>Guido X Jansen: [00:11:13] and we had, several guests today talking about data, quality, how I'm still, that is for many.</p><p>Companies. we might feel, we need to get out of that stage. We should get out of that stage. But </p><p>Bart van der Meer: [00:11:24] I think it's that way in a lot of, digital fields. with, with search marketing, we also feel like we can do a lot of things, but still a lot of companies don't have the basics set up properly to get the maximum out of it.</p><p>And I think, Euro is no exception to that. </p><p>Guido X Jansen: [00:11:42] Yeah. And even previously with, or currently with, Google, and there's universal. you still need to manually add events, That might be partially resolved at least with, the new solution. but still a lot of people using universal.</p><p>Yeah. You still need to. Some manual work. If you want to measure what's relevant for you and how to optimize for it. we have a podcast about optimization. You need to base that </p><p>WeiWei: [00:12:06] on </p><p>Guido X Jansen: [00:12:07] good day data. </p><p>WeiWei: [00:12:09] Definitely, but also just keep in mind, like the way we track with Google analytics. It is a structure, which has been over 10 years on the market.</p><p>And like at that moment when it was launched, it wasn't, there wasn't even an iPhone. There wasn't a smartphone in the world. So think Apple X, like the first smartphone was 2007 or so end of 2007 </p><p>Guido X Jansen: [00:12:29] apples here, maybe. </p><p>WeiWei: [00:12:30] Yeah. So I think it's yeah, but I remember when I was in university, we had Noah, like it came basically around.</p><p>Yeah. No, it wasn't school. There was no smartphone. And I think this is what we sometimes forget how fast paced everything is that, that smartphones only existence 12 years. And that was not thought through in that moment when it didn't exist.</p><p>So a lot of things change and we need to adapt to the change and change our systems with it. So we definitely think that we're going away from the session based. Thinking to more user based thinking. So this is like something which is still ingrained because yeah, that moment of time when it started to be you important, and we had only sessions, We had hits and sessions only, and now we're moving away from that and having a model. But this is something which is ongoing this change of environment and the adaptation towards it. This always, who was one step ahead, right? </p><p>Guido X Jansen: [00:13:24] Yeah. Yeah. And we had a, yeah, like we just start with MOA. They already exist for 80 years, but in digital we have so much more data and we can do so much more with that.</p><p>And like things like machine learning or AI, we have, we now have the data to do that, but we have to grow up fast, to actually do something useful with it and handle the data and they get it correctly. </p><p>WeiWei: [00:13:45] Yeah. It's not about only gathering, but what do you do with that? how can you make smart decisions upon that?</p><p>And, yep. I think this is also the inspirational part, which I've wanted to bring in that. just giving examples of how it can be used and how people actually use that. And maybe people go away with no design inspiration and create something else themselves for themselves. Yeah. The next step. And </p><p>Bart van der Meer: [00:14:07] I'm wondering, because you described basically a campaign that costs about 200 K you said, is it Google's goal to reduce.</p><p>The cost of such a campaign, like as fast as possible. it's much as much companies as possible can use it or is that, </p><p>WeiWei: [00:14:24] Oh, it's always about the user or in this case also the customer. So it should be something you think it's useful for you and it can bring them out most outcome for you, either as an advertiser or as a user.</p><p>so yes, it is in the sense that you make it most profitable for your company. And, You can talk to as many people about your great product you have in the best way. reached the right person at the right time. yeah. In the best manner you can do. and this is something which. I think if you see this kind of ad, you won't feel offended or something that is, Oh, this is great, actually.</p><p>So it's just helpful for me as a user, as I see this ad, but also helpful for the advertiser because he can make smarter decisions and, giving everyone, this information basically by predicting it, he can add actually this information towards. His, yeah. To his database of users. </p><p>Bart van der Meer: [00:15:16] but is there like a timeframe, for when your local butcher shop can, can use something like this right now, right?</p><p>Yeah. in theory right now, but when it's a cost effective for them as well, is there a timeframe? </p><p>WeiWei: [00:15:30] I don't, obviously there's is also individual physicians and really knew it definitely. I think in smaller countries like Netherlands, of innovation happening already, which I think are fantastic.</p><p>You have a lot of data already, which is online available for, even if I move my house. in other countries, like in Germany, you would have to go to five different, different, Town halls to say I moved and then you have to talk to your electricity provider to a turbine provider, et cetera.</p><p>But Netherlands, I move and it's on my DG ID and it's actually, my insurance is updated. My, like gas bills updated. It's like a lot of things are much more streamlined. So I feel in that moment, actually, this is helping me right. Instead of when I move and I have to like, I forget even two or three, the point points and then, bills end up in the old address and all of this, but If used in a right way, I think smart data can really add value to someone's life. And me personally, I think this is, this was very helpful to see how different countries actually, we manage this kind of information and how to make it in a most useful way. And I was positively surprised by, the flexibility and also like the Jada, how fluid this whole information flow was.</p><p>So I really liked. in terms of smart data, how you use this. Yes. It's in the wrong hands, every technology can be misused, but I think in the right hands, it can give a lot of value. And it's the same with any technology. I think you can, I think if you, if Ari, but if you don't learn to drive and you put that one against the, the tree, there's also the kind of.</p><p>A responsibility of you in the driver's seat to learn, to drive properly. You've got great technology, right? I think this is always the debate, how to make the data smart and how to make it in the best. </p><p>Guido X Jansen: [00:17:19] Yeah. Yeah. That's a good point to think about, I think thanks so much. Thank you for the session.</p><p>And, I'd say, have fun the rest of the day. </p><p>WeiWei: [00:17:29] Thanks. Bye. </p><p>Guido X Jansen: [00:17:31] Bye. Bye.</p><p>‍</p>",
  "show_notes": "<p>Recent regulatory and browser changes are making it increasingly challenging to collect, connect &amp; analyse cookie-based data. The future is unsure. The recent launch of the App + Web Properties Beta in Google Analytics marks the beginning of a whole new way to unify app and website data. This talk will take you through the new cross-platform possibilities.</p><p>Het <strong>Digital Analytics Congres 2019</strong> vond plaats op 8 oktober 2019 in de Jaarbeurs in Utrecht en wij deden live verslag vanaf de conferentie. Meer over het congres kun je vinden op <a href=\"https://www.digitalanalyticscongres.nl/\" target=\"_blank\">https://www.digitalanalyticscongres.nl/</a>.</p><p>DAC19 werd georganiseerd door het Expertise Center voor Marketing Insights, Onderzoek en Analytics beter bekend als <strong>MOA</strong>. Meer daarover kun je terugvinden op <a href=\"https://www.moaweb.nl/\" target=\"_blank\">https://www.moaweb.nl/</a>.</p><p>‍</p>",
  "guests": [
    {
      "id": "weiwei-liu-schroder",
      "name": "weiwei-liu-schroder",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "https://youtu.be/nSjBdN3GTXA",
  "main_image": "src/assets/images/episodes/acting-on-your-analytics-data-in-an-increasingly-cookieless-world.jpeg",
  "language": "en",
  "type": "podcast"
}