{
  "id": "analytics-is-a-product-treat-it-as-such",
  "title": "Analytics is a product – treat it as such",
  "description": "All analytics projects, be it instrumentation, analysis, or advanced modeling are on its way to being a product. Only part missing is you treating it as such. ",
  "date": "2025-01-08T20:07:07.493Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/bdf5d87f.mp3",
  "transcript_url": "<p>Guido X Jansen: [00:12:21] welcome. Welcome to our cafe. We have a bar actually. yeah. Could you introduce yourself? you just did a session, right? Yeah. </p><p>Prolet Miteva: [00:12:33] before lunch.</p><p>So called flee people didn't leave for food before I finished. So I guess that was encouraging. my name is &nbsp;I'm senior product manager of analytics at Autodesk and welcome. I'm very happy to be here. I found out about Sierra cafe today. So now I've subscribed </p><p>Guido X Jansen: [00:12:52] on Spotify instead of a podcast, </p><p>Prolet Miteva: [00:12:55] or I could not find you guys on </p><p>Guido X Jansen: [00:12:57] exactly.</p><p>We have a, there's a gap apparently. And so we need to make sure that we're also involved </p><p>Bart van der Meer: [00:13:03] in United States. And we talked a little bit this morning and you were telling us about your new talk. How did it go? </p><p>Prolet Miteva: [00:13:10] I think that it went very well. I, got some questions at the end. so that's usually encouraging, there are a couple of people that stopped by and thank me.</p><p>So that is always good. All right. So from my perspective, it was a success. Okay, </p><p>Guido X Jansen: [00:13:25] good. Let's talk about those questions in a minute, but first, what was your session about the title was analytics is a product. Let's treat it as such. </p><p>Prolet Miteva: [00:13:35] Yes. very, </p><p>Guido X Jansen: [00:13:36] I feel that there's a, like a frustration of the lying, </p><p>Prolet Miteva: [00:13:40] that much frustration.</p><p>Really what my talk was about. Bringing up the work that we do every day and making it more meaningful, making it more of a product than just an offering that we do. Usually a lot of times what we do every day is more of services. It's more kind of, doing small things for everyone else and we don't treat the work that we do.</p><p>Good enough. So my talk was a, probably a little bit more of an inspirational talk about changing better. It's more about changing the way you think about the work that you do, changing your thinking from the fact that you're making a project, changing that into the fact that you're doing a product.</p><p>So stop minimizing the work that we're doing and making it more meaningful for both the company and yourself. </p><p>Guido X Jansen: [00:14:36] Is it something, we, as in the group of analysts, are we doing something wrong or is it the way people view our work? Yes,</p><p>Prolet Miteva: [00:14:46] I think it's both, but where I think it starts is from us. And that was one of the points of my slides. It was that we actually minimize the work that we do. A lot of what we're doing everyday. and I went through some of the examples of the dashboards, new tools or platforms, implementations, or running an optimization practice.</p><p>Yes. Those are actual products. Those are products that we provide to our business customers and business customers. I mean our internal business customers, not our external consumers. It's more all the customers that we have internally. And we should think about our stakeholders more as customers.</p><p>We as a company, think of everyone outside as customers, we should start thinking also internally that everyone within our company is our customer. And if we start thinking more in that way, maybe we will treat our work a little bit more of a, like a product. So I went through the different stages of, the product process and how tried to show everyone that.</p><p>What we are already working on is very close to the product process. We're just not thinking about it as such and trying to think a little bit bigger and trying to think about everything that we do every day as something that is more important, can help us represent it at the end. Some things that's more important and help our business customers treat it as something that's more important.</p><p>So it's both sides, but. honestly, it will be really hard for us to quickly change what our business customer think about us, but we should first start changing what we ourselves think about. Yeah. </p><p>Bart van der Meer: [00:16:30] And, in what ways do you think, we minimize the work </p><p>Matthew Niederberger: [00:16:33] that we do. </p><p>Prolet Miteva: [00:16:35] in, first of all, we often think of it as that it's like one and done.</p><p>We don't take the time to advertise it, then promoted enough within our companies. And we don't take the time enough to grow it or to maximize reach with the products that we develop. So when you create a dashboard or when you create a new tool, you need to spend the time to actually market it. And some of the things that I went through a little bit was when you create a physical product, You go through all the marketing channels that you can think about, right?</p><p>You do a SCM, you do display advertising. You do all of that in order to reach more people. But when we create an internal product, we don't actually try to take the time to go through all of these steps. </p><p>Bart van der Meer: [00:17:25] We throw it to him say, and </p><p>Prolet Miteva: [00:17:28] we throw them to them. We send an email or two, maybe we do a training session or two, but we need to take a little bit more effort to actually advertise it.</p><p>I had some examples, like making posters, doing little social events, like cupcakes or the display advertising. </p><p>Bart van der Meer: [00:17:44] Yeah. I think at a company it's a Netherland in the Netherlands when mobile was a was up and coming. the lead CRO was dressed up as a mobile phone for a week. And then I think they did a few years just to create yeah, just for awareness, something like that.</p><p>Yeah. To create awareness and have people ask him, what are you doing? then you can explain it. </p><p>Matthew Niederberger: [00:18:09] Guinness book of world records attempt in there. </p><p>Guido X Jansen: [00:18:11] Yeah. maybe not sure if that's a world record I would want to have, but </p><p>Matthew Niederberger: [00:18:16] just ask you a question. Only three people raised their hands.</p><p>When he talked about planning, how has, how does that differ in between different countries, different events, where you asked the same question? </p><p>Guido X Jansen: [00:18:25] What was the question? </p><p>Prolet Miteva: [00:18:26] I asked how many people, one of the stages of the product processes plan. So I ask how many people plan. About the things that they develop and yeah, it was, I was surprised.</p><p>I think honestly, they were not sure what I was talking about. The question was, how many of you plan of how you're going to make your product real? How are you going to get that dashboard to be done? I frankly cannot accept that it only three people in the whole audience plan, the Kyle to make things done.</p><p>it's unrealistic every single person. Has that even, let's say that dashboard, something that you will create in couple of hours or a day, you still in your mind plan, how are you going to approach it? What are you going? What are the steps that you're going to do in order to complete it? What are you going to, what data are you going to use?</p><p>What visualizations are you going to use? How you're going to lay it out. How are you going to actually then complete it? And how are you going to send an email and be. In a way in the release phase. And I think that people just don't realize, and I might need to adjust my presentation for one of the next times to talk a little bit more about that process, because even subconsciously every single one of us is planners, because otherwise you're not going to be able to complete anything.</p><p>But yeah, maybe subconsciously </p><p>Matthew Niederberger: [00:19:53] I speak from experience from companies where I've done some work. A lot of people just start creating dashboards. They start creating the product and they skip the planning part. And then, so when Pete only three people raised their hands, maybe it's realistic. Yeah.</p><p>It could be. And it's a, it kudos to those three, raising their hands that it does take effort. It does take a, self control to take a step back, evaluate what you want to achieve and create that planning for </p><p>Prolet Miteva: [00:20:21] it. Yeah, then I'm really surprised and yes, with the dashboard might be simpler, but anything else, an implementation you have to plan for that, right?</p><p>Especially if you need to start involving other teams like engineering teams, you have to plan. So I think that maybe people work on </p><p>Guido X Jansen: [00:20:43] there's also a there's a danger in just creating dashboards for people. If you don't really know. What they're going to use it for, </p><p>Bart van der Meer: [00:20:49] If they're going to use it at all.</p><p>Guido X Jansen: [00:20:53] I've often given the example in the podcast that I once came at a company, and I think I mentioned it today already, but that the report they had, the data, they had, the eCommerce manager, what they saw on a daily basis was the number of orders that they got. That's the only thing that they got. So they started just giving discounts to make those numbers go up.</p><p>and that's. So you're trying to help them by giving them a dashboard. But if the data is incomplete or not necessarily what they actually need, it can actually maybe even bring your company down if you, </p><p>Matthew Niederberger: [00:21:23] at least you had transactions. I know of an international company. pan European company only used a number of.</p><p>users, visitors to just to evaluate the performance of their website, </p><p>Bart van der Meer: [00:21:36] no budget to CRO and all the budget to, to search engine marketing </p><p>Prolet Miteva: [00:21:41] can easily create a little bot. And then it's yes, the </p><p>Bart van der Meer: [00:21:44] worst performers. </p><p>Prolet Miteva: [00:21:46] Yeah. That's why then I'm actually probably surprised because I would have told them I just time.</p><p>And I've been in analytics now for like almost 10 years out, have told that we're past the time where we have to ask that question. Why? and from my perspective, if you're an analyst, if you're a good analyst, if you're good at your job, you will be asking that question. So with you example, in just showing or there is, why, what are they trying to do?</p><p>And they're just trying to increase orders grade, but I really doubt that's the goal. Yeah. And, </p><p>Guido X Jansen: [00:22:19] so there were multiple countries, so one of the countries, they were like a challenger, so they were new in the market and that makes sense. they, yeah. Then you can, you want to increase market share.</p><p>You may even want or accept that you are losing money for a couple of years. Maybe that's fine. If that's a conscious strategy, but not if you applied everywhere for everyone. And yeah, </p><p>Matthew Niederberger: [00:22:39] it reminds me of a Avinash Kaushik, three wise process. I think it was afternoon. And she said, when everybody, whenever somebody asks you for that, you need to track some data.</p><p>You have to challenge them three times and haven't answered that question. Why three times, why do you want it? And they will give you a response. Ask why, again. Yeah. And try to drill down to the core issue that are the core piece of information that thereafter. </p><p>Guido X Jansen: [00:23:02] Yeah, maybe five times, eight times.</p><p>Prolet Miteva: [00:23:06] It is really amazing that, frankly, and we still get to talk about some of these things, which are basics in the digital analytics space. But the funny part is that we still talk about it. And we still talk about it. Like almost like it's new and it's not. so I don't know why is that maybe more people need to go to more events like this and conferences or listen to more podcasts.</p><p>Guido X Jansen: [00:23:29] And so we just spoke to a whim from Mamoa the organization behind this, conference and they, their organization already exists 80 years so far. Before we had something called the internet. but I think so, but internet and having these amounts of data that is still relatively new, right? So still trying to cope with having so much data and growing up the digital is growing up really fast because we have so much data we can and with great power.</p><p>but in that sense, it's still, there are a lot of growing pains still in our industry. </p><p>Prolet Miteva: [00:24:03] Oh, I agree. It's just that would have called that we go past the basics and we start worrying a little bit more about, okay, great. You wanted to show this one metric on your dashboard, but now what is the next level of data that you need in there to start making better business decisions?</p><p>What do you want to layer on </p><p>Matthew Niederberger: [00:24:26] and talking about that? How do you, what's your opinion on how CRO has affected. Data collection, activities. I, from personal experience, I get the feeling that CRO is getting a lot more priority within companies, than optimizing data collection. B is closer to your P and L, which is weird </p><p>because a lot of CRMs it's dependent on proper data.</p><p>Bart van der Meer: [00:24:46] Yeah. But don't a lot of people see CRO mainly as a, the color of the button and an AB </p><p>Matthew Niederberger: [00:24:53] test is </p><p>Bart van der Meer: [00:24:55] the first step that people think about when they think about TRO and then the CRO guy or girl of course has to tell them, yeah, I want to do that. But you do realize that the data I need isn't good enough. </p><p>Guido X Jansen: [00:25:10] I think I'm going to class and spoke about it this morning.</p><p>I don't know if you've visited her session, but she spoke about. We also didn't finish their session cause we're already recording and we get a pass. We spoke to her afterwards, about this being a big problem that, a lot of people in Ciro also don't really, check, if the data that they collect is actually what they assume that they are collecting.</p><p>So maybe there are a lot of assumptions that we are all doing, that the data is correct. Or even measuring what we are measuring or. A lot of people not doing, separates, mismatch, checks before they started analyzing. and, and just hope or assume and hope that it's correct. And then either don't have the knowledge or, yeah, we don't have the budgets for it anyway.</p><p>So let's not bother </p><p>Prolet Miteva: [00:25:55] or, one thing I'll challenge though, is being in the subscription based business, which more and more of the businesses are in that direction. It's great to get the initial conversion, but if you don't retain that customer, then it really doesn't matter for me, if you convert somebody and then they leave a month later, that is basically wasted money because often depending on the cost of your product, that conversion might have cost you more than that monthly fee.</p><p>So as you get more and more, especially in the subscription based businesses, Starting to think about the retention, the renewal that the customers are doing becomes more and more important because ultimately where you're going to be making the money is that when you get that customer and then you have to stop thinking about that.</p><p>When you have to stop thinking about trying to onboard them, you have to some process that gets them. To stay. You have a product that's good enough that gets them to stay. So sometimes looking at that only initial conversion starts to become obsolete because it's not relevant for a lot of the companies.</p><p>Granted it completely is dependent on your business, but that's why some of the basic metrics. Yeah, it doesn't matter. </p><p>Matthew Niederberger: [00:27:16] That's an interesting point because I know from personal experiences and not on a company level, The, there are a lot of Dutch companies and I think it's, I'm looking at a photo and you read that Bart's, the, energy companies, they would offer premiums for new customers.</p><p>So you would get a huge discount or you would get a tablet at the time. Remember those tablets, they were giving away </p><p>Guido X Jansen: [00:27:38] the same with the telecom </p><p>Matthew Niederberger: [00:27:40] companies. Yeah. But only for new customers, not for the people, not for the customers who are loyal and willing to stay. That's </p><p>Bart van der Meer: [00:27:47] highly incentivized to switch every year.</p><p>Guido X Jansen: [00:27:49] Yeah. It might also be different by a data problem, because I love that. Like Google analytics, you're almost well, the default setup at least, and you lose them, you lose cookies. So the default setup is you can track them until their first order. Yeah. And then, yeah, we don't know. </p><p>Bart van der Meer: [00:28:05] Also with the telemarketing of most of those companies, everybody's rewarded for the first nobody's rewarded for retention.</p><p>Matthew Niederberger: [00:28:14] So why would you care about retention? </p><p>Prolet Miteva: [00:28:16] Yeah. I think that you can do retention multiple ways. Obviously, if you provide too much incentives for switch, then yes, the customer can go and switch multiple times. but at the same time, if you have a product that's good enough that customer doesn't want to switch, then it makes a difference.</p><p>Okay. Your electricity, do you get electricity from one company or another? Probably doesn't really matter. Unless one of them has outages all the time. Then. Honestly, no matter what kind of incentives they might want to give you probably are not going to switch. So it's about making your product better.</p><p>Matthew Niederberger: [00:28:52] Oh, here's an interesting one. You're from America, Amazon and Kindle or NASA, audible audio books. They have the most interesting model that I've ever seen. It's a subscription based model and you pay a certain fee and you get credits every month by monthly or maybe more than one a month to purchase books.</p><p>However, when your men subscribing member, the prices of the books are reduced by a certain percentage and what I figured out, and it's not rocket science, but the prices of the books actually are reduced to a point where they're cheaper than the credit you just </p><p>Guido X Jansen: [00:29:26] purchased. The credits, I think are around $11.</p><p>Matthew Niederberger: [00:29:30] Yeah. Let's say 1195, but then you can buy the book for nine magnifies. what do you do? Do you spend your credit and lose $2? </p><p>Guido X Jansen: [00:29:36] That's all. I'll always look at that site. Logs are like, love the more newer book, like $25. Okay. I'll use credit for that cheaper than 11. </p><p>Matthew Niederberger: [00:29:45] And then they have the whisper sync. If you buy the, if you buy the Kindle version.</p><p>Yeah. It reduces the price to four 95. Yeah. It's and then I ended up saving all my credits. Because I ended up purchasing all, I paid money for the better deals that I'm getting as a paid subscriber. So I don't know what they're doing, but it's a very interesting </p><p>Prolet Miteva: [00:30:04] see though, there is also not an alternative service that you can actually get, so in a way they can do, but </p><p>Matthew Niederberger: [00:30:12] yeah, not as good as a non English speaking people.</p><p>Bart van der Meer: [00:30:15] do you have any tips or advice for ways to promote your analytics? Inside the company </p><p>as a product, obviously, except for wearing a special suit. </p><p>Prolet Miteva: [00:30:27] Yeah. my point was that first we need to start thinking about the analytics as a product and present it as a product to our customers and consumers.</p><p>A couple of the tips that I gave was a little bit more around the launch and how do you go and try to promote it? he was referring about my display advertising, which was making posters and putting them all around the company about that new product of developing leader dashboard or a new platform that you're integrating, doing a social event who doesn't like free food.</p><p>Matthew Niederberger: [00:31:00] I sold it. I sold the slide. </p><p>Prolet Miteva: [00:31:03] Yes. I wasn't sure if they are popular here. Yeah. They're still popular in the us. So yeah. Doing something where you can get people together. To talk about the product that you've developed so they can be a little bit more perceptive receptive. And the other part was trying to get your own influencers on people that will do the reviews for the product that you've developed so they can spread the word for you, but it takes some planning.</p><p>It takes some time. And I will tell you we're not perfect on that because always there is something new that you need to develop. And you are always in that rush of, Oh my God. Let's do new things like doing, let's do new things and you really have to step back and allow more time for spreading the word and making things available.</p><p>Matthew Niederberger: [00:31:50] How do you filter out the opinion of the boss and </p><p>Bart van der Meer: [00:31:53] the donuts? I know </p><p>Matthew Niederberger: [00:31:56] that's an option. </p><p>Prolet Miteva: [00:31:58] are you meaning that the boss would not want to? </p><p>Matthew Niederberger: [00:32:00] no. You have your product. But your boss might have an opinion about that product that he, that conflicts with what the actual end users, have in terms of wishes or of improvements </p><p>Guido X Jansen: [00:32:11] the hippo.</p><p>Matthew Niederberger: [00:32:12] I didn't want to use the word, but yeah. </p><p>Prolet Miteva: [00:32:15] Yeah. okay. Frankly, I'm probably known as probably a little bit of a too onus person at my company and around everyone that knows me. So I don't give a shit. </p><p>Guido X Jansen: [00:32:27] Yeah. </p><p>Prolet Miteva: [00:32:28] Yeah. Okay. I wasn't sure how a humbled scale </p><p>Matthew Niederberger: [00:32:31] where </p><p>Prolet Miteva: [00:32:33] public, right? Yeah, no. I think it's much more important to make other people that are going to be actual users actually adopt your product than trying to worry about the opinion of your own boss.</p><p>And frankly, if you manage to get other support. And that will make your boss look good in front of his boss, because now people are adopting that product. I don't really think that there'll be a problem. Yeah. But also you should have told you boss to begin with, you should have told them, Hey, this is what we're doing.</p><p>And this is why a lot of times, depending on the manager, if you can put it either in two ways, either how it's going to benefit the business or it, how it's going to benefit them. It's works. Depends how </p><p>Matthew Niederberger: [00:33:20] much? 10%. </p><p>Prolet Miteva: [00:33:22] Yeah. </p><p>Guido X Jansen: [00:33:23] Yeah, exactly. And ideally both. Ideally. Yeah. Matthew, you joined the session. What's your main takeaway or your, now productizing your services?</p><p>Matthew Niederberger: [00:33:33] I have been thinking about it. Definitely. I was very surprised about the planning and that does, does fall into place with what I've been experienced. I do a lot of time management and I, when I come into companies, there's. Nine out of 10 times, there's no documentation. There has been no prior planning for the data collection activities that companies have been doing.</p><p>But what I really liked, and I think it takes a lot of guts. You focused on that during your presentation is the retirement. Sometimes you need to let go and move on. and I think that's a critical part, especially for looking at the developments in tools like Google analytics. We've had classic analytics, we've had universal analytics.</p><p>So now for a lot of companies, there'll be a let go moment to move on to webinar. So I think that timing of your comment, that the last piece of the process is very important and that companies will need to embrace that letting go moment and move on to webinar as Krista site and said the writing's on the wall.</p><p>This is going to become permanent and the companies will have to change. </p><p>Guido X Jansen: [00:34:30] So as in letting go of the use for data collection or </p><p>Matthew Niederberger: [00:34:35] moving on to the next version of the tool? Yeah. </p><p>Guido X Jansen: [00:34:38] Yeah. </p><p>Matthew Niederberger: [00:34:39] Okay. From what I understood and don't hold me, don't hold me to it. But a universal analytics at some point will be a deprecated and everyone will need to move on to the webinar.</p><p>and that's the letting go part that companies will need to, take seriously in the next coming years. Okay. </p><p>Prolet Miteva: [00:34:54] Yeah, no, definitely the let go part is important. And that's why I tried to put it from the perspective that if you retire something, you get the full permission to do something new innovate and create something new.</p><p>And everyone should be excited about that. I imagine that everyone who is working on Google analytics implementations, they should be excited about the new stuff that Google is bringing in because, Hey, how long have we been doing universal analytics? I think it's now be like five years. Aren't you tired of it?</p><p>Matthew Niederberger: [00:35:28] I think I'll have a launch party. </p><p>Bart van der Meer: [00:35:29] Usually people are a lot more excited about new things then about, optimizing the existing. </p><p>Matthew Niederberger: [00:35:35] There's a funny anecdote. I think I just wrote a blog post about it because Google, tag manager just turned seven years and I'm often seen as the odd ball at parties because I get very excited, enthusiastic about new releases and Google tag manager.</p><p>But within my social group, nobody has exposure. Everybody looks like and speaking, cling on. When I say, Hey, did you see the new custom templates in Google tag </p><p>Guido X Jansen: [00:35:56] manager, </p><p>Matthew Niederberger: [00:35:58] but we need to, start using those things and carry on with what we're doing and hopefully, possibly, improve what we're doing.</p><p>Prolet Miteva: [00:36:05] Yeah. You look at something that you currently have. If there is an opportunity for improvement, you improve it. </p><p>Guido X Jansen: [00:36:14] I think that's a great note to end the podcast on, Matthew product. thank you very much. I hope you guys have a lovely day and a lot of these stay in the Netherlands, so I would assume.</p><p>Prolet Miteva: [00:36:25] Thank you. </p><p>Guido X Jansen: [00:36:25] and we'll, look for, </p><p>Bart van der Meer: [00:36:27] yeah, thank you very much. Thank you.</p><p>‍</p>",
  "show_notes": "<p>With analytics finally taking center stage, you are thinking “But what is next?” The truth is you are already further on the path than you might imagine. Move from data projects to data products and take the next step in moving your company and yourself forward.</p><p>Het Digital Analytics Congres 2019 vond plaats op 8 oktober 2019 in de Jaarbeurs in Utrecht en wij deden live verslag vanaf de conferentie. Meer over het congres kun je vinden op <a href=\"https://www.digitalanalyticscongres.nl/\" target=\"_blank\">https://www.digitalanalyticscongres.nl/</a>.</p><p>DAC19 werd georganiseerd door het Expertise Center voor Marketing Insights, Onderzoek en Analytics beter bekend als MOA. Meer daarover kun je terugvinden op <a href=\"https://www.moaweb.nl/\" target=\"_blank\">https://www.moaweb.nl/</a>.</p>",
  "guests": [
    {
      "id": "prolet-miteva",
      "name": "prolet-miteva",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    },
    {
      "id": "matthew-niederberger",
      "name": "matthew-niederberger",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "https://youtu.be/ER77B3sL3GA",
  "main_image": "src/assets/images/episodes/analytics-is-a-product-treat-it-as-such.jpeg",
  "language": "en",
  "type": "podcast"
}