{
  "id": "are-you-a-movie-critic-you-might-be-great-at-cro-with-sumantha-shankaranarayana",
  "title": "Are you a movie critic? You might be great at CRO!",
  "description": "We learn how Kaspersky approaches and combines CRO for B2B and B2C and how a movie critic might make you a great CRO!",
  "date": "2025-01-09T14:36:18.242Z",
  "duration": 3482,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/c94477d2/d56671c4.mp3",
  "transcript_url": "<p>Guido: [00:00:00] First off. of course, thanks for joining me, on the CRO.CAFE podcast. but for us, we would like to know a bit more about you and your backgrounds because, almost no one, had a, as a background, studying CRO at school. That's not a thing for most of us. in recent years, there are some colleges picking this up.</p><p>but for most of us, that's not our background. So we would love to know. How'd you get started with this and, how did you roll into zero as a profession? </p><p>Sumantha: [00:00:27] awesome. first off, a lot to be heard a great podcast. I've been listening to other episodes and, you're right.</p><p>CRO is not taught in schools and things like that. Forming it started off, it's really strange, I started optimizing storylines and scripts and things like that by watching movies. Yeah. I, one of my first movies that I saw in a church, it was just </p><p>Guido: [00:00:51] the original </p><p>Sumantha: [00:00:52] it's back then in 94.</p><p>Yeah. 1994, since then it started, relaying out. Okay. What if the director had made the skirt in a different order? Or what if there was a flaw and the director did not took it up or the film crew did not pick it up. what if it was jealousy Parkin and those are playing fingerboard, right?</p><p>that's incorrect. not saying that was thing in Jurassic park, but there's so many such misses that you get to see, especially by, by waiting all this work and you have to carry that, that in your. </p><p>Guido: [00:01:26] So you were watching those movies, like second-by-second frame by frame to see what they did or </p><p>Sumantha: [00:01:34] flowing.</p><p>It was just flowing. And I got this intrinsic ability where I could actually pick out floss and state that, okay, this is incorrect. that was a natural tendency because, that's way too back in time. but obviously I studied, grew up, did my engineering.</p><p>And information science and engineering, which is equal to information technology where, and then we're clearly, okay. It had this notion of, technological aspects, the limitations of what a particular language could be and how you could increase to your job performance. And I also had this flare towards, in a storytelling and getting the right concept, the right notion, Jesse things as users too.</p><p>So some of the biggest wins that I've got in my AB testing coders is just by understanding how people actually behave, how they interact with their daily life. one of my biggest AB test success is a 500% uplift. And that happens struck, at the dead of night, problems as 2016, were higher where I had a lot of laundry pending and I had to get my washing machine, up.</p><p>and that thing was happening. And, it was watching this, series, which was called, big bang theory, obviously, a lot what I've heard and, I'm an Indian, And I was at the time working for a us site. So how do I learn cultures? And obviously I've been seen Hollywood movies and I know a lot, there's also this, notion where you get to see a certain things.</p><p>Where do you get to visualize certain things in imagining how things are set up, how things are shown and things like that. on one hand, I've got my washing machine, which is running and that is throwing, different kinds of lights and all of that. Yeah. And on the other hand, I'm seeing a television where we're on the tele.</p><p>penny is talking to Sheldon and they're driving in a car. And children is petrified because tiny car, the engine check light on is on, it has got his attention and his petrified there. Okay. the Island in the engine might not be up to the Mark. So I got this readily available notion where I could connect.</p><p>I was working on a lead gen site and I knew audience at the back of my mind where. but not like gangsters, they could, pick up design cues and things like that. we had a pretty big lead gen form and I introduced phone leech and those are dialer, which is blinking.</p><p>and attracting end-user's attention right there. They could click that easily. You speak to a rep and, give them information and collect everything. And this was based on a particular zip code, but we're recovered sources and things like that. And the next day, when I looked up a little knowledge and all of that, I looked up database as well.</p><p>And yeah, it was through the roof too. So that happened because of the simple change. What I did was in adding animate dot CSS for that. And that was blinking in a way where, where people would interact with actual devices and how, what they are used to, that picked.</p><p>and those need for them to actually, </p><p>Guido: [00:04:40] that's a perfect example of cognitive economics and, how people pay attention and, like indeed with Benny in the car, th the Angela does is blinking, or maybe not even bringing it just turned on, but there's always turned on. Nothing happens.</p><p>So apparently it's fine. Nothing happened so far. </p><p>Sumantha: [00:04:57] Yeah. Dot and, it's. No, it's like a learning tip, right here. What I do is, and I'm always learning I'm, I'm like, I'm, I'm on a infinite learning curve, always learning, even with our conversation and things like that.</p><p>You need this, there's always scope for learning, And it's about, we've laid out on this perfect platform where I'm learning from you. I, yeah. </p><p>Guido: [00:05:19] That's good. </p><p>Sumantha: [00:05:21] It seems it's the same for all century hearing or seeing stuff or understanding context behind it. So the blinking effect, I got that, the Indian check light is always on, but the blinking effect came down.</p><p>when I was laying down an end of the road, it was a busy stretch that there's so many shops around. but only a medical shop are out of, pharmacy got my attention because it's word was popping out a little bit, I would say. And there was this plus sign that, chemists and farmers use here in India, which is a green plus sign.</p><p>And that was blinking there, like literally hundreds and hundreds of shops. And I still recall just knowing this particular connect because. the sign was blinking and it was direct in the, in the line of sight. So I could, irrespective of big Butch and things like that, which are all pilot to me, I couldn't see them.</p><p>And there's this one tiny board which sticks out. And there's that saying? That's blinking and I know, okay, this is a medical shop. I don't have to break abruptly. I know that's coming up. I could go and walk and that's a feature because there's a lot of scruffy.</p><p>There's a lot of classic Marion as well. </p><p>Guido: [00:06:37] Yeah, traffic is that traffic is a very interesting topic for, some of my, my former, colleagues in the university that are in that area in either, traffic for cars on the roads, or I remember a lot of examples, in my study. I've told it a couple of times a bit.</p><p>My study had done nothing to do at university. I had nothing to do with anything online or offline, examples there, but one of them was for example, with, train drivers, or I think maybe the engineers are there are called the thing. The people staring the trains or guiding them over the tracks.</p><p>And a lot of them were missing signs. like the red signs basically, and then they just drove through them causing accidents. And, so people in my profession started taking pictures. Okay. What did they actually see outside of the, outer side of the windows? And usually it's a big mess.</p><p>you really spread, there are a lot of lines going everywhere, especially when you approach stations. There are a lot of different tracks, a lot of, overhead lines. So with all the power cables and a lot of, there are a lot of signs everywhere. and then you understand, yeah, it's, that's information overload.</p><p>It's very easy to imagine someone missing a sign. So what can we do about that and same thing for regular roads? Yeah. </p><p>Sumantha: [00:07:55] No, absolutely. And that's where, when you're designing systems that are building landing pages or working on a product and thing so that you have to have, this user centered solution in place, God has certain heuristics in place.</p><p>Easily. Things could go wrong, just sitting in their shoes and understanding, okay, how was that &nbsp;is going to perceive, the kind of information that you put. you could stay something which makes sense to you as a business owner or as a practitioner.</p><p>But is that tangible enough, right? is that, is that a hundred percent age being compared to the other person who's reading it because in the end of the day, it's all about the sites and things like that because we want to impact, or, the end-user's perception and the mind. and briskly and obviously, the product has to be, full of value proposition.</p><p>If not, you cannot sell it and that's not how it is. and it's simply that, if you miss out on that step, there's always going to be something like this happen where, you don't know, for example, there's a copywriter who's writing landing page for, but does not know who the audience is.</p><p>What does that include if there's no persona, which is in the back of his mind, the kind of want and kind of pain points that he has, this is not something which, you know, such an in such a way where it communicates all the value propositions and all the benefits in such a way.</p><p>But, as, and when a person reach. My Tom rulers. And he'll take us as in when PB people read content. The, if not the head in agreement, if they're not it's so diverse, then try and reach a common point. What would the other person or different types of personnel, </p><p>Guido: [00:09:39] especially if you have a really wide audience for your website or for your product in general, there can be a lot of different ways.</p><p>people view this, right? that's always what I find very interesting when doing user research and giving people basically the same stimuli, or the same website, the same products, and you get so many different opinions on that. it's a bit like you can imagine. Yeah. those raw SOC tests, that psychologists use, the ink blobs and everyone sees something different.</p><p>And you might not expect this with websites. they're less ambiguous than in blop. You hope, but there's still so many different, ways of fueling something because of your background or whatever, right? </p><p>Sumantha: [00:10:17] Absolutely. Absolutely. your background is different, your cultures are different and you're brought up differently and the way you.</p><p>Yeah, there's also this, tests that I recall off where, I think this was conducted in India where, a person walks up to a group of, children playing and says that, this, this Jeff, children playing from different backgrounds and they're poor children in the rows.</p><p>and as well as rich offend families who are coming and playing in the ground. and do one set, this part of the guy, hands out a box of sweet. And she said, if you're willing to wait 10 more minutes, I'm going to give you the two, two boxes of sweet. Yeah. And guess what happens, Oh, Children from rich and affluent backgrounds can wait because they've already eaten such rich.</p><p>they're going to think okay, 10 more minutes. I'm going to get to two boxes. Sweet. It's not, if everything, all of this was the hooks. There's no water because I ended up having to switch anyway. But if you flip that equation and for a guy from poor background for the child from poor background, cause nobody can a box of sewage.</p><p>He's going to grab that immediately and run away. His entire thing was true. and his, when, if it was going to get two boxes, but it's not going to wait. Yeah. this there's just that urge that is not even sweets. And you want to grab that right now and run it. </p><p>Guido: [00:11:51] Yeah. And there's research going on before with doing this exact test with children right then, and, having that as a, prediction for future success.</p><p>And apparently there's some correlation there, at least with the kids that cam weights. Yeah. there you're more patient and not apparently leads to, or correlates to, more successful. If you're </p><p>Sumantha: [00:12:14] at work, especially the newer age, then you will work for us. And, do you don't know how to delay gratification?</p><p>Yeah. It's okay, I want to join a company. I want to reach this sport. I'm going to do the art. I want to do this. but they do not think for second &nbsp;</p><p>Guido: [00:12:32] and that's how a lot of companies are organized. yeah, you have the most. People work with really short-term incentives, whether that's bonuses or just general appraisal for the work that you do, it's all short-term it's, it needs to be successful this week, this month, this quarter, or these, the longest terms board read this year, but it's still relatively short term.</p><p>If you look at my business and I see that as a, that's an issue, that's a challenge for a lot of people specifically in CRO. because it's your appropriate program is not, if you've set it up properly, it's not going to give a big result in four weeks. </p><p>Sumantha: [00:13:05] Yep. Yep. and it's even if you did get it's, it does not mean that it's going to repeat, Because it's a long learning process because it's not about winners and losers. It's insights that you get and the kind of areas that you apply at, if you're at a larger &nbsp;is making billions of dollars. One such insert is this is really going to give you millions of dollars and uplift and hen rubbing you or an average order value.</p><p>And just imagine a series of AB testing in a test across, in acquisition or across, shopping cards and things like that for over a period of near the cumulative car, traveling for a champion in the impact could be huge. and that's what businesses wouldn't understand. And they're like, Okay. So I'm looking to get this done and in a week I've done, things like that in the past, especially concerning where, there was this, particular, huge, them, but I just, the segment is, lots of fruits and classic fridge, and they've got 300, such.</p><p>Yeah. and, I did a simple tear down of their site and the very next day I'm on a plane, meeting their, VP of product, the VP of engineering, the CTO, for example. Yeah. and that support, that we could spread and that impact that we could actually show it to them.</p><p>and this organization had a lot of, best talent around because they came from premier Indian institutes, Like an inch of technology for a champion product managers, they all started in the nineties. some of the great institutes the world has ever seen because in knowledge, the knowledge that these are institutes predators is much, or the technological process is all of this world.</p><p>and S somewhat the employers were part of this particular organization. They did not know what experimentation was or what conversion rate optimization. Yeah. They're open about it. And that's how you're told to establish that rapport between say a consultant and an internal team member, but where they get to see that.</p><p>Okay. That you're an extension of their arm, basically. Yeah. It's not like you go there and say in, go left and right. And say that you did this wrong tree. Trunk does not how it is done. But gradually build rapport and know what's, what's the inside story. What is that they're working on and how is that you could actually help win and achieve, the benefit for the college.</p><p>Guido: [00:15:30] And that's an interesting point, right? Because you also started, the story when you started watching movies, you said, I, I. I developed a keen eye, to, to see flaws, which is useful as a CRO, but it's not, there's not a, there's not a nice trait to have in conversations or in meetings. Yeah. </p><p>Sumantha: [00:15:50] It's it is, there's this $600 go CRO company, which is doing a lot of good business.</p><p>And you go there and say that you're not doing this. You're not in God. just imagine. if I talk about Apple, for example, a trillion dollar company and I go there to a product and say that you've done this wrong, that wrong. </p><p>Guido: [00:16:09] Exactly. You need to do, you need to do some translation, basically into some nicer words, phrases</p><p>Sumantha: [00:16:17] And it was also about identifying certain patterns with what they've actually done stuff. and, there's already a foundation in and you want to create a structure. Yeah. You want to create a creative regimen where that works like clockwork date, this regimen of experimentation of getting things done.</p><p>And we had what a week's time before the huge ad rollout was, do you hear in India? Massive budgets. and we worked on registration and the organization game a lot. Yeah. And they don't have your sign-ups and, if that thing plays already, almost that uplift actually increases your bottom line as well.</p><p>The number of paid customers, because you're putting in more users, in engaging with other apps and websites and stuff. So say it's about. it's a two way street, right? It's about them realizing that. and did, they did mention that they've got on tuition, that's a great sign that, that's a great sign that the client is willing to put effort as well.</p><p>and for our AB experimentation program, we had the top level priority and I've seen some of the best engineers work, work with me in creating a funnel in interviewing teams. Or, we're probably a floor full of 200 odd product designers, contractors, you are testers, in sub routines and things like that.</p><p>and I hadn't number one priority. that's a boost as well, right? I was the kind of guy who would reach early, I was stationed out there, what place for three to four weeks and on a daily regimen. being one or two worst case, the VP of product could always be, but when I was the last day to walk off, because I ha I had this notion of setting desktop, clearing use from the last day planning the day, or planning next days, activities as well, the roadmap, artistic, because we are at a very tight shadow.</p><p>And, Africa was not a problem at obligation. they get millions and millions of views and it's all about bottom line, right? The kind of conversion uplift we could draw. and there's a new advertising, which, which was about role or pan-India. so TV commercials and things are that they're going take scale on marketing.</p><p>That's where, you know what, in this resume and people actually stuck work in the Roger questions. safe. If I'm getting tens of tests done, I was only implementing the winning Williams and the engineers were like, pissed off because they're like someone that you're getting me to build like 10 pages, but that is not going on.</p><p>Guido: [00:19:00] Yeah, it sounds familiar. </p><p>Sumantha: [00:19:02] Yeah. So that's the education, but wherever you have to come and come here that. Yeah, look, if I say all those things and millions of profit, if I'd rather to just a hundred or audience, and you want to test in such a way where. w what do you like to split 50 50 and test and wait, or what do you do?</p><p>Something which is more incremental? Where would you say that, for the first 10 you play affects, or do you apply a particular and learn from that, and I'll play, all those learnings, that came on along your way and all those insights, aren't the next 10, And that's where you're actually employing your concert.</p><p>and tests that you've done for the first 10 it's tucked away because you built on that. We've made that more robust, made that much better. What, where do you want to stick with that? </p><p>Guido: [00:19:53] w we're already talking for a half an hour. but we haven't actually spoken about what you're actually do.</p><p>So let's do, let's take a small step back. and, so what do you do? it's Kaspersky. Yeah, you're a senior CRO, there w what are the kinds of. Projects, your work role and then how does your team look like and that kind of stuff. That's what we want to know now. </p><p>Sumantha: [00:20:13] Yeah. So basically it's a global channel team.</p><p>it's both centralized and decentralized in a way because it's a huge, routine. and obviously the global charity is everywhere. We are going to the UK. Oh, you got an NGO in Russia, obviously in China and things like that. Yeah. and, one, one, one of the key goals is, or rather for any organization for that matter is improve their landing pages and landing pages is more important because, that's your first touch point, be it appeared.</p><p>I had organic landing pages and things like that. And that's where you want to ensure that. you're giving the best information out there for your end users. you're having certain frameworks and growth models in place, where it works best for a particular region. And again, coming back to that us example, maybe that's something which worked in us might not work in Germany because I don't have that local insight in Germany.</p><p>And that's where you study in and bank on research. and we've got a great, or research team in, in Casper scarce world. </p><p>Guido: [00:21:18] Do you mainly work on the B2B or B2C? </p><p>Sumantha: [00:21:20] it's both. Yeah, it's both. It's both. it, it has its separate parallel tracks obviously. and at times you have to wear a B2B hat while you're working on B2B stuff in H it's more like.</p><p>at least for people, especially for cybersecurity and things that are out for any other bigger enterprise stuff. people might see that as a bit boring or, not as, it's more of a perception where people see that this is a bit life less than we received, but that's not the case.</p><p>You could always tweak things. you might have less traffic, but you've got change to do usability test. you're more a qualitative approach, but where it could bank on certain stuff, </p><p>Guido: [00:22:01] you have less traffic to work with, but the impact can also be bigger. Yeah. </p><p>Sumantha: [00:22:06] Yeah.</p><p>It is bigger. And you could give, or at your own flirt, if the flavor of the Bryant for what it's change, for example, for what reason, Kaspersky signs, what he thinks and believes in what the organization. and that's the kind of impact that could be drawing than being more saturated than thinking of this portal opinion that no, the enterprise Plains Lake something, which is saturated and playing and big chunks of text and things like that.</p><p>Yeah. it's more about being, or ensuring that flavor. and capturing the attention of, in the B2B second, because I know today, yeah, B2B is a lot of board of people could be a CFO, a CIO, a CTO. And obviously you're going to target one of a one timing and convert them as an issue from the jumping for your product services.</p><p>And that's how things can change. say it slightly sales cycle could be pretty long and things like that, but that's still okay. at least, that, you're doing stuff that people are roadmap. sometimes some of the key metrics like people should track as is not only let's say, B2B is a lot more, Legionnaire people stick with metrics, open rate, click rates and things like that on image.</p><p>Yeah. And nobody focuses on something like, okay. How many of them actually replied back? did you receive a positive set for every email that you sent out? Did you get enough mileage? When did you get something in a routine? that's the kind of conversation that we want to carry out in one of such B2B deals could be several dozen.</p><p>Yeah. </p><p>Guido: [00:23:45] Yeah, exactly. And like I said, the main bottleneck might not even be on your website, might be email. How do your products, what kind of people do you do your work with? do you have like internal user research front-end development? What are the roles that you regularly interact with? </p><p>Sumantha: [00:24:01] I mean everybody right in starting from research.</p><p>Yeah. There's so many users studies going on, from design teams. So you've got to get in and build, mockups. there's the spark teams, as web product managers, engineers, basically front turn through a stuff the entire, whatever it takes to run a website, good. We technology product marketers. </p><p>Guido: [00:24:27] They're also like, somewhere with an equivalent role, like you a bit focused on the product itself, </p><p>Sumantha: [00:24:34] that's that's right. I think I come in or rather was what's the origin idea of me working for Kaspersky where it's just not only shadow, but what else?</p><p>Carry the spark mentality. And come with what, an approach where, what I think a lot about the users and how they see stuff and how they perceive stuff. And that's what is artists is one of the duties of our product managers is to interact with customers, get to know how they see stuff and fill that gap.</p><p>And in such a way where, detecting could understand our requirements. And basically that is the case where. Know, obviously a CRO team internally is leading this initiative in terms of translating certain requirements where things get simple enough so that it could be quick.</p><p>And it's all about the kind of approach that you take. For example, I'm a big believer in lean principles, lean methodology. that's something where </p><p>Guido: [00:25:29] the skill set is already there. </p><p>Sumantha: [00:25:30] But yeah, , it's the kind of implementation that you have in, and those are the there's a big organization, got like 500 teams internally across different regions.</p><p>and the sheer amount of uplift that we could get from existing traffickers is massive. The opportunities are massive. And given this COVID-19 backdrop, it's really important that, we test and learn. Yeah. it's this highly scope of things that we could actually be, shipping off.</p><p>the intensity, could be a lot more than it's. It's also interesting because you get to work with interesting stuff. Interesting products, both in British, and we'll be in touch some of the best drug, Kaspersky. And you actually come from my understanding or just last year alone. We've probably bagged 900 French across U S Europe, China, Russia.</p><p>when you're backing patrons, that means the product, is pretty good. and we've entered, I think almost 84 independent test assessment. And we were number one in 64 or of them, and at least, top three positions in almost 80% of those tests. So that is something.</p><p>you, your product is a great fit. It's, we've been doing a lot, especially for the medical community. there's this thing where we're entire portfolios of Kaspersky, but free for medical institution is hospitalization. Things are act, and it's, we have the part, And that's something which comes come from Eugene. where do you want to help people out? and or not on the Casper skill or later product inside the secretary alone. He also has this, pension for other startups and things like that for tourism. if you go look up his Instagram account, he's traveled all places.</p><p>And that's where he wants. He wants to foster the culture of startups in zoom in to say that. So when you're at that bar, when you have that ability to do help or the society, why not? </p><p>Guido: [00:27:35] Yeah. That's but that's, I th I think that's very interesting because the skill set that we have as hero can be applied across multiple, aspects of the company.</p><p>Especially, I get that. Yeah. she Rose often, at least first applied in marketing. that makes sense because that's where you usually have the largest numbers yet. If it's on the website, it's your own, it's an owned medium. And that's where the largest part of your, user or, potential user base.</p><p>So you can run experiments there. but if you're a large enough company, you can still apply these same methodologies. to improve the product itself or the service side or email, or </p><p>Sumantha: [00:28:12] absolutely. Absolutely. that's, that's how it should be. if you're an enterprise with a lot of, both what we do see customers, I think we product worth 400 million.</p><p>Guido: [00:28:22] That should be enough traffic to run. They,</p><p>Sumantha: [00:28:29] and we've got like this there's so many stuff that we could do. it's tantalizing, it's time cred. and if he went on business side of things on email lifecycles and things like that, because you could bucket everything out. Okay. what's the welcome sequence that should be right?</p><p>what's the nurturing sequence. What's your conversion sequence? whatever, like I said before, a lot of people are not as much. what's your win back program going to be like. You could literally keep on employing </p><p>Guido: [00:28:57] interesting part. So you, we, you have so much traffic, so it might be like a luxury problem.</p><p>but so how do you &nbsp;prioritization is something that always comes up almost for everyone at every company. So how do you do, how do you decide where you can start working? Because you have you not only have the website, you have so many areas of the business where you have. Enough traffic enough people to do AB testing.</p><p>so w where do you guys decide on what are the big 'cause bottlenecks are in the whole process of the customer journey? </p><p>Sumantha: [00:29:30] Sure. Obviously, we follow our own prioritization. She quenching and people are listening in, could be using something by our eyes shot or any other, production template.</p><p>but it all starts with, you have to measure the kind of metrics that you're after. for example, if you're taking landing pages and things like that, if you ask me. I not only think about, getting fast five users on the site, but I also think about having those customers for five years.</p><p>Think of metrics where, it's, don't think about your CAC, the initial, traction and think that, okay. You're Ross says F as far as the one or something like that, but think about retention and especially in SAS businesses and things that are retention is a big thing.</p><p>What is that you do for. for lifetime tomorrow, what are the aha moments that you feel occurs? in the entire journey or in the entire life cycle marketing of </p><p>Guido: [00:30:21] right. Okay. Like usually about SAS companies, often with e-commerce the focus is really on getting the customer to buy ones because that's easy to measure of course, but in the SAS business, you don't really care about that.</p><p>That first, the first month it's important, but it doesn't bring you all the money. This is not that valuable. If you just look at the monthly </p><p>Sumantha: [00:30:39] subscription, Margaret are focusing on just buy, you're missing out big chunk, And the bigger challenge, which is on under tension.</p><p>And how do you especially see if you're working on learning, which is more on acquisition, how do you prime users so that they continue to go down any right. You've got a number of possibilities, </p><p>Guido: [00:31:03] especially when you have so much data, you can almost start working on. Okay. How can we maybe introduce roadblocks actually, to prevent people to sign up that we already know.</p><p>Okay. To just sign, they're going to sign up for one month and leave. We're not gonna make any money. </p><p>Sumantha: [00:31:20] Absolutely. And on the other side, if you've identified the profitable segment, Or user type or an orange. Yeah, you could also explore further down how have subordinates is in type and, seats.</p><p>You want books, the best you could have personalized. And then the content, which is to speak to them. And that's the whole point, right? You're here to help your end users. You're here to show them what's, uncover, product benefits. For example, it's your time. Yeah, it's, at least in my experience have never then something where I get everything on the platter and show it to the user switch because that's a lot of information, a whole load as well, a content to know that one.</p><p>So it's about understanding, pursue a particular page. if they're experienced users, would this call or two page about to just. understanding the key point or there's a noise user who wants simple explanation as to what the product does. So based on that, based on such a basis, you could actually have a better landing page experience.</p><p>our site-wide experience, your value score could literally go up because you've given them such cues and notions where people could actually understand it and understand, okay. Okay, this makes sense. Okay. I've not thought about this particular question and it's good that the site is, has covered us in an African section.</p><p>Yeah. it's about that. uncovering the journey and actually, having this laid out to them where they understand that, okay, this is how it should be in an ideal world, and this is what I'm getting. it's about, there's always this notion of, perceived price versus perceived cost associated to that.</p><p>and obviously that's where you come in and show them the value for a particular sort of, or product and why they should be using it. And it's not always a yes. Trap. It's not I come to you and say, Hey, do you have a minute or so that I can explain this to you. Yeah. So that's where I understand what's your pain point and ask, What if I did this too, to solve your pain point, would you be interested to know that or, do you think that you should just let that go by? You're like, no, let me know what he's talking about.</p><p>and just change our perception where we bring in the actual one effort, then being more saturated than being, No, just the CEO of sameness right now. How </p><p>Guido: [00:33:48] do you do photography? Are there like any, particular things that you do within, within the company to build on that?</p><p>That's your old culture to get more people on board with. Okay. let's do, experiments and, let's validate stuff instead of just implementing. </p><p>Sumantha: [00:34:04] Yeah, that's a great question. And that's what I think, the industrial team is working on and actually building a sphere of influence and how do we do that?</p><p>We do that by being transparent by showing them, look at the kind of wins that we actually running in your market, and this is what we could actually be doing and also go a step forward and help them understand by. By showing them certain frameworks and things like that. And explain to them that you could actually be doing this.</p><p>Yeah. And it start a notion of every employee contributing. let them start contributing. let your team do the prioritization. </p><p>Guido: [00:34:43] But how are you explaining Ciro to people that are not familiar with it? How do you, what are the tactics that you apply, to convince them, Hey, you should be doing this or let me validate this or however it's arranged, but how do you try to convince them?</p><p>Sumantha: [00:34:57] Yeah, it's more a couple of things could happen. One, if there's an already a believer in the room, Great. We understand that your SROs code and w we should invest behind that. The other thing is there's a non-believer in the room, And that's where it gets interesting.</p><p>And you want to get to a common point like this analogy of me speaking earlier of nodding, yes. to everything. what have you read and how do you get to a common point? for example, if there's a room full of such people. You asked them, do you think you're the most smartest person in the room?</p><p>Yes or no. They might say maybe not the smartest, right? you reached to that common point and that's what data helps in romaine all those assumptions and opinions and all of that. I am not the smartest in the room as well. It's understanding that notion and coming up with hypothesis that actually cleared an impact.</p><p>so that is what you've actually shown to them. That dissolve it in a way. Unfortunate. </p><p>Guido: [00:36:00] I think when I would ask, people, if they think they're smarter than the room, that almost feels like insulting. It's almost indirectly implying that they're stupid.</p><p>Sumantha: [00:36:13] we could, you could change that and ask, who do you consider is the </p><p>Guido: [00:36:17] smartest? </p><p>Sumantha: [00:36:19] And they might say one of the colleague or the manager, it goes upstream or downstream, or whoever is younger, new. And there's a point, from where we could actually start from. And we could, I've used prioritization templates where, you know, including, on the client side, I've let them score hypothesis based on their assumptions, based on their biases and things like that. And collective, we have taken a prioritization score and, gone ahead with. But explain marriage because what do you have to all to understand is that there are certain docs and businesses that I don't understand.</p><p>Yeah. that optical company understands that particular question was head of her department or understanding. And he's going to see that, it has, an opinion and grid stuff. I might have, the greatest test idea and things like that. What if the engineering implementation took like.</p><p>Daniel 14 days, any of you load away a certain men in Virgin and actually show traction. and that's in your hardcore metrics to follow in the grind of uplift and then friendly what you're getting. And obviously you should not shy away from AB testing, step one, what's positive or senators and things like that.</p><p>Your sample size has to, you win. If you hit 99%, each are expensive. There's no harm in doing that for two or three more, which, and adjust just to be pretty damn sure that it's that's what is actually working. You </p><p>Guido: [00:37:45] have, accumulated quite some sort some experience now with, with us to Euro, what is an insight that you think you might have that others that are listening right now might not have what's something that you've figured out and that we can use that we can use it on work.</p><p>Sumantha: [00:38:03] I think, yeah. I think what I've actually figured out as a consultant much before joining Kaspersky was. seeing a trend of similar problems coming up. Great, similar problems that needs to be answered, same set of questions and in same sort of, while it's like someone that we data real time, there's no end world that you could impose.</p><p>Yeah. </p><p>Guido: [00:38:25] Data.</p><p>Sumantha: [00:38:30] that's where, I saw two aspects to this particular thing where one, I thought, in all these, in all the scratch, the, in this there's always a consultant who could build a product to fix such problems. It's, it could be anything either.</p><p>You. You've super zoom in and build a product or you go out clouds, bundle everything and make product and solve such problems. So that's one insight that I figured out. And on the other hand, in a sense it is almost rudimentary, right? to stand in Delaware, optioning results. It's this is what we had agreed upon.</p><p>and that's it. The engagement is done. Yeah. and our. It's like the same questions, that keeps trying to put coming at you. And there's this notion where at least I've heard that in a consulting could actually come up with an expired deck. There could be active consultants to, doing great stuff, getting prepared greatly as well.</p><p>But I think at some point in time, a lot too. Think about, making money from product. how long could you keep on doing contract and grade? </p><p>Guido: [00:39:40] It's usually a limit that's at least how most work is limited to the hours you can put in. And there's only so much hours a week. </p><p>Sumantha: [00:39:48] and if you, and it's great that you've done that you've observed companies at close quarters and you might come up with certain, product ideas and actually build it.</p><p>And that's when you make your money. </p><p>Guido: [00:40:01] That's nice though. That's what we all want. what are the, and making money while sleeping? what are the things you want to improve or change, in the coming 12 months? What are the things you were working on? The projects that you are excited about? </p><p>Sumantha: [00:40:15] there's, this, there's a lot of exciting stuff happening at Kaspersky,</p><p>but, in general, Yeah, in general, w where Hellbound on unimportant user experience. Oh, there's a lot of stuff which we're actually doing in a good, you could just imagine the kind of sheer amount of work that we're doing, like two hours of work, which has being shipped in six months.</p><p>So there's a lot of testing with just coming in this is a lot of Velasquez and it's, that's great for any organization, right? Because if somebody is, in a partner up and is jumping with energy that's French. In every, each and every organization within that strata, that energy spreads.</p><p>And that's where I see Kaspersky at, the sheer number of projects, the number of tests that we're doing, the number of, impact and results that we're seeing the testing impact and all of that it's fed that, great page and then things are slowly ongoing. we're actually explaining and.</p><p>And, taking that to different package or telling what different insights and that leads to, new set of hypothesis, new sets of testing. And that's how it is. This is always progress. And as long as it does progress, it's better than perfection, right? We're just going out, getting things done.</p><p>and there's this positive </p><p>Guido: [00:41:34] we're optimizers. So we also like to optimize the way we optimize. So it is it's very much. Yeah. Thank you so much for sharing all your thoughts, about this in the podcast. like I said, in the beginning, you've been listening to a couple of episodes, yourself too.</p><p>So who do you think I should be asking on the show? Who do you want to listen to? </p><p>Sumantha: [00:41:58] I think, I've been, bye I'll check out Dynarski or the guidelines or good guy.org is who's the editor in chief. and, I think I'm not sure if he's doing an episode before, that guy keeps on testing a lot.</p><p>there's so many stuff that we've been doing on goodyear.org. I think which, which would be a nice addition. </p><p>Guido: [00:42:18] For the people that don't know the website, he basically, monitors a lot of those, the bigger websites like booking, bull, Netflix, those are things that regularly come up and he basically monitors them, for changes on the websites.</p><p>and that's, they're running and sharing those results with us. </p><p>Sumantha: [00:42:36] it's more on his, he's also a gung-ho bird or repeatability of winning tests across segments. and this has got a big data repository of such stash. I think he'll be a wonderful addition and, being tight-lipped on Kaspersky.</p><p>So maybe our VP of digital &nbsp;next time when it does, there's a bit of relaxation and then software. Very good. No, maybe literally walking into a run on the kind of stuff we've been doing, hopefully </p><p>Guido: [00:43:04] sure. you can introduce me to Ivan, right? Yeah, for sure. Thanks. And, as a final question for you and any Shiro related books that you'd like to take to our audience, what did you enjoy reading lately?</p><p>Sumantha: [00:43:20] one of the best absolute, gold standards, at least in my, ISIS is dr. Flint. McGlaughlin, he's got Mac labs, marketing, SharePoint, and a bunch of, courses as well on landing page optimization or non online testing. And all of that, he's written this great book, which is called us, marketers as a philosopher.</p><p>and there's a great of bunch, good stuff on, in terms of his qualified, how convergent sequence would come out to be. He's got a formula for conversion. So to speak 30 yard, years of marketing research, he, it goes something like this. She used to go to forum plus three plus two, all of minus F minus to it.</p><p>There you go. &nbsp;</p><p>Guido: [00:44:06] yeah, that's it. We don't need those. A number of courses or education. It's just simple as that. </p><p>Sumantha: [00:44:11] We reading the formula. . it's simple and very performed, right? and this, the C stands for obviously the conversion sequence or the M in that Stanford motivation V in that stands for the force of value proposition.</p><p>I send for incentives, you have Stanford fiction elements present on the site and a as anxiety and image. So obviously, these are all the kinds of tourist techs that come into picture and his she's just given a magnitude four for each of those. if you're highly motivated, even if the a hundred hurdles you went across all of them, but then, and that's where magnitude of motivation is the highest, which is for them next comes to force of value proposition, which is three weeks, right?</p><p>the next biggest, an entity with the money to do it. It's of course a value proposition is that high. then obviously you're going to go ahead similarly for incentives, for friction and an exert element and for remote anxiety elements, which is minus two and in the form, then that's great.</p><p>good for users. Good for the site because you've not induced anxiety or are biosimilars, for example, you bought a product and you're anxious that, okay. You've not made it made the right decision. So things like that. So Hasbrook is a great grid, which is, doulas as a philosopher, he goes a lot of </p><p>Guido: [00:45:32] good stuff.</p><p>Yeah, </p><p>Sumantha: [00:45:34] I'm on bio-psychology on how you actually, do things. Yeah. So that's there and there's so many books, right?</p><p>Guido: [00:45:48] we have a, I'm collecting a list of books, that's a Ciro's, basically it all recommends, there are so many marketing books, but he wrote cafes slash books. I'm trying to collect, all of the books that are, guests, recommends. but </p><p>Sumantha: [00:46:01] I'm sure. I'm sure some of these might or might have popped balloon.</p><p>Guido: [00:46:07] This one hasn't been in there. Yeah. So I'll definitely add that to the lesson for people that want to read more about this, the conversion formula for M plus three V plus two. Times one minus F minus two a, that might be a bit </p><p>Sumantha: [00:46:21] abstract for this, but there </p><p>Guido: [00:46:22] will be more, information about that's, in the show notes.</p><p>If you want to read about that, someone has thank you so much for sharing all this information. with us and sharing your story, starting with, evaluating movies. I think that's a background I hadn't heard before. I think that's a great, great backgrounds for our forest.</p><p>Zero a specialist. thank you so much.</p><p>‍</p>",
  "show_notes": "<ul><li><a href=\"https://endlessroi.com/\">Endlessroi.com</a></li><li><a href=\"https://www.instagram.com/e_kaspersky/\" target=\"_blank\">Eugene Kaspersky on Instagram</a></li><li>Formula from Flint McGlaughlin: <a href=\"https://meclabs.com/about/heuristic\" target=\"_blank\">C=4m+3v+2(i-f)-2a</a></li></ul><p>‍</p>",
  "guests": [
    {
      "id": "sumantha-shankaranarayana",
      "name": "sumantha-shankaranarayana",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "https://youtu.be/gRNPzs25pSY",
  "main_image": "src/assets/images/episodes/are-you-a-movie-critic-you-might-be-great-at-cro.jpeg",
  "language": "en",
  "type": "podcast"
}