{
  "id": "building-and-scaling-your-cro-agency-with-steven-pavlovich-and-daniel-markus",
  "title": "Building and scaling your (CRO) agency",
  "description": "How to sell an A/B testing program to a new prospective client and how to deal with those clients asking for specific results like a 10% lift in CR",
  "date": "2025-01-09T14:36:18.242Z",
  "duration": 1343,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/b2f1ea84.mp3",
  "transcript_url": "<p>The first question from the audience was about how to sell an AB testing program to a new prospective client and how to deal with those clients asking for really specific results. Like for example, eight, 10% lift in conversion rate. </p><p>Daniel: [00:00:36] If they, if they give you, Well goals like that. Then you, you, as an agency, you should say, well, okay, but then the way we're going to reach that, that will be our decision.</p><p>Because if you also say, we need to do that with five tests every month, and you have to do that in 10 hours, every test, and you can't guarantee that kind of results. So well also in your sales, you need to balance that kind of challenges of what your clients want and also manage the expectations.</p><p>Because, yeah, I stay one both and it will not go, it's not going to work, but that's mostly, basically the two kinds of flavors that you can sell. You either sell a results or you, you sell just work and, yeah. And, and, and, and that's also how you organize. </p><p>Guido: [00:01:22] Yeah. So we have, we have very similar to it.</p><p>Typically we try to understand what the. What the goal is that the client has, they will normally come to us saying we want to increase our conversion rate and that's as detailed as they get. So we try to interrogate that, that goal to understand, is it, do they really mean revenue or profit or a profit per user, whatever the metric is.</p><p>We look to understand that. Then we try to define, are there specific targets that they, as a company have to achieve within the next six months or 12 months so that we can align our work today's because then exactly like Daniel says often they will have an idea in their mind of what they want. But typically that is not necessarily what they need.</p><p>And so it's our, our role as the agency to, to partner with them, to help them better understand that. And I think there's always that challenge between, so we have maybe, I don't know, there might be a potentially a third time, which is you've got the delivery clients who want, we want X experiments per month.</p><p>You have the target clients where we want to hit this target. And the rest is up to you. And the third type of ones where we would partner with the client to essentially augment their. Experimentation team. And that means that we can do the delivery work. We can do the performance work, but other random stuff comes up, you know, price experimentation, for example, that may not necessarily fit into any of the other brackets.</p><p>And we can support on that as well. So that's, that's the ideal time, because that way we can direct our work. to the requirements of the business and then set kind of quarterly targets that we want to achieve. And then also worked for clients that want to do this in house. Right. So that they can do within us.</p><p>They're just missing some skills. You can augment that. </p><p>Daniel: [00:02:56] Yeah. There's one thing. There's one thing I want to add there. Whenever a client comes to you with whatever well, and to have we, we always have some kind of hidden agenda in our, in our mind to get them more mature, because it's, like you said, in the beginning of your question, that it's a process where you were, were you looking for, Some, some genuine increasings, to, to, to their results.</p><p>And of course, when they, I come to you very immaturely and they say, yeah, we want five tests a month because, well, somebody told us that that's the kind of philosophy we can reach then. And so that's what we need. And of course we all know here that that philosophy itself will not get you any results.</p><p>You need some sophistication in it and just. And for the sophistication, you need time and trust. And that's what we always try to do also with our clients to, to work on their maturity. And it's just something you do in everything that you deliver with them, that you also help them in getting more mature, because then you can get more results in the longterm and that's the way to grow it.</p><p>Yeah. </p><p>Guido: [00:04:08] Omar, did you have a second question? Yeah, actually I forgot two more time to think about it. without putting me on the spot, but, so starting out, you probably had a lot of challenges yourself. I can phrase it two times or two ways, but let me do this. what would be the best advice you would give yourself?</p><p>If you could go back in time to say, okay, don't do this again. That's the first question. And also you guys have grown your businesses pretty big. does it get better? I growing it because I see there, I spoke with a lot of you guys and I see that there's a tendency to, okay. Maybe if I go to 15 or go to 20, I go to 30.</p><p>If I scale a bigger and bigger, it will be better because are you saying they look tired? No, I'm just, I'm just asking. So it get better. Does it get, what would we, the best advice as well? So sorry. W w would be the advice would you give herself? Okay. Let's do it. Does it get better? It gets different.</p><p>Like, I mean, you purely in terms of cash, I made more money when it was just me. Then when this company of 25 plus people, does that mean it's worse now because it's good, fun working with a team of people and seeing them do good work. so does it get easier? Some things get easier and like, you don't have to do, like when it gets to a certain scale, there are some things that you can just give to other people, finance, HR, things like that, that I don't really enjoy doing.</p><p>And then let other people handle that. So that's certainly gets easier, but then the problems get difficult. I think the biggest challenge, if you've got an agency with any number of people, is that you're not, like I said, a minute ago, your, your wage bill, the amount that you have to pay each month will stay.</p><p>Typically the same or will go up, but then clients can bounce around. And so that can be the biggest headache, you know, a couple of clients or a couple of wins either way can make quite a big difference. And in terms of, if there was one thing that I would change, or one piece of advice that I would give one to myself, I think, so it can motion like.</p><p>Start the year. I think we're close to 40 people. We're now close to 25. So we had to do a restructure. earlier this year, this year, I think it was something that was affecting a lot of the agencies in the UK, Nicholas nodding, her head. so the challenge that we faced at design was with essentially built up cash reserves in the business so that we could, allow for something like that.</p><p>So if we did have a period when we were making a loss and we wouldn't have to kind of jump. Too early. and so we absolutely did the right thing there. I think the one thing that we didn't do was we don't know, we got a little bit complacent, I think. so there were some changes that we should have made a lot sooner in terms of the, like the structure of the business.</p><p>and the people that we're hiring. I think we let a few things, go that maybe I didn't pay enough attention to myself. I think I'd stepped back a little bit from too much of the day to day. And I think it was an easy mistake to make, because when you're running, when you've got, I don't know, a 2 million pound a year wage bill, you have to focus on sales because if you don't, then that's not going to come in.</p><p>But I think we have to get the right balance. So, we took the company back to being a little bit smaller of a 25 people and now in a much, much better place. And we are being much more cautious in terms of hiring both because we don't want to hire the wrong people because of the effect that that can have on the rest of the business.</p><p>But secondly, also, because we don't want to commit to that ongoing. Salary, unless it's fully justified. So I'd much rather use freelance or contract until we get to the point that we've got enough visibility on the requirement of the requirements of the business longer term that we can afford to hire that person.</p><p>Alright. Would you give yourself a different advice, Daniel? </p><p>Daniel: [00:07:47] Yeah. It's an interesting question. And since, and it's very hard to answer. It's an excellent question. Yeah. It's yeah, it's an excellent question. It's I couldn't raise it better. the, the most important thing is that you stay true to yourself.</p><p>And, and what happens is, is, well, I know you a little bit and you're, it's similar. You just like your work, then you, you, you put in the extra mile for your clients that's then they reward you with more work and then suddenly you think, Oh, I can handle it myself. And then you hire somebody and that's a very big step, but then suddenly, well you hire somebody more and more and more, and then you are an agency and that's how it started.</p><p>And well, we are now with more than a hundred people and, and it's, it's way above my head because I'm still this analyst and I just love data. And the main, main reason I always want bigger clients is that it gets more interesting data sets. And, and I also think, I think that that's getting interesting data sets and interesting clients.</p><p>It's interesting for the staff that we hire and that's why they want to stay with us. So that's how I regard it. It's just a game for me, that sentence. and, and, and I can't control it anymore and not myself, but a thing. I did this, I always surrounded myself with people that, like the things that I think are important.</p><p>And I don't like, so I don't like finance. I don't like. HR, or I like HR, but somebody told me I'm very bad at it. And so then I thought, well, probably hire somebody for it. And that's also how I grew the business. So I always thought, well, okay, if I hire these people around me that do all these essential things, it enables me to, to stay true to what I like and love.</p><p>And that's also what keeps me going. Or get me out, gets me out of bed in the morning and directs me to work, or it doesn't direct me. I go there because I really like it. So </p><p>Guido: [00:09:52] what hiring people is that the only way to go? I mean, you could also use different freelancers. </p><p>Daniel: [00:09:58] Sure. It's just surrounding yourself with people, but hiring is, is, well, it's a way to cooperate, but of course, surrounding yourself or share your sheriffs is also a way of getting together with people.</p><p>And of course, yeah. Well with some people, well, I shared my sheriffs and with some people I hired them. That's, that's how we grew the business. And, but what I always looked at, how do these cook people? Well, that surround me, compliment me in, and I was very fo &nbsp;cused on, on that. I could continue doing what I love, because if I can't do what I love, I'm very unmotivated.</p><p>That's a, so to keep the motivation, I always. Keep that focus. And I think that's a very important aspect. And that's you, you're also vulnerable in it. Well, sorry. I honestly say I can't do these things. I don't like them. I'm very bad at them. Of course. That's sometimes very hard to say because she, Oh, you also have to admit it you're lazy or clumsy or whatever.</p><p>And of course, yeah, well, everybody, that's a vulnerable thing. So, but I think it's important, that you do that sometimes. So that's an advice that I give. And another advice is that when you are in doubt about starting something and engagement, like hiring somebody, or let yourself be hired by clients and you have any doubts, stay true to them and don't do it unless you really, really have to.</p><p>But whenever I had doubts about somebody, it always turned out wrong in the end. And because I did it because yeah. Then you rationalize like, Oh yeah, but it will work out. And I really need this kind of guy or girl, or I really need this client now because it will enable us to do so. And so with the money, it's always turned out wrong.</p><p>So stay true to yourself and it's easier said than done, but it's been </p><p>Guido: [00:11:51] stay true to yourself. Omar, next question. Ali has a question or. I had a quick one. do you do revenue sharing with your customers when you get to certain goals or not? So we don't do, we don't do pure revenue share. As in, if you do X, we do.</p><p>Y what we do is we'll use B because that can, that can change the nature of the work that we do. We will do performance-based deals where we might have a gateway in place where we will hit this chart, this target, and then it will trigger it. A longer engagement, for example, because it, revenue share like the challenge with that is it's not, it sounds good upfront, but then when you do the work, the client, they want to do, they want to dictate the experiments that you run.</p><p>You want to have complete ownership of that. It also means that you can't do anything that doesn't correlate to the goals that you set originally. And often it means that you spend more time doing due diligence on each individual experiment, as opposed to actually just doing more, more good work. I th I think everyone's advising against doing a revenue share.</p><p>they're there except Danielle. but I do see, well, full revenue share. At least there are some there's some hybrid models. </p><p>Daniel: [00:13:04] Yeah. I think you're you're right when it's only CRO it, it never works out because if you're doing too well and somebody, your clients has to pay you a hundred thousand euros for 10 hours of work.</p><p>Well, they do with once and then they're gone. So, so then it doesn't work, but we do revenue share for a comp for clients that outsource their full online marketing function to us. And then for instance, we work on that. We say, well, we get so many percentage of your revenue. And then we that's our share and we, we, we, we deliver hours for it, hours of work.</p><p>And then of course we can invest in growing the business. And then of course, when the business doubles also the, the amount of, of, management failure for us, the doubles as well. And that goes very well. And then it don't care anymore, whether we spend it in, in, in, starting some new channel or. increasing the philosophy of zero tests and also the, we don't report on the CRO tests.</p><p>They only want to see the lift and they also don't care how we did it because they don't want to learn from it. They just want to grow and then it works. But if it's only zero, of course, yeah. We have equally bad experience with it and we don't do it. </p><p>Guido: [00:14:18] Any more questions. Go ahead. Hi, Nuria from Google here.</p><p>I have like a two part question. So the first one is I've been talking to a lot of agencies in Nordics and Benelux, and I have three findings, and I want to know if you concur with those and then the second part would be kind of your wishlist. so it's kind of an interesting thing, but, cope with me.</p><p>So, so the first thing is, agencies across Nordics and Benelux have been telling me. that they have a problem in terms of how their visibility is shown towards different stakeholders within companies. So it's very difficult to quantify, you know, what are we doing? It's all these failed experiments.</p><p>Why are you paying us? secondly, it would be like in terms of dashboards, like how do we, yeah, go about KPIs, et cetera. And it has to do with the awareness of clients that they will just come to you and give you maybe a very vague, brief. So how, what can we do as, you know, as a company like Google to increase this awareness around, right.</p><p>KPIs, and then thirdly, I think it's all about, about how you sell yourself. so, so what kind of upsell cross sell etc of your own services? Could you actually be, positioning within these companies? And so those are kind of like three major issues there and, I'm new in my position at Google and we're looking at things that we can do to train.</p><p>people doing CRO worldwide. So it's kind of an ask of like, what things do you see that are gaps and what you would wish that you had training in? So if we take the first one, the, which I think was about visibility as, and how do you get the visibility within the client? Yup. You're absolutely right.</p><p>That's there's a problem that our industry faces in that, I guess it was what I was talking about a little bit earlier. People think that what we do is kind of tweaking and landing page or finessing. The finished product and we just kind of Polish it a little bit at the end. if that's the perception, then obviously no, one's going to give a shit about that within the company.</p><p>Instead that the first one that I made today was like, you should focus on the biggest problems that the company faces as in, if you can find out, like some of the stuff that we do at the moment on price testing. So we were experimenting on two different types of pricing, for example, or experimenting on products or essentially something that the business is going to care about.</p><p>You find out what does the CC in this company care about? What are the investments they're making? What are the risks that they're, that they're taking and then test around that, then it's a completely different method because you don't have to kind of push your, we tested this landing page and this is what will happen when we move the image from here to there.</p><p>No one gives a shit about that. If you say. We we tested five potential new products. One of them converted 50% higher than another. Do you want to load, do you want to see what the results were? Everyone is going to care about that. So I think the first one, the most important thing is to test about what people care about.</p><p>And obviously that's going to be much more meaningful for the business anyway. </p><p>Daniel: [00:17:06] Yeah, I agree. Yeah. Share the results because most people in, in, in larger companies that the web is only a small part of it. So. Yeah, we encounter the same things. And this is a way to get attention in a way. The problem that you you mentioned is, is more general because it's, it's the entire digital marketing, discipline or functioning in an organization.</p><p>So I also see that there's too little attention for that. So if they don't care about digital marketing, they also don't care about the optimization of digital marketing. And if they don't have a tradition of experimental approach to decision making, then they don't care about our experiments. It just the waste of time, because it distracts them of the, of their focus and their speed.</p><p>So sometimes it's it's way too, too, too hard to, to conquer that. It just takes a lot of time and trust. And you, you need to have some successes and the successes will get you your moment at the table. And then they suddenly think, Hey, yeah, that brought in a significant amount of money. And then you get your, your sheriff attention.</p><p>Guido: [00:18:21] One question that you can ask is, we often ask this during the kickoff that we have with the new client, which is, if you could test anything on your website or about your business, what would it be? And they normally start with some Fetty tame, mediocre answer, like. Oh, I redesigned the basket page or something like that.</p><p>But then if you try, if you actually push them and say, like, if you had a parallel universe where you could do whatever you wanted to about the business and nothing would matter, like what would you test then? And that's when you start to get these more interesting ideas and then you think, Oh, actually this one, we could probably test something around that and test something fairly simplified, but still meaningful.</p><p>And then building the, start building the mindset around that. I would also argue that as long as Google AdWords is still effective and bringing in a lot of money, they people are, the companies are not really incentivized to spend money on that conversion. I dunno, like we so often when we, when we start working with a new client, they, it's not like they have in line in their budget for conversion optimization.</p><p>So normally the way that we will often start working within Yukon is we will take budget from their Google ad spend. And then we will generate our own budget. We we'll pay that back within four to eight weeks and then we will grow it from there. That's going to go over great with the Edwards team, but it makes them more money eventually.</p><p>Daniel: [00:19:37] Yeah. But that's something where Google can, can make a change because what happens now is it's the way your AI is, is basically making a human management less and less important. The next step in, in managing Edwards accounts become integrating CRO and Edwards because the bid management and the keyword select we'll be done automatic.</p><p>So the only thing that a human can do to optimize results is put in proper CRO and it's it's it's landing page optimization, matching between ads and landing pages and that sort of thing. And you can educate your clients in it. You can educate agencies in it. And of course, yeah, we can educate their own stuff.</p><p>But also when more people in, in, in companies that do advertising know about this, then it will be much easier to shift this, this budget because yeah, the, the, the reluctance that you just indicated is really there. People really love their budget. And when we say, yeah, but if you spend 1% and we get a 1% lift in a month, then the other 11 months of your yearly budget, we'll add 1% extra, which probably won't do it with, with keyword management or anything.</p><p>So that's something you could do. </p><p>Guido: [00:20:53] A lot of ideas here, I think. Thank you so much, Danielle. Thank you so much, Steven. Thank you for, for all the questions. I do have one final question, for, for Steven though, you were now conference formerly known as conversion hotel. I think you can see where this is going.</p><p>You have conversion.com. Yes. Are you now considering changing your name to just, just to load logo, formerly known as conversion.com or something like that? I think I've got to stick with it. You can stick with it. Good. Thanks everyone. See you back tomorrow at two o'clock and if I'm correct, the bar should be open now.</p><p>So have fun having a good evening.</p><p>‍</p>",
  "show_notes": "<p>This is a bonus episode recorded live with audience pre-COVID-19 at the Conversion Hotel conference in November 2019 on the island of Texel in The Netherlands.</p><p>‍</p>",
  "guests": [
    {
      "id": "stephen-pavlovich",
      "name": "stephen-pavlovich",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    },
    {
      "id": "daniel-markus",
      "name": "daniel-markus",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/building-and-scaling-your-cro-agency.jpeg",
  "language": "en",
  "type": "podcast"
}