{
  "id": "contentsquare-virtual-breakfast-panel",
  "title": "Contentsquare Virtual Breakfast Panel",
  "description": "We learn about the impact of COVID-19 on a SaaS video platform, car lease and an big ecommerce/marketplace. How are they coping with all the changes?",
  "date": "2025-01-08T20:07:07.493Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/9e5a29a6.mp3",
  "transcript_url": "<p>Guido: [00:00:00] thank you, Lisa. Hello, Fabian. You managed to do this last minute. Very good. yeah. Welcome everyone. we're going to do a smaller panel session ending at, 10 50. So we have around, just below half an hour, to get you a. To get doing this, which we're going to talk about getting ahead in eCommerce and it's going to be interactive.</p><p>everyone's invited everyone listening here invited to ask some questions in the chat. of course, these are some big companies than, with legal departments and PR department. So they might not be able to answer everything. but we'll, we'll definitely do our best to answer most of your questions.</p><p>Yeah, short introduction of the panelists you for her that is a talking to about it. So we won't take too long. We have brought from a journey, especially &nbsp;dot com. now all my rights, I think also on your rights, below me, we have Lucas false from optimizing online platforms at ATL needle on that's specifically a video launch.</p><p>They're a streaming service. And then the corner across from me is far beyond Kiersten digital. I'm a director of digital marketing skills and service at least plump. yeah. So let's start, with, the first question from my side, at least. And now I look at the stage, for the incoming, questions.</p><p>but let's start this, open it up. today's topic is about getting ahead in e-commerce. Which to me please sounds like knowing what's coming next. which is inherently difficult. Of course. but first question, that's the boss from, both gum, how is bold as golden forecasting and our hours that's, impacting how you handle customer behavior.</p><p>How are you forecasting, changing customer behavior? </p><p>Bas: [00:01:36] Hi. Good morning. Yes. Perfect. All right. I think, a large part of the focus of &nbsp;has to do with, with the way the teams are set up. So each, most divided the number of separate teams and each team is responsible for, a specific part of the product groups on Volcom.</p><p>we have more than 20 million products on our website, so we. We decided to categorize, those product groups into teams and these teams do most of their for custom for much part. so that gives us, yeah, I think a grand strategic advantage because those small teams are really, really going to blow up the product groups they're dealing with are able to forecast quite actually accurately because.</p><p>Guido: [00:02:19] What kind of data is going into that, is it external data or only internal data or combination or, </p><p>Bas: [00:02:25] yeah, I think both, we look at the market, of course, but also what did we do last year? how do we expect the market to develop? How do we expect both to develop, what the product, will be, will be edits to the collection or maybe, </p><p>Lucas: [00:02:38] Maybe even, </p><p>Bas: [00:02:39] to lead is one of the collection.</p><p>It's a combination of both. </p><p>Guido: [00:02:43] Yeah. In your section currently as a bicycle, camping and outdoor, I can imagine there are, there have been some changes last couple of months in those sections. what are the things that you've implemented changes that you've implemented based on those changes? </p><p>Bas: [00:02:57] I've only recently joined the new team, Or the 1st of July. before this, I was in the, the sports section, and some of the changes we noticed there were for a large part of the court to chose you to Corona. when actually waited at the state home for grownups, basically everything changed. So in the sports section, what we saw.</p><p>we had the old Lisa exercise at home materials, and they just went nuts. For example, we sold a third of times, the amount of dumbbells in one week that we saw in gear for, in the same week, basically the same goes for a prolapsed range and those were obvious stages. but we also have some change tree we saw coming less.</p><p>I think. So for chapel, we sold the 92 times the amount of badminton the next, in one week, then we saw the same week last year. and.</p><p>Guido: [00:03:54] Sorry, everyone already has a table or Bradley. </p><p>Bas: [00:03:57] Yeah. Yeah. badminton. but yeah, everybody has a field or at least the backyard, people want it to have something. </p><p>Fabian: [00:04:05] Yeah. </p><p>Bas: [00:04:06] some of the judges, as a, as small shopping team, you have to, you have to really adapt to this because you're announced, nobody was really prepared for Corona, of course, but, yeah, we had a limited amount of stock.</p><p>So you have to look where you can get extra stock. you have to look at pricing, you have to look at it. but just it's obviously, because she has those two months is a challenge in itself. So those were </p><p>Fabian: [00:04:30] all really </p><p>Guido: [00:04:31] challenging. Yeah. And, so I can imagine that's a &nbsp;some categories with apps I'm currently, or as you went down there, it's a mixed bag.</p><p>and that's, I think something you need to shift gears with different categories or get your focus, I don't necessarily have data about the automotive industry, or these incarcerate specifically, but I can imagine that's a, that's an industry that's been there hits much harder, in a negative way, unfortunately.</p><p>and so if I'd be on, have you and your team are able to make, quick decisions home, how have you done this and how have you adapted to this new situation and, in general, do you have any tips on teams to be more agile? Okay, </p><p>Bas: [00:05:11] thank you. Thank you very </p><p>Fabian: [00:05:11] much for the question. I think it's a very loaded question.</p><p>Lots of different aspects to look at indeed. And also of course, to the bit of background, I'm busy managing a central digital team, which looks at the 30 plus countries. So that means we also have to have a very, a global view on what was happening, especially with the covert situation. And one of the things that we were focusing on predominantly, whereas to look at the search intent that we saw on either on Google or also on the social channels to really follow a little bit of trends in terms of how people are actually looking for, leasing solutions or mobility solutions in general.</p><p>And as you can imagine, people being locked down, it was of course, quite an interesting development that we also saw then with the search. Insights that we received. So we had to really realize that also we look at the curve from the stock market over the last couple of months, we saw some similar behavior also when you looked at the search intense.</p><p>And so we kept a very close eye on that. And actually in the last couple of weeks, we actually saw that we surpassed actually search intent. From previous years, quite rapidly. So it was an incredible fast recovery. Let us to push also the organization to really move from a, let's say almost standstill situation and seeing that we didn't know exactly what to expect to try and to accelerate growth again.</p><p>And that's of course, quite a shift within a couple of months time. And that also meant, of course, that we had from a team perspective. And to look at things that we need to ramp up really fast again, while we've had actually more or less divested in the last couple of weeks before.</p><p>So what was, get back to acceleration mode. And it was a, that was quite heavy because, also as, the unemployment numbers are arising and a lot of areas, there's a lot of uncertainty, but at the same time, you see also we sold so that the competition wasn't sleeping. So some competitors of ours, they just kept on go.</p><p>And if there was no covert. So we also had to realize that there is a combination of things that need to be done. So first of all, of course, performance is one of my key focus areas. so that means really looking at, degeneration. For example, we looking on the online, how do you convert as quickly as possible, but at the same time, we also need to realize that when this is a huge aspect as well, right?</p><p>So there's a lot of. Of course, the anxiety of people traveling these days, that also meant that probably more people are not interested in a personal mobility solution. So we saw already quite a rise in mobility searches in the beginning of the year before covert. but now I think it becomes even more interesting.</p><p>So there's a tremendous amount of education that needs to be done. So we really have to look at. A combination of, let's say raising, basically the awareness parts, educating the market further, and really giving them insight on what leasing is all about and making sure that they really understand it.</p><p>and then secondly, of course, making sure we can put the right office in place. And that also meant that we are looking more and more into capabilities to optimize our medias. Bent as well, meaning that we need to look at, how can we target better? How can we build more insights also? How do we use, potentially social more as an eCommerce channel as well, instead of just our platform, really trying to engage customers and let's say prospects where we can, I find them.</p><p>And especially in the small, medium enterprise and privately sector, there's of course tremendous. Opportunities there. Whereas we originally are coming more from a corporate sector. but especially in the SME and the private sector, we expect a significant growth in the coming. Months. So team wise, I haven't really changed to that.</p><p>To be honest, it's more about acceleration actually in my domain where we say, okay, we need to go faster and building better insights. And we need to make sure that we can use data more efficiently going forward. And of course we've seen quite a lot of differences in countries, right? So at the Southern countries versus the Nordic countries, Also total different behaviors and that's sorts of dancing.</p><p>We need to embrace while following basically global templates. Do you answer the question, but please ask them if you, if I need to clarify some things, </p><p>Guido: [00:09:37] you feel like the business, we'll be back to a pre Covitz numbers before the end of the, </p><p>Fabian: [00:09:43] most likely not. Most likely not because I think the, yeah, it really depends.</p><p>So we don't know if there's going to be a second wave. we don't know how let's say some of the economics going to turn out and we probably also expect that quite a few companies will still find some impact over the course of the year. So we will need to see it. It's hard to answer with yes or no.</p><p>Guido: [00:10:03] Do you feel better prepared for us? If we would get a big second wave? Yeah, I </p><p>Fabian: [00:10:08] think we did get some notes, things out of it. And so things that we might want to do differently next time, definitely keep the pedal to the metal. So that's one thing that we probably need to continue doing because, what we're looking at changing customer and consumer behavior, we saw of course, a tremendous shift towards online purchase behavior, right?</p><p>So you look at all the big groups. Last in the eCommerce industry, especially, they're all growing like crazy. So of course, for us, the really good indicator that we just need to do better, what we do online. And of course, Omni channel is a big topic also for us. And so that also means we need to really combine often online, a lot more, going forward.</p><p>Guido: [00:10:49] Okay. so yeah, we had the mixed bag at the, at Boulder, depending on the category, but at least plan going down and now we have video launch. I think the streaming services in general, it had a big boom when everyone was certainly at home doing nothing. I haven't been having much more time, at their hands.</p><p>but for video streaming, you don't suddenly. Can create a more serious or more movies or more content, like that, I think. so Lucas, please, with those restrictions, how have you been, how have you been able to, how is video they'll be able to benefit from the situation? Oh, </p><p>Lucas: [00:11:23] that's it.</p><p>Everyone can hear me. Yes. Okay, great. I think we can split that up in two sections. The first section is, directly, hitting us, like in, for Netherlands was a whole March when the government decided to just basically have a smart lock down, like we called it. And then, number search we have, everywhere.</p><p>Yeah, sitting at home, so they want to do something. And then they look at streaming services and, in that period, we had also our main title, which was already planned, but we, just, made it a little bit earlier, like one week more called mafia. So that was just another, a shell riser, all the growth that we have seen over the past couple of months and its growth that we, yeah.</p><p>it's a really big. And, but now we having a little bit of a backlash of it, because, you can imagine, all content productions, needs to be recorded and, there are sometimes some intimate scenes in it. And, yeah, that's a bit, a little bit difficult when you have a one and a half meter it's just time.</p><p>because yeah, those can be done. yeah. The whole concert production industry is also really effective because it can do the work in a way that it used to. So they have to adapt as well, but yeah, sometimes just script already written. And how do you do that? yeah, you can imagine for all kind of content production or Intel deficient, both crossings scenes.</p><p>we have another challenge how to, yeah. after that, content planning a little bit of what we do, but that's, initial planning, Yeah, it's thrown out of the window, but we had already, we have benefited quite a lot. and we were really happy with it and almost argued, software developers has, to run overtime because of, yeah.</p><p>such a performance demands from our service because we have a very data intensive, surface. yeah, it's quite, yeah, it's quite a lot. You need to adapt on that as well. </p><p>Guido: [00:13:19] So maybe have you been able to, I'm not sure if that's even a thing for you guys, but I've been able to add external content.</p><p>You should just buy more content for people to watch. Sure. </p><p>Lucas: [00:13:28] I know our content team is really watching, introduce those opportunities. but yet again, you, then you have also quite some competition because. most of the dose, Colton things are a little bit of extra exclusivity.</p><p>So if Netflix buys it's from the Netherlands, then, we leave, we are empty handed. and, yeah, it's constantly with the getaway rounds and, yeah, it's it. Therefore also the competition on, already available content is also pretty high, so yeah, that's really something you need to look into as well.</p><p>I, but we has had some release dates already, which, we had to push down into the, into ultim. yeah, I thought also we really would have to have, right now, </p><p>Guido: [00:14:09] Yeah. Cool. And, you also released a new package. I'm going to ask you about that one. after I go through a, to a question from the chat and for everyone listening, please keep adding those questions.</p><p>I think, both, Fabio and Lucas already. Yeah. Answer the question from Chad, let me know Chet, if that's the case or if you have any additional questions, but I have a question for, for boss. yeah, it makes sense. So how do you deal with products which fit in more categories? Like you just told us?</p><p>So there are teams that bolt come split between different categories. but yeah, I think it's easy to imagine that you have certain products that fit in multiple categories and, might across different teams. So how does that work? </p><p>Bas: [00:14:48] Yeah, for example, I mentioned having, insured from, from idealists, it's what in the streets and stuff most, some sports items they're basically designed for sports are also word, especially in clothing.</p><p>yeah, obviously we're continuously asking yourself the question, where should this product be placed in the website? and I think of both, we split this into two different questions. So the first one is where do our customers look for these products? and most of the time of product, customers look for a product in different parts of the website.</p><p>So we make sure to, to locate those products, all parts of the website. So they can it this year, for example, we would disclose the shirt on the sports section, but also disclose it on the fashion section, depending of course, on the Accenture. so that's one side of the story. So just really ask yourself what do our customers want and where parachute, where should they be able to find it?</p><p>And that's really, that's really nice question to ask because it better, disclosed the products. so often without just disclosing that I've really, small parts your site, the other year, </p><p>Guido: [00:15:56] And our teams are teams that are multiple teams responsible for a single product. Does that happen or, </p><p>Bas: [00:16:04] yeah.</p><p>That's the other part of your question? So of course, we are, have to look at which team is eventually responsible for this product. and to this, we just basically set up some rules and make deals with theme store. For example, we would say that, </p><p>all shirts that are, codes that are, for example, other coats, are, are not part of the fishing fee, but are the responsibility, the outdoor team.</p><p>So a customer could find that in both locations, which is to create on effect that. In this specific case, the</p><p>so just, yeah, we evaluated this every year, actually saw if after a while the fashion team says, Hey, that code is actually more professional that maybe after a year they will go to fashion for a customer. There won't be much change.</p><p>‍</p>",
  "show_notes": "<p>Recorded on Thursday July 16th, 2020, as a part of the Virtual Champaign Breakfast session organized by ContentSquare and ClickValue.</p>",
  "guests": [
    {
      "id": "fabian-kersten",
      "name": "fabian-kersten",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    },
    {
      "id": "lucas-vos",
      "name": "lucas-vos",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    },
    {
      "id": "bas-van-dijk",
      "name": "bas-van-dijk",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "https://youtu.be/paC_aXUGFT8",
  "main_image": "src/assets/images/episodes/contentsquare-virtual-breakfast-panel.jpeg",
  "language": "en",
  "type": "podcast"
}