{
  "id": "copywriting-for-cro",
  "title": "Copywriting for CRO",
  "description": "Learn how to become great at copywriting for conversion from one of the leading experts on the topic.",
  "date": "2025-01-08T20:07:07.493Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/7845cae0.mp3",
  "transcript_url": "<p>Guido X Jansen: [00:00:00] They were going to talk about the copywriting for conversions with Joel. My name is . I show you the behind the scenes optimization themes about data driven. And implementing cultural education and the validation in case you missed it. The previous thing was as Jay Davis</p><p>in the house, you level up, you can listen to that.</p><p>Now this episode is made possible by our apartment's online dialogue sites. Bye. Influence institutes and welcome to season two, episode five, Joel, a warm welcome to the cafe. You have to start off with. We always like to know our guests better. So let's start out with </p><p>Joel Klettke: [00:01:07] how you became </p><p>Guido X Jansen: [00:01:08] involved with </p><p>Joel Klettke: [00:01:09] zero.</p><p>Yeah. So my journey to Sierra was basically a series of falling ass backwards into different roles. I didn't knew know existed until they were my job. I started out. I just started, I, this wasn't really a thing when I was, it's not like I dreamt of growing up to be a conversion copywriter.</p><p>It wasn't a role really. direct response exists, but I was oblivious to it. And so I started out very much I always loved writing, never saw a career in it all. I didn't want to be a journalist. I didn't want to, be an author. And so a whole world of writing, marketing writing, and yeah.</p><p>Then conversion copy later on, I was just blind to it. went through university, wound up doing a degree in entrepreneurship because I liked being around people who did things. And didn't just talk about doing things. I like the practical application and that kind of energy wound up at an agency doing SEO.</p><p>so that was the first. the very first sort of job that I had that I didn't realize was a thing until it was my job. So all of a sudden I'm agency side, and now it's my job to optimize for search engines. And so there, I got my first introduction to the world of analytics and the fact that, okay, the work that we do can influence search engines, but I almost got, I got like simultaneously a great education there and a bad education there.</p><p>The great education was seeing, okay. The analytics side and being able to measure all of this. And that's where I started to get introduced to the whole idea of the online conversion of the bad education I would say is at the time I was in SEO, every emphasis on the copywriting side was like a bad emphasis.</p><p>It was like, how can we get keywords as many as possible into this thing? How can we, it wasn't, they didn't see, I was with was not a spammy agency. We did things right. But the prevailing knowledge was like contact was second and there's all this other stuff that went into SEO.</p><p>And then the Panda update happened. And all of a sudden the entire industry started to turn its face towards content. And all of a sudden this skill that I had kept in my back pocket and even told the agency, Hey, if there's an opportunity, like I enjoy doing it, but I don't, I understand all of a sudden it was one of the most valuable skill sets I had.</p><p>So I started writing for our blog and then I started writing web pages for clients. And then I started expanding on what I was doing on the SEO side. And now I was seeing this joint alignment of. analytics and creativity and the way the two played off each other. fast forward to 2013, I knew my time at the agency was coming to an end.</p><p>I knew that I didn't want to do SEO forever. So in 2013, as this whole trend of online content was really getting attention. I thought it's time for me to go out. It's time for me to go and do this. I had been building up my client base while at the agency taking all my first projects getting used to that.</p><p>So in 2013 in July, I went out on my own. Originally focused on content and I enjoy it, that it was very safe. It was very easy for me. But then I was introduced to the work of Joanna Wiebe, the queen bee of conversion copywriting, anyone in the industry who doesn't know, who do you want to is Gola corrupt.</p><p>You're going to fall in love with her work and what she's done and the way she teaches things. but Joanna was my first taste of seeing that direct response copy could be applied really well to the web. And then it didn't have to be sketchy. So I had seen in the past, like my early exposure to the field I'm in now.</p><p>Was like the really sketchy, we've all seen them, like the long form sales pages with 10 different fonts and awkward highlighting, and then a picture of software in a box, even though no one buys software in a box anymore. But it might, really again, negative. And it's honestly scared me the field because.</p><p>I was nervous about the idea of having to have my copy tied to a direct outcome. It felt like a big leap for me. So I was hesitant to get into it. And then when I met Joanna on digitally and saw her work and saw, no, I don't have to Hawk fitness. I don't believe in, I don't have to be, a shady.</p><p>it's not about manipulating people. It's about helping them understand now being to make intelligent decisions and using the moment. Yeah, they have, then it was sold. And so now all of a sudden, all this education I'd been getting in the background of understanding the analytical side and my love of writing.</p><p>Finally, I had a home for it. I had a role for it. And that was conversion copy. And so that was in about 2014. And ever since then, I haven't looked back. It's been my core focus on my own consulting work, and I've been trying to level up the, my own analytical skills and all of that since then. So that is the story of how I wound up in a role that I didn't know existed.</p><p>Guido X Jansen: [00:05:37] We'll get an idea of what kind of projects are you working on right now? besides becoming a father for a second time. So yeah. approach, hopefully wind down a bit for you a couple of weeks. but about what kind of, copywriting, work are you doing </p><p>Joel Klettke: [00:05:49] really focus on the, marketing sites side of things?</p><p>Landing pages? I work with a lot of software companies and subscription-based services. And while I can do across the entire funnel. So I have worked on ads and I work on landing pages. I've done email nurture sequences, and I do sometimes take on all of those pieces for a client where I'm deepest, where I'm most focused is that landing page primary marketing site.</p><p>I get called into a lot of situations when companies are either considering a redesign or considering a pivot in their business. So for example, with HubSpot, they were moving both the redesign of the site and then also introducing a freemium model. And what's the implication of this on our funnels and our copy and all of that.</p><p>I get brought into situations too, where things aren't converting, the way they should be or leadership thinks they could be. And so my job is not only just to bash a keyboard and write new words, but to diagnose why might this not be converting? what could we change? Why should we change those things?</p><p>So I do a lot of analysis strategy and research, and then I'm focusing a lot on the core marketing sites, the landing pages, and then inevitably touching on pieces like the ads as well. And then whenever it's email, I team up with someone like valgeisler smarter away. They're specialists. They're really deep on the email side.</p><p>I just love the copy piece of that. most recently my last project was for a company called union Creek. they are a supply chain, softwares for CPG brands. And so solving problems like they're to give a practical example, it's an integrated platform, two different products and two different audiences, small to midsize businesses, an enterprise, and the enterprise only cares about one of the two products they'll only ever buy the one, but small to midsize businesses might get both.</p><p>And then the pricing that they have is very modular. So a lot of like complex situations, I get brought in to bring some structure to that, understand how do we position and sell this diagnose and fix conversion issues and set companies up to convert better. So that's a lot of what my focus is on now.</p><p>Guido X Jansen: [00:07:54] zero in general. the work with the D analysis, looking at the customer side of things, but just specialized on the copy side of things will be, would that be accurate description? </p><p>Joel Klettke: [00:08:05] There's a lot of, </p><p>Guido X Jansen: [00:08:06] is there a love zero elements in your work? </p><p>Joel Klettke: [00:08:08] There has to be. Yeah. I go through the same process that I think a lot of CRO people do and would have to, but yeah.</p><p>Specific to copy. There are elements that are really critical. A lot of conversion people will focus on the design and for example, fantastic company called the good and they do e-commerce here. And they are really good at looking at the actual design elements and the user experience elements my job though, while it touches on that.</p><p>And I contribute to conversations around that and inevitably wind up, suggesting changes to that. My job is really helping my clients understand how their customers think and make decisions. What motivates them, what pain points do they have, what outcomes do they want? And importantly, how do they talk about those?</p><p>So a huge amount of my research that is sometimes a little bit unique. Is getting that voice of customer data and doing surveys, doing customer interviews, trying to look at again, what motivates them getting beyond like the cardboard cutout persona, like in marketing, everyone talks persona half the time their things invented around a boardroom table that have no grounding in reality.</p><p>My job is to flush that out and make that a real person and challenge the assumptions there. So I look a lot at how people make decisions and I look a lot at. How they talk about those decisions, how they interpret information and bring that back into the topic yesterday's brainstorm was so good. I really liked step's idea of running that test on the call to action buttons, making them orange will really make them stand out.</p><p>Don't you think? </p><p>Guido X Jansen: [00:09:43] Yeah. Do you want to design a real AB test winners and achieve enormous conversion uplift, then stop, brainstorming and take a difficult </p><p>Joel Klettke: [00:09:51] brush. If you can read Dutch </p><p>Guido X Jansen: [00:09:53] follow the steps and online influence the best seller management book Delta now, and rule in the office course and become an expert in applying proven behavioral signs yourself.</p><p>Go to &nbsp;dot com for more information and free down notes. So more. Do you know if you're speaking, there are a lot of neuro specialists of course, listening to this podcast since we're focusing on CRO, you're specifically, trained to look at the copy of things. what do you </p><p>Joel Klettke: [00:10:22] see if you </p><p>Guido X Jansen: [00:10:23] meet or talk to, or see the work of, more generics heroes specialists?</p><p>What do you see? What are the mistakes that we make? </p><p>Joel Klettke: [00:10:30] or </p><p>Guido X Jansen: [00:10:31] whether it's assumptions about the job that you do or the actual implementation of copy or is, and using, the research and how we. Use that to, to improve things. </p><p>Joel Klettke: [00:10:40] I think sometimes there's a bias toward design and don't get me wrong. I love working with conversion, people who are deep on the user experience.</p><p>And, but I think there's a bias to w when that's the tool in your toolkit, that's always how you want to solve the problem. Restructure the page, look at where the attention is going and so on and so forth. I think some misconceptions about my job is that it's just branding or it's just positioning. But the work I do goes beyond that.</p><p>It's my job to understand again, how do people make decisions? What information do they need to hear and how do they need to hear it? What order do they need to hear it in? how do we communicate that in a way that's actually going to hit home for them? It goes beyond, it's a lot of like hallmark things about my field that people just take for granted as yeah, that's obvious.</p><p>Like we all hear features versus benefits and right. To the benefit, not to the feature. In some cases, it makes more sense to write to the feature when you understand the awareness level of the people you're talking to. Or a lot of people think, shorter pages are better or people don't read.</p><p>That's one that I hear all the time, like even from seasoned converted me. no, this page is too long. There's no way they're going to read that. I think the thing is. My job, everyone, everyone that I know that's excels in conversion cares deeply about the people on the other end of the conversion and the whole psychology of it that, but I think my job gets ratcheted up to another level where it's that motivation peace.</p><p>So I think some of the common mistakes that I see are just treating copy, Window dressing or an afterthought, or it's we'll engineer the design. And then, the copy will make fit into the rest of it, or it doesn't really bear that much weight. I think a lot of the time too, where there's the temptation for someone who doesn't know the design side, to come in and start making recommendations, like change a button color, put this there and thinking that's what conversion optimization is.</p><p>Similarly on the copy side, people say, let's just test the headline or let's just test the button copy. But a lot of what I do. Is understanding, for example, something that's commonly overlooked as the awareness level. if we use the analogy of a suitcase, I need to, if I want to take you on a trip, if we want to go somewhere together and you're carrying a suitcase, I need to understand what you've already got packed and what I need to help you pack to get you to the point that, we can go somewhere.</p><p>If we want to go to Antarctica and you've got a suitcase full of bathing suits, I need to help you pack a park on warm clothes and so on and so forth. So too with awareness level, what someone brings into the conversation with them, how much they know already directly influences what you should say to them and how you should say it.</p><p>It's possible to have a beautiful, wonderful, perfectly engineered user experience. And it's possible to understand all the pain points and benefits, but if you communicate those things in the wrong way, at the wrong time, you'll lose the conversion anyways. So those are some things that kind of get glossed over or overlooked.</p><p>it's easy to treat copy, just like I say, in the same way that people disrespect, design. Yeah. And treat it like decoration. It's absolutely not. It's easy to look at copy. And I think sometimes it's just words or it's just what we can just test every part of it. Or we should just it's this formulaic approach when really.</p><p>It's communication. It's a lot of understanding that goes in </p><p>Guido X Jansen: [00:13:50] and I can imagine nuts often when new ones size our design, they start with a wire frame. But then you are basically, you are already stuck because then it's already defined how much space you have for your copy while. It might </p><p>Joel Klettke: [00:14:03] feel, </p><p>Guido X Jansen: [00:14:04] very illogical to someone like you.</p><p>And he's saying, but I'm might need more or less, or, </p><p>Joel Klettke: [00:14:08] yeah, that's really the thing. And the best projects that I've worked on, something I've had to learn. And that I actually love now is as the copywriter, my job is to study user experience, study design so that I can have intelligent conversations.</p><p>So I'm not coming at it from a myopic. Copy first, all the time mentality. Cause a great designer will take a concept I've written and find a way to visually present it. That's better just better than I could even think of him when I can think a little bit on the design end or that side of things.</p><p>My copy becomes better. Similarly, if you draw all the pictures for the story before you define what the story is, how do you know there's going to be this alignment there? So all of them, the best projects I've worked on have been with. Conversion focused designers are Ceros who get that the two interplay really well.</p><p>I think there's like a mantra of the copy should always inform the design should always, for me, it's not like that the best way to do this is right. I write to a wireframe, but not because I'm trying to take a designer's job or to my way or the highway, but so that communication can be iterative.</p><p>So I need to know how to wire frames so that I can go to a designer and say, here's what I'm thinking. Can you make it better? And instead of copy, like defining design, I prefer to look at it as there's an opportunity Trinity, to do this in lock step. Whereas, yes, I need to have the space and the opportunity to communicate in a way that will make sense for that person to buy in and to get the information they need.</p><p>Yeah. I'm not writing off the fact that a designer may come back with a better way of not saying what I need to say, but designing it or making, bringing clarity through the communication of design. So it's really the best relationships happen when both sides know enough about the other to be dangerous.</p><p>Guido X Jansen: [00:15:54] Again, communication also within the team. Completely. So you just mentioned something, I want to dive a bit deeper and you said, sometimes a well, but the default, is that okay? Yeah, we should mention benefits. Not necessarily features. I think this is a nice example. So when would you say how well are you actually do </p><p>Joel Klettke: [00:16:11] need to talk about features here?</p><p>Yeah, for example, with software, We're not, but by the time someone that does so much happens away from the site, now that by the time someone arrives on your marketing site, Yes on the homepage of certain pages that you might be the first solution they come across, but often they're already coming.</p><p>We talk about that suitcase analogy. Often they already have identified their problem. They know they've got a problem. They know that they need to solve it. They've already identified. Multiple solutions are out there. And in the case of software, especially, they're just trying to compare solutions and find out can this solve X problem that I have.</p><p>It's not that we now throw out the window talking about benefits in any case, but we need to understand the motivation and awareness level of whoever's evaluating the solution that brings to the table. So with union create, this was the exact case. We think that by this time, by the time that they arrive on the site, we have content there to help educate people at the very early stages who are just realizing their pain.</p><p>We have blog posts, we have, different parts of the site that are responsible for helping them understand, Oh, if you're experiencing this pain, there's a solution like this, but the actual product pages. So when you go to their operations management page, There's the hero section that very quickly establishes what this is and who it's for and a little bit of why they should care, what makes them unique.</p><p>But the section that immediately follows is just, what's different about union crate. And we want to get that out of the way right away. Cause we know at this juncture, the average person coming in has a short list of things that they're going, okay, I need this. I need this. And what they need to know is what makes you different or special.</p><p>They don't need to be told, if you have this problem, you should get a solution like this. Here's how this solution works. Yes. They want to see the mechanism, but they're past that. To some degree. So by communicating very quickly, these are the features that are unique to them. Ah, and then the benefit of those features, that's uniquely tied to those.</p><p>We can get that out of the way we can help those people. who are highly motivated, much more aware, make a purchase decision. So the blindly, blindly applying best practice in any scenario can be lethal. Because when you don't take into consideration how much your audience knows, where they're at, what point of the journey they're on, then you run the risk of applying a best practice in the worst possible scenario.</p><p>And it's not gonna, it's not going to serve you. Yeah, exactly. </p><p>Guido X Jansen: [00:18:31] Like I said, for example, with software, you can tell me all the benefits, but. Can I just please get a confirmation that it actually works on a Mac or on a windows? What I want to know right now, or can I indeed plug in my HD my cable or use BC?</p><p>Doesn't </p><p>Joel Klettke: [00:18:46] have that board. </p><p>Guido X Jansen: [00:18:47] can I actually use this </p><p>Joel Klettke: [00:18:48] if I want, if I buy it at some point you're, the lead is beyond. Like with a novel solution when you're brand new to the market, then yes, describing the mechanism becomes really important because if you're a brand new way to solve an old problem, then you need to spend more time educating them on the how, or if you're dealing with people who are just realizing they've got a pain point.</p><p>So for the first time they're opening their eyes and going, yeah, this sucks. I want a solution, but I don't know what's out there. It's a different conversation. Like a dumb analogy that I'll use is if we imagine that we're at a restaurant we're sitting across from each other and you have something in your teeth, if you've never heard of floss before, and I say, Oh, you've got something in your teeth.</p><p>Then I need to spend some time explaining to you why philosophy is how you should use it. And then I might say, Oh, here's why floss is better than a toothpick and so on and so forth. typically the more I have to say to bring you to the point that you can go, yes, I'd like to buy some floss, but if you already know you've got something in your teeth, Thankfully, you know what floss is cause God help us.</p><p>If you don't then I just need to, the only thing I need to tell you is, Hey, I've got some floss right here and it's on sale or 50 cents. And enough at that point to buy it. So ignoring that leads to some really stupid decisions, because if we assume everyone is only paying aware, when the vast majority of people coming in are all the way down here, then we're wasting their time with really long copy.</p><p>But then if we assume that people understand all this. And they don't. now we're leaving huge parts of the conversation out. So a big part of my job is helping companies identify where people at with this, what does that journey look like? How do we communicate back </p><p>Guido X Jansen: [00:20:26] to them? Fight spec offer say worldwide unique, AB testing, personalization and product recommendation solution.</p><p>SiteSpect works the service sites without any tags or scripts, which guarantees an ultimate performance, the size solution eliminates delays and the chancellor, the flickering effects. And this approach also ensures that the current and future brows </p><p>Joel Klettke: [00:20:48] like ITP and ETP </p><p>Guido X Jansen: [00:20:49] does make an impact </p><p>Joel Klettke: [00:20:50] on your AB testing translations for more info </p><p>Guido X Jansen: [00:20:54] visit &nbsp;dot com.</p><p>I never actually considered the selling foster, the person I'm having dinner with, but that's so that's a great new business idea, actually, </p><p>Joel Klettke: [00:21:03] Uber to venture. Yeah. yeah, there's a lot of like lettuce or broccoli or things that get stuck in teeth and you can really, that's a good one rack of a lot of dollars.</p><p>Guido X Jansen: [00:21:12] So wait, when you with a new clients, where do you start? I can imagine so many things you can do and you can bring to the table, but you have a new clients. </p><p>Joel Klettke: [00:21:21] So we always, before we just start swinging a hammer around, we want to understand what we're trying to build and what's actually going on.</p><p>So my work always happens in at least two phases and often three, and I'll quickly cover the first two that always happens. The first one is always analysis and strategy. And in this phase we're looking at, okay, information, do we have about the customer? What do we need to go and get? And then I help engineer the research process to go and get this.</p><p>So what I mean by this is, for example, have they done any surveying of customers, like systematic surveying of customers to understand how they come in, why they make the decisions they do and so on and so forth. Have they done any customer interviews? We'll look at that. Do they have chat logs? I want to analyze chat logs to get a sense of what questions are being asked, how frequently I look for patterns in things like surveys, like interviews like chat logs.</p><p>Two types of patterns. One is language. How do they talk about these types of things, but two are the themes. What types of things are they talking about? So for example, in chatlogs yes, often everyone's going to ask about with software, for example, the price, what's the price, what's the price, what's the price.</p><p>But if I'm seeing to join example from some work I did for an online divorce company, when we separated the questions being asked by men and women, we saw very different trends. Men were converting more often. Women were not. So we started looking, we wondered why that is, especially when in the real world women initiate divorce more often than men, the secret answer, lay in the chat logs and the reviews we saw, women were asking more questions surrounding things like I have dependence.</p><p>How will that be handled? Do I have to sit down across from my spouse to make this happen. They more likely to be fearful of their spouse, have dependents, have questions about property. We weren't answering those questions in the copies. So by looking at somewhere like chatlogs, we've got to fill in the gaps.</p><p>So surveys, interviews, looking at chat logs, but then a lot of things that a typical. conversion person would do so watching recorded user sessions to see where the attention is going, looking at things like Google analytics to see the paths that they take through the site. For me, those things are valuable to see what type of information they're seeking out.</p><p>If someone comes to a landing page and then goes to another page on the site, what was the informational need that led them to do that? I want to pinpoint things like that. So the first thing I'll do with the client is designed the battery of research to close the gap on the information that we need.</p><p>We need to understand the client's pain points, desires, anxieties, hesitations. and then we also need to understand how they interact with the information. If there's a live site right now, how the interact with the information today. So I go away, I collect all of that. I come back to them with my findings.</p><p>Can we talk about the strategy? How does this impact copy? why should we restructure things or should we restructure things? And so on from that point, phase two is always the copywriting and wire framing. So when I work with clients, as I mentioned, we talked about earlier, I'm always writing to a wireframe first.</p><p>there's the obvious reason for that and the less obvious reason for that. So the obvious reason is I want to have better conversations around design. I don't want to have I'm a Google doc and have them go, okay. I guess we have to figure out how to present this. So that's the obvious one. The less obvious one is I don't typically want a client to edit my copy.</p><p>So I put it in a that's harder to edit. I want to have a conversation around the why and not the, what I don't want to say a word doc where their propensity is going to be. I don't like that word. Oh, I don't know if I send it to them and they can see a bit of the design and they can see a little bit of the presentation.</p><p>And I always, whenever I send a wire frame with copy, yeah. I always either present it on a call. Or send a video, talking through every, why did I do this? Why did I orchestrate it? Cause I think in conversion, it's really important to move away from opinion personal preference. And I don't like that one, not like that and make the conversation more about the under underpinning strategies and hypotheses that we're putting forward.</p><p>So that's the second phase. And then the third phase is the ongoing, AB testing, split testing, and so on. This is something that most version people do all the time. for my situations often I'm dealing with clients where they don't have the statistical significance. They don't have thousands of conversions that we can always measure this in like a month time.</p><p>So it's not that we ignore this. It's not that I don't ever say, let's. The split test this, and that's a key piece to the conversion puzzle. but often then I'll bring it up partners or I become a smaller part of a larger team. And then we work collaboratively to. Look at the hypotheses on, at a cadence that makes sense for the client and so on.</p><p>So that's a high level of how a project would look, but the most involved and intensive part is that first phase, when we're collecting all that Intel interpreting it, trying to draw some meaningful conclusions from the voice of customer and the way that they behave today, </p><p>Guido X Jansen: [00:26:03] projects, whether it's yourself British from your own company or, colleagues in the field doing copywriting.</p><p>when those projects don't work out with clients, W what are the most common pitfalls? what are the most common reasons that those, that it doesn't work out </p><p>Joel Klettke: [00:26:15] for? Whatever one is failure to set expectations? I think I always have the conversation at the outset, that, Hey, what we're doing, we're going to root it in data.</p><p>We're going to spend a lot of time on research and analysis. We're going to spend the time to get to know the why behind the decisions that we make. But I always communicate like. There's always a risk that it's not going to convert because behavior is surprising. The, it's so where we want to go with it, your head.</p><p>And so the client needs come in with the same mindset of discovery and analysis and experimentation. And when they think it's just a money machine, like put in a dollar, get 10 out that's when things really break down. I think team dynamic when teams don't talk to each other that can break things down.</p><p>So I always want to be plugged into. The design people, the SEO people leadership. Before I write a word of copy, I'll have a meeting. All of the different seats that are on the table have an opportunity to share their perspective because when you don't do that, then you start getting pushback from teams who had nothing to do with the research process.</p><p>So everyone for me has to be part of that strategy piece, not necessarily informing it, but they have to understand why we're making the changes we do. Because when you're an SEO, I wasn't SEO one year in SEO. The only lens you look at things through is it going to rank? Whereas that's not helpful when you're in design.</p><p>If you're not paying attention, the only thing is, does it look the way I want it to so not getting buy in cross-functionally from teams is a big way that falls apart. And then the last one I would say is, and this has come back to bite me in big ways. You can't always control for it. Leadership has to be involved.</p><p>Even if your point of contact is the marketing team or the sales team, what have you leadership has to buy in? They have to believe because otherwise what happens and this happened on has happened on real projects. We get 90% of the way through. And then in the homestretch, some VP swings in there Hey, I had this crazy fever dream and now the direction of the company is different.</p><p>So can you just change everything you just did? And that will kill a project when. When leadership doesn't understand or see the why or isn't privy or part of the discussion, it can totally derail everything. So I think all of those points they'll come down to just. Expectation setting and communication </p><p>Guido X Jansen: [00:28:39] culture as the company is try to, to support what we're doing.</p><p>I don't know if you've worked. You've always worked with online, copy. And if you've worked with, with offline, copywriters, and w would you say are some key differences between writing copy, for offline and versus online? </p><p>Joel Klettke: [00:28:55] Yeah. the bulk of my work has been online. I did some offline in my early days.</p><p>I think one of the big ones though, I, it seems like an obvious one, but the ability to test and to track online is obscene. Like the amount of information you can get, is while I think too with print. you always have to be clear on your objective, like with a print ad or what have you oftentimes like if I was to write a sales letter offline, then you know, it's, it can only ever be one piece, Because it's literally printed out. There's nothing dynamic about it. So you have to nail that one format. There's, there's not a whole lot of room to experiment and change things. It takes longer to get that feedback from the offline world. </p><p>Guido X Jansen: [00:29:42] I think previously in magazines, they did do some AB testing with like covers or something, in shops.</p><p>but of course, like you said, that takes a very much, the timeline is </p><p>Joel Klettke: [00:29:52] completely different. And you can't track in the offline world, how someone's eyes go through the page. So on and so forth. The other thing too, is those speaking to that dynamic piece with online now and with where tools are going.</p><p>not that this is, I think personalization gets used as this like monkey wrench answer for everything, which I don't believe it is. I think we're only, it works in some cases, but. With digital, you have the opportunity to make rapid changes and you do have the ability to iterate as you're learning. So with tools like, right message or other tools out there you can actively plan for.</p><p>Okay. If throughout this process, we learned that this is one type of person and not the other, you can, on the go have the copy, adjust to that person. You can't do that with. A print ad. You can't have it be that dynamic and responsive, which is increasingly where the tools are getting easier, cheaper, better online.</p><p>So that's another big opportunity and difference to the online side of things. So basically </p><p>Guido X Jansen: [00:30:52] online where spoiled. </p><p>Joel Klettke: [00:30:53] Yeah. Super spoiled. </p><p>Guido X Jansen: [00:30:55] Yeah. Marketing budgets have suffered. And the sheriff for AB testing has been impacted too. If you want to keep that thing to enterprise standards, but safe, 80% on your annual contract, you can consider a comfort with their summer release.</p><p>You can take advantage of full stack and hybrid features, strong privacy compliance, </p><p>Joel Klettke: [00:31:15] no blink. And </p><p>Guido X Jansen: [00:31:17] enterprise great security </p><p>Joel Klettke: [00:31:20] feel good about your smart business decision in Fest. What you </p><p>Guido X Jansen: [00:31:24] saved back in your CRO program, check out www adult's overbook </p><p>Joel Klettke: [00:31:29] slash 2020. </p><p>Guido X Jansen: [00:31:33] I think you, you wanted to share another a case study, from a HubSpot.</p><p>Joel Klettke: [00:31:36] Yeah. HubSpot was an example. I alluded to it before, but HubSpot was an example of a company going through transition. And there's a lot of the things that we talked about when right. In this project. So with HubSpot, they were introducing this freemium model, but they are also on this insanely tight deadline.</p><p>And I think with conversion, we all have the processes we like to go through in an ideal scenario, but this was a case where we were in such a time crunch that we couldn't do everything. So we had to be ruthless about, okay, what research can we actually do? Do, and how can we apply it? And the HubSpot case study is a really good example of.</p><p>How you make a team dynamic work in conversion and how you make it possible to like the dynamic it takes to achieve really great things on a tight timeline. The end product was that HubSpot doubled their conversions. Across the board and then sub metrics to that. Like it wasn't just sign up to a free trial.</p><p>Now, even inbound call volume went up, the number of requests to support and customer success not only changed. So success stopped hearing some of the questions that they're tired of answering, but improves the types of questions where. like different. And with this project, we had this tight timeline, so we had to be ruthless.</p><p>We could only look at so much. And so that sort of battery of research that we talked about was truncated. All we could do was customer interviews and some serving there wasn't a whole lot of time to look at behavior through the site beyond some simple things like. Heat maps and the tiny, that type of thing.</p><p>I worked in tandem with another copywriter named Joshua, and what made that project really work was their designer at the time was Austin Knight. And I mentioned earlier, this was my first exposure to a designer, really got and valued and could contribute to the copy piece and everything we did.</p><p>Austin found a way to make better everything we wrote. He found a way to present in a more intelligent way, right? It was the first time that we had to oftentimes there's this, okay. The copywriter writes here, then you pass it. The designer and then moves on. This was the first time I had the opportunity to have by necessity, this iterative process of together, we defined cause timelines were so tight.</p><p>Sure. Pages. We defined a template that we knew based on the information we had about customer. This was the conversational flow. That these pages needed to have. We didn't have to copy even yet, but we knew these are the types of sections we need in there. We need them based on what we know about the customer.</p><p>So we are able to go away and write the copy. Austin was able to go away and do the design because we were pulling in the same direction. We had the same baseline work towards. And then it became this iterative compare and contrast. And instead of saying no, but which is a very defeating relationship, it was a yes.</p><p>And so yes, this is great. Or yes, this is working and we could do it this way or, yes, this is a good idea and we can adjust it in these ways. So it was the first time there was this really iterative process. And that has defined for me since the way that I try to work with broader conversion teams or with designers.</p><p>So we got the great outcome, obviously the big lifting conversion, big lift and inbound calls, big, both anecdotal. And I don't know, remember the metrics at this point, but support teams saw less, less questions coming in and more of the right types of questions. but it was just a really good lesson in being ruthless about the research, doing a lot with a little, and then working as a team.</p><p>Guido X Jansen: [00:35:02] Yeah. I think it does really impede your work if you're working with people that are, if they're not open to that feedback and they. They see you as someone, whether it's four, four copy or zero in general, where if they see you as someone attacking yeah. Their work, whether it's a marketeer or a designer, some people just have that mindset that did you come in, basically critiquing their awards.</p><p>I think, no, you shouldn't do this like this you're there are different ways you should change this. And, I find it really hard also to change that mindset. it's not something that's just a flip of a switch and say, Oh, that's really hard. if they don't have that mindset to begin with, </p><p>Joel Klettke: [00:35:39] it's even difficult now.</p><p>Like I think the thing is, especially on the writing front, this is something conversion. Optimization folks should understand about writers. Everyone pours themselves into their work, but writers even more. So we get so into the work we're doing that. It becomes a routine flushing. Like we put time when you're working with someone.</p><p>Good. They have thought through every line, they've got a reason behind every piece. They can explain what they've done, we get attached to it. And so even though now, and I'm the first to say, there can't be any ego in conversion optimization. Cause you, if you haven't been wrong yet, you haven't been testing properly.</p><p>you can't have </p><p>Guido X Jansen: [00:36:19] it zero people. they are used. To being wrong because that's </p><p>Joel Klettke: [00:36:25] yeah. </p><p>Guido X Jansen: [00:36:27] Yeah. It's usually, it's a humbling experience. that might not be the experience of the people you start working with, whether it's in design and or in marketing say, yeah, we always do campaigns like this, or we've always done doing, been doing designs like this.</p><p>And that's </p><p>Joel Klettke: [00:36:40] always been even for myself, even to this day, though, I have learned to. It is it's like you say, it's not easy to just flip a switch and for me, because you get so invested, it's hard not to take criticism. Personally, being in conversion helps that and having objective data certainly helps that, but I've learned even to give myself a breathing period where I, I get better at this as years go on, but as I send something over, when the revisions come in, I read it once and I don't respond to it.</p><p>Until, at least a few hours later. Cause you don't, that's the other thing that can kill you as being reflexive is taking offense or immediately wanting to change something. Sometimes there have been many times something that's been pointed out or someone has said, okay, but this isn't actually working that well.</p><p>And so on. And given time to breathe, I come back and say, you know what? They're right. I couldn't see it. Cause I was so invested in what I put together. Yeah. So that's a lesson that copywriters need to learn, but also it's a good thing for those who work with copywriters to be aware of is there is this very personal attachment to the words that you write.</p><p>And so when you deliver criticism, it's okay. You need to do it to be productive, but. Let them have a little bit of time to breathe on it. sit on it, breathe it in. And then a good person's going to come back and be able to, what you're right. Or, you know what the data says, this variant that I liked a lot garbage.</p><p>it is again, we keep coming back to, but it is a communication piece. </p><p>Guido X Jansen: [00:38:03] Take some time to nurture that culture. As you started working with a new company that they don't have this optimization mindset or they dabbled failed enough yet. it takes some time. do you remember, by the way from, from the sports Pittsburgh, what were the biggest, I would say gaps between, the Daryl original contents, before you started optimizing them and what </p><p>Joel Klettke: [00:38:23] a lot of it, specific to the first piece that I worked on there was they had unrolled this new product.</p><p>this was one of the big things. Is, there was a lack of clarity around what HubSpot even was at that point because they had forever been a marketing tool. So it was perception in the market that HubSpot was a marketing tool marketing plan. Yeah. And in the meantime, in the months and year prior, HubSpot had rolled out a CRM, they'd rolled out a sales tool and the big gap was nowhere.</p><p>Had they done the hard work. Of showing clients. And you can find this line hopefully on the site to this day that these products are powerful alone, but better together, there was no real men, content that linked them together. And there was a real lack of clarity at the time around which tool did what.</p><p>And do I need just this one to accomplish X task? Or do I need both of these pieces? So that was reflected in, for example, we saw in the chat logs that we looked at, a lot of the questions were surrounding things like, do I need this to do that? Which tool is right for me? And so by introducing sections, like the powerful alone, but better together, and then breaking out, showing the impact of all of them, but then it making it clear which individual tools helped achieve, which individual tasks, a lot of conversion stuff seems obvious when you step back from it.</p><p>But. In the moment, it's hard to identify that was the gap. So that was certainly one thing. The other was a lot of the landing pages that we worked on. just that awareness level. So understanding again, like what mentality someone came into the page with what their priorities were. So part of what we did in looking at the survey feedback, in talking about the features, cause these are like crazy multi future tools.</p><p>They have like more features than yeah. Like some people, not me. Yeah. Obviously you have strands of hair. Like it's, there's a crazy amount of features in looking at the survey data, we're able to pinpoint the most commonly desired uses cases and talk about them first in the page. So rather than trying to give everything equal weight or like eventually meandering to it.</p><p>We're able to restructure the pages based on the leads priority. And that made a difference because people got the information they needed more quickly and were more likely to. </p><p>Guido X Jansen: [00:40:25] Okay. And, so now looking forward, after things have settled down with a second baby, and you've been able to sleep again, what will be the things that you say, okay, the next 12 months, this is what I really would like to work on this, these kind of projects, or maybe some, improvements to the process that you have.</p><p>Joel Klettke: [00:40:39] So this is dual-sided, cause I run another company that's like hockey, sticking and growth. So part of my priority will be managing the growth of case study buddy. But on the conversion side, I think what I'm really excited about, is two things. One is that personalization piece. I haven't had enough opportunity to really play around with it and make it meaningful.</p><p>I think it's a playground because there's so much we can do that. We don't know what we should yet. and so I'm excited to work with more companies on that front and, finding out like, does this work? How should we use this, these tools that are available to us? So that's one thing.</p><p>And then for me personally, I think, my career continues to evolve. I mentioned like I've been SEO agency and then writing content like blogs and eBooks. And then now, doing the role that I have and increasingly I still love the copy piece of things and that stuff forever will be, my output, but we're, I'm trying to go deeper and love up more.</p><p>There's the overarching strategy of conversion getting better at the design piece, getting better. I know my weak spot, even though, what I'm good enough to be dangerous is really the analytical side and getting better with the analytics and statistics part of all of this. So for me personally, that's what I'm excited to.</p><p>Explore a bit more for my own learning and then industry trend as a whole, I'm excited to push the limits and see if this personalization stuff is all it's cracked up to be. Or if it's really just another bell and whistle, on the stack that we already have to play with </p><p>Guido X Jansen: [00:42:08] as a small sidestep.</p><p>the hockey stick projects or company even. A case study, buddy, what are you doing there? </p><p>Joel Klettke: [00:42:14] it's, it's pretty unique in that it's a team specialized for customer success stories. All we do is help B to B companies capture, share, and cash in on customer success stories. And so we do it for a lot of agencies, a lot of software companies, increasingly coaches and consultants.</p><p>And it's a tough challenge that. Anyone who's tried to get by and for a customer success story and then put that together and then get approval for it. And then presented in a way that actually drives action, which is where my whole conversion background comes in. It's a complex process and one that over the past four years, my team and I have gotten really good at solving.</p><p>That space for us is really blue. Ocean's still, we don't have a ton of competition that we are seeing more people come into the field and we're expanding the format. So we started out written cause that's my background, but we're doing a lot more of the video and we're moving towards more of the subscription, strategic type models.</p><p>So where, when we started, we're all about the production side, we run the interview. We write the studies, we manage getting revisions. We design the end assets, but where we're really excited about increasingly doing more of is the strategy behind these types of pieces. So what types of stories should companies even tell?</p><p>How do we build feedback loops and systems into their organization so that when they go to ask for a customer success story, it doesn't feel like a stranger coming and asking for a favor. So I'm really excited to just be shaping the strategic parts of that company. Growing the team there and then constantly, really honing and getting better at the formats.</p><p>Guido X Jansen: [00:43:44] so basically as a business goal goes to you guys say, Hey, I have this bind, here's his email address. Please give me a testimony. </p><p>Joel Klettke: [00:43:51] Yeah, pretty much that. but in some cases we can even come in a step earlier. So often we deal in situations where increasingly working with midsize to enterprise where they say, we have lots of happy customers.</p><p>We have no idea how to approach them to get them to say yes or there might be a lot of. nuances legal nuances where </p><p>Guido X Jansen: [00:44:10] it's we don't know if they're willing to test. We don't know if they're happy. </p><p>Joel Klettke: [00:44:13] Yeah. All the way back to that. So we're increasingly helping clients get buy in the first place.</p><p>the goal is so that it becomes almost as push button as possible. So we do get a brief from them and we do that type of thing, but we want to make these as fast, frictionless and fun as possible for everyone to be part of. And so that's, that is the model is, yeah. Company says either. We've got a happy customer or increasingly multiple happy customers.</p><p>And we want to know how to feature them, but where we're moving is more of a service where we can set a target and they can say, we want to be able to publish. Four studies a year or eight studies or 12 studies in a year. And we helped them engineer the systems and feedback loops to make that possible and then take care of all the creation as well.</p><p>Nice case study, but adult, </p><p>Guido X Jansen: [00:44:59] I will put the link in there in the comments too. as a final question, back to copywriting and any books that you would like to recommend to our audience, I want to learn more about basically copywriting and Sera. </p><p>Joel Klettke: [00:45:09] Yeah. The funny thing about covering books and copywriting in general is some of the books.</p><p>It should be, there should be books on copywriting, </p><p>Guido X Jansen: [00:45:15] right? </p><p>Joel Klettke: [00:45:15] There are there, but some of the best, most informative books about copywriting are not about copying. So one of my favorite books is made to stick. there are lots of things in that book that talk about making ideas memorable, but also just the guidelines that they present for making things like concrete.</p><p>And that type of thing have really influenced my writing on the specific copywriting front. There's a classic, Dan Kennedy's ultimate sales letter, that takes us all the principles of offline direct response. And. when you read it through the lens of doing this digitally, there are lessons that you will take away from that are very valuable.</p><p>the other ones classic, how to win friends and influence people. there are parallels and lessons there that you can bring across into copy in terms of how you phrase things or how you think about engaging with people. there's also books that I really like predictably irrational that just deal with.</p><p>The psychology of marketing and psychology of how people make decisions in general. And those are the types of books. It's great to read a copywriting book, don't get me wrong. There's books. everybody writes from Ann Handley that talk about the mechanics of writing the strategy of it and so on. But I think the further you get, the more you realize that writing is communication deals with psychology.</p><p>So I'm invested in how people think. And make decisions and then the writing, it's not secondary to it, but then the writing has goalposts to shoot for. I understand how, when I know that then I can engineer what I'm doing to do that better. So those are some books that I've found. </p><p>Guido X Jansen: [00:46:43] Exactly. Joel, thank you so much for, for doing this on such short notice and, while you are, you're waiting for the delivery of your </p><p>Joel Klettke: [00:46:50] second </p><p>Guido X Jansen: [00:46:51] child.</p><p>Good luck with that. tomorrow. The two weekends next week, </p><p>Joel Klettke: [00:46:55] whenever it happens </p><p>Guido X Jansen: [00:46:56] soon, you're probably a father a when we publish this. we'll, everyone that's listening to this can congratulate you, probably on the new baby. thanks again and talk to you soon. Cheers. Thank you so much. All right.</p><p>And this season two episode 35, plus with Joel conversion, copywriter business copywriting next week, another English, </p><p>Joel Klettke: [00:47:22] or at least </p><p>Guido X Jansen: [00:47:23] three Jewish guys, frying English. And the topic will be surface testing with my guests in mind dialogue, and always be optimizing.</p><p></p>",
  "show_notes": "<ul><li><a href=\"https://businesscasualcopywriting.com/\" target=\"_blank\">Business Casual Copywriting</a></li><li><a href=\"https://casestudybuddy.com/\" target=\"_blank\">Case Study Buddy</a></li><li><a href=\"https://businesscasualcopywriting.activehosted.com/f/1\" target=\"_blank\">Newsletter by Joel</a></li></ul>",
  "guests": [
    {
      "id": "joel-klettke",
      "name": "joel-klettke",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/copywriting-for-cro.jpeg",
  "language": "en",
  "type": "podcast"
}