{
  "id": "cro-salaries-agency-vs-client-side-vs-freelance",
  "title": "CRO Salaries: Agency vs Client-side vs Freelance",
  "description": "Exploring the earning potential for different kinds of CRO work. From agency CRO specialists to those that work clients-side to freelance CROs.",
  "date": "2025-01-08T20:07:07.493Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/7ea94f9b/b8845d79.mp3",
  "transcript_url": "<p>Today we're going to talk about the different options that you have if you want to work in conversion optimization. Roughly speaking there are three main paths that you can take. I've taken all three of them, so I want to share a little bit of my experience and a little bit about what you can expect.&nbsp;<br></p><p><strong>Option 1: digital agency / marketing studio</strong></p><ul><li>Work within a team.</li><li>Give services to clients of the agency</li><li>Work on optimizing a website, webshop, landing pages or whatever that specific client needs.</li></ul><p>Pro:</p><ul><li>Work with other digital people with similar knowledge levels</li><li>Work with a diversity of clients and projects</li><li>Lot’s of fun<br></li></ul><p>That has actually been the <strong>first work</strong> that I had coming from the university. I was working for an ecommerce agency here in The Netherlands and was really, really a pleasure and especially when it’s a smaller agency you might also gain some <strong>general business experience</strong> in things like sales, account management and project management.<br></p><p>Agencies usually have a lot of <strong>specific domain knowledge</strong> within the company so it’s easy for them to<strong> train new junior</strong> people. So often what I see happening is that instead of raising salaries for seniors to keep knowledge in-house, they just hire a bunch of juniors instead to get the work done. So you don’t typically see the highest salaries at agencies.<br></p><p>Now in terms of how much you might actually earn, as with all the 3 main paths this obviously depends on where you are in the world and your experience level. I will link in the shownotes&nbsp; to a CRO survey that shows you some salary indications which you can check out.</p><ul><li>In general: average salaries for a beginning CRO specialist will be around 35-40 thousand dollars per year</li><li>quickly go up to 50 or 60K a year and if you’re really senior you can go up to 100K, especially if you work in the US, UK or Germany, other countries are typically lower.&nbsp;<br></li></ul><p>So that's roughly the range of what you might earn at an agency as a CRO specialist. Of course, if you're working in a big agency and you're getting into kind of management or director levels, or you even own part of the agency it might be higher, but this is more or less what you can expect when working for agencies solely in a CRO specialist role..&nbsp;<br></p><p><strong>Option 2</strong></p><p>Now, the second option that you have is actually working in-house in a company. Which can basically be anything, but since CRO mostly focuses on websites it’s usually gonna be a company, usually selling something to consumers and with a website that has a decent amount of traffic.<br></p><p>If you’re the first CRO specialist you might have a lot of freedom to do things the way you want you will probably join a team with people that are responsible for different parts of the funnel like SEO, SEA, Content creation, Branding, Customer support, Product development etc.</p><p>Since you might be the only one doing CRO or maybe just a hand-full of people that get what CRO even is, this might involve a lot of stakeholder management which means you need to keep a lot of people informed about what your do and keep them positive about experimentation and validation so you can keep the freedom and budgets you need for the execution of your CRO plan.<br></p><p>Actually this was my 3rd job experience after working at 2 agencies where I joined an inhouse team of digital marketeers where I was one of the 2 in-house CRO specialists. For me working in-house feels like you can go deeper into issues to really solve them because you're not charging by the hour (which you usually are when you’re working at an agency). You are most likely the owner of the projects that you execute on so you can see things through from conception to launch and for me those projects often make me feel more proud that the projects you do for clients when you work for an agency because you’re always gonna stay somewhat of an outsider.&nbsp;</p><p>In-house you can also have more focus because you’re constantly working on a single product or a single website so you get to learn all the ins and outs.<br></p><p>Depending on what you think is fun of course this can also be a downside because it’s gonna be one big project for a long time instead of smaller short term projects. If you’re really creative and get bored easily, in-house might not be your thing, and on the other hand while at an agency you probably have multiple client projects and you might need to switch to a different client each day or maybe even every hour so it really depends on you personally where your preferences lie.<br></p><p>As for the salaries you can expect to start a bit higher, maybe between 40 and 50K, simply because in-house teams don’t want the really junior people that they need to train, they want people that can execute right away and it’s not completely unusual to go over 120K for senior people although that usually again includes taking on some more team management tasks in addition to your CRO work or even more broader jobs like managing the whole e-commerce website if it’s a smaller online team.<br></p><p>The business you’re in and specifically the margins they make on their products and services and how scalable the business is can have a big impact on the range of salaries that you can expect. And in addition there might be collective labour agreements or unions that apply to that business that can also have an impact. Usually if it’s a completely only business they’re often quite scalable and you as a CRO specialist can have a huge impact so you can expect the highest salaries there. On the other hand there are also many more traditionally offline businesses that might have a small online presence that functions more like lead generation and typically those are more conservative when it comes to salaries. But again those are just averages and a lot of exceptions definitely exist.<br></p><p><strong>Option 3</strong></p><p>Now the third option, which is also what I’m doing right now is going freelance. And when you're going freelance, basically you are the master of your own destiny. You don’t have a boss and to a degree you can choose the companies you want to work with and do the work that you like best. If you imagine a Venn diagram where one circle represents the work that clients will pay you for and another circle that represents the work that you really enjoy doing: where those overlap, that is the sweet spot where you as a freelancer can be.&nbsp;<br></p><p>In terms of salary limitation because you don't need to ask for permission from anybody.</p><p>Because this is now your own business, nobody guarantees a sale for you. That being said, there's also no cap on how much money you can earn.&nbsp;</p><p>If you’re able to do full time freelancing you might be making around 1500 billable hours a year and at an average rate of for example 150 dollars this would make you 225 thousand dollars a year in revenue from the freelance allone. And of course you can play around with your hourly rate and the number of billable hours you can make in a year to see that number go up or down.</p><p>Now of course this is revenue, not profit so you will have taxes and all kinds of expenses like travel, a car, office furniture, insurances etc etc that you now have to fully pay for yourself. And in addition to that you now also have the sole responsibility to do sales and marketing and finance and all the other aspects that come when running a business. So of course the idea here is that because you are taking a higher risk and you're doing way more than just CRO, you're also being rewarded with a higher income than when working in-house or at an agency, but definitely in your first years that might not necessarily be the case.<br></p><p>Looking at these three options, you see that each of these options have their pros and cons so which one is right for you? Well as always it depends, and it’s not just one thing right. It depends on where you are in your career, the kind of learning opportunities you’re looking for, the kinds of freedom you want and the amount of risk you’re willing to take. And these factors will probably not be static and these will change over time, many people in the CRO.CAFE community that I know have switched between these options at least once.<br></p><p>So basically if you only want to focus on CRO and don’t want to spend&nbsp;<br></p><p>If you only want to learn a lot in a short amount of time and improve your skill, then maybe working within a team where you have a manager with way more experience than you can be a great option.&nbsp;</p><p>If you want to maximize your freedom and earning and you’re interested in running your own business, then maybe freelance is the thing for you.</p><p>And I think that, you know, a lot of times it's really hard to say because it can really depend on your personality what works best for you and again it can highly depend on the actual company and team that you’re working in how that experience works outs for you. And you might not know this up-front and you may need to experiment a bit with this. Especially when you’re working at an agency or in-house you could start a freelance business on the side - provided that your contract allows you to - and see if that is something that you like and maybe scale back your full time job to 4 or 3 days a week and combine it that way.<br></p><p>So I hope that this kinda gave you an understanding of what to look for. If you’re currently looking for a job in CRO and not sure how to approach this, just send me a message on Twitter or LinkedIn and I’m happy to give you some advice for your particular situation. Also in the CRO.CAFE podcast there are many interviews I did with people that work in any of these 3 situations and I’ve listed a couple of them in the notes below so you can listen to those and get a feeling of the work they do and the freedoms they have. And whether you’re completely new to CRO or already a veteran we’ll have much more interesting videos coming up so make sure that you’re subscribed for more amazing videos on CRO. See you soon and always be optimizing.</p>",
  "show_notes": "<p>I quite enjoyed answering this question because I've been in all three positions: I've worked at agencies, then moved to client side and then finally took the plunge into freelancing. I've come to find out that there are trade-offs for each. </p><p>Your personality-type will be largely responsible for determining which scenario is best for you. For example: If you're the kind of person that wants something safe while working on a side-hustle then maybe working at an agency or company is best. </p><p>Don't overthink it, try each scenario if you get the chance, as that's the best way of determining what's best for you. Once you do find what's best for you, it's smooth(er?) sailing from there.</p><p>The 2019 State of Conversion Optimization Report by CXL: <a href=\"https://conversionxl.typeform.com/to/CIeV4Uuw\" target=\"_blank\">https://conversionxl.typeform.com/to/CIeV4Uuw</a></p><p>Want to receive the 2020 survey results? Our podcast partner Convert.com and CXL teamed up to get the CRO industry report of 2020 updated again. How are we as a CRO industry are moving forward and in what aspects. Join this annual survey so we can all shortly enjoy the results: <a href=\"https://cxl.com/blog/2019-conversion-optimization-report/\" target=\"_blank\">https://cxl.com/blog/2019-conversion-optimization-report/</a></p><p>‍</p>",
  "guests": [],
  "youtube_url": "https://youtu.be/YnFujp5OKgc",
  "main_image": "src/assets/images/episodes/cro-salaries-agency-vs-client-side-vs-freelance.jpeg",
  "language": "en",
  "type": "podcast"
}