{
  "id": "cro-in-a-post-cookie-world-with-lisanne-maatman-and-dumky-de-wilde-dept",
  "title": "CRO in a post-cookie world",
  "description": "Learn about how you can still continue running online experiments without relying on browsers to accept cookies (since they do so less and less).",
  "date": "2025-01-09T14:36:18.242Z",
  "duration": 2826,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/282c47ec.mp3",
  "transcript_url": "<p>Guido X Jansen: [00:00:00] We were just talking with from depth agency, about the testing in a post Skokie world. There's only. The meat for the insights team, which covers both zero and weapon analytics and dunky is a senior technical analyst with a background in philosophy. My name is Peter Yalta and welcome the award winning podcast, where I show you the behind the scenes of optimization teams.</p><p>I've talked with their specialists about data and human driven optimization, and implementing a culture of experimentation and validation. In case you missed it in the previous English episodes we spoke with &nbsp;mail about the six soft skills that you, as a hero needs to master, you can listen to the episode on Ciroc fair website or in the podcast right now.</p><p>Now, before we start, you just heard me saying something about award winning, both guests. last week was the first edition of the experimentation culture awards. And I'm honored to have been announced as the winner for the individual category for evangelizing zero in general NCRO culture. In particular </p><p>Dumky de Wilde: [00:01:12] with </p><p>Guido X Jansen: [00:01:13] the Ciroc fate podcast, I was already surprised to be nominated, to be honest, for the top five.</p><p>So you can imagine my surprise when they announced me actually winning the award. So a big, thank you goes out to the organization and the jury of the awards. I'm honored to be able to reach so many people in our industry each week through this both guys. And I love how it not only shows the big, awesome things that we all do also gives a voice to the more introverted people and the mundane stories of everyday Ciro.</p><p>The depth of knowledge and the amazing stories of all my guests keeps surprising me and not infrequently. These are stories from people that don't necessarily want to go on stage or write a long blog post or record a video of themselves, but they are comfortable with doing it. And just a normal one on one conversation with a Federalist zero practitioner who knows about the struggles.</p><p>And just happens to have a big record, but, and a microphone. And they are able to share this with us all and spread their knowledge for us all to enjoy. So despite this being an individual award, I really feel that we won. This is a Testament to the openness of all my guests in the past two years. That's often for the first time share their story with the world.</p><p>It's been my honor to be your host and I will definitely continue doing so, but it's the stories of my guests that make the podcast. And this is also for you as a listener of the podcast. You always want to know more. You want to keep learning and you're open to change, changing your mind, changing your way of working.</p><p>And I love that, that you help. Keeping, keeping me growing this community. Thank you all for that. Now let's get started with this episode of shearography, which again is made possible by our partners online dialog. SiteSpect online influence institutes, content square, and comfort.com. Welcome to season two, episode 39.</p><p>These online dunky welcome to the zero cafe. And of course, we'd like to start with getting to know you guys a bit better. So let's start with a designer. could you tell us a bit more about what you do as a </p><p>Lisanne Maatman: [00:03:10] depth? yeah, so I am the team lead of the insights team at depths, and that is the team that does both Shiro, but also a lot of weapon analysis and, to get it with my colleagues, I work for.</p><p>Pretty wide variety of clients. So a lot of B to C re eCommerce platforms, but also more traditional B2B, and everything in between. Okay. So that's </p><p>Guido X Jansen: [00:03:34] yeah. Is there a specific niche that this aiming for, or an extra, you have very broad range of clients, but is there a specific niche or something that you end up with having as a client?</p><p>Lisanne Maatman: [00:03:45] No. No, not really. I think, I think. The cool thing of working, especially in this Euro team is that we have this wide variety. my typical day is consists out of, doing very Beatsy focused lines first, and then I'll move over to something very specific needs to be with like a very long customer journey or very complex, services or products.</p><p>So I think that makes it cool to work there as well. To have that variety or, </p><p>Guido X Jansen: [00:04:13] okay. And then a technical analyst that does that mean you have to fix all the mess, that, that the clients made. Yeah. </p><p>Dumky de Wilde: [00:04:19] Yeah. It's definitely, it's interesting though, because. I tend to look at my job as a, on the one hand, very technical</p><p>the first time, that kind of stuff. Usually what you end up talking </p><p>Guido X Jansen: [00:04:36] about, </p><p>Dumky de Wilde: [00:04:37] how are we going to, Hey, within your organization, build a process around it has the proper governance who's </p><p>Guido X Jansen: [00:04:46] can publish to know more stuff. You want to </p><p>Dumky de Wilde: [00:04:48] keep? Yeah. It's all technical on one side.</p><p>Guido X Jansen: [00:04:55] that you help? </p><p>Dumky de Wilde: [00:04:56] Yeah. You say it like that, </p><p>Guido X Jansen: [00:04:58] challenge the challenges </p><p>Dumky de Wilde: [00:05:00] with the clients. Yeah, definitely. </p><p>Guido X Jansen: [00:05:03] What are we saying? And if you have four new clients, what are the most, common technical issues or technical things that you need to do first before you can actually start doing four foot before Lisa can do her work?</p><p>Dumky de Wilde: [00:05:14] So it's actually, </p><p>Guido X Jansen: [00:05:17] what </p><p>Dumky de Wilde: [00:05:17] I see most is just to start with an understanding, </p><p>Guido X Jansen: [00:05:21] let's start with what is it that we actually want to do? </p><p>Dumky de Wilde: [00:05:24] What is it that we actually want to measure that we want to experiment with? So really getting that down and getting all stakeholders aligned within an organization to say, okay, this is our.</p><p>Goal. this is the goal that we can agree a got agree upon together, and then start building out the solutions and picking the right tools for the job and the right budget for that. That's really, one of the most common challenges in terms of organization. in terms of practical challenges, I would say, just getting rid of it, the legacy, that usually, especially if you look in, tech management containers, for example, we'll find like 200 different tags and, like 150 of them are not used, are not like put in optimally.</p><p>so they'll just, they, it's an interesting test. I did this at a client once where. we just removed 150 of these tags and then looked at the difference in speed, for the actual end user. and we shaved off about three to four seconds. So that was an interesting test in of itself </p><p>Guido X Jansen: [00:06:30] as a relatively easy fix.</p><p>Yeah. that's nice. that's interesting. Yeah. and, yeah, of course, when we talk about zero and, and technical side of things, there are quite, quite some things happening. last couple of, Months, it last couple of years is the move away from using cookies for this.</p><p>so at least on the houses impacting basically your </p><p>Lisanne Maatman: [00:06:50] whole work. Yeah. It does quite a </p><p>Guido X Jansen: [00:06:51] lot extra. And can you still do your work? </p><p>Lisanne Maatman: [00:06:53] the is, this is a very tricky thing, you can do your work and you can look at the data. You can run your AB test and not notice there was anything going on.</p><p>you, if you would not know that there is an issue with cookies, you would just. No, I'll make your analysis and, think you're doing the right thing. but actually you're looking partly at, invalid data. yes, you can still do your work, but at this point, without having, the proper solutions in place, it does take a lot of, fixes to get the right data.</p><p>yeah, to get the right data in place. So one thing is, for example, in our analysis, we always look at, what the, number of sessions are that people have to have before they convert, or the number of days before people convert. Obviously when you look at those type of reports, nowadays, those yeah.</p><p>Will consist out of invalid data. And again, that depends a bit upon your clients. As I mentioned, we have a pretty wide variety of clients. What I see in traditional, business to business, that there's a complete different set of browsers that are being used a lot of Chrome, for example, where this issue isn't taking place just yet.</p><p>but we also have clients that sell, for example, Apple accessories. So obviously you have a lot of Safari traffic there, and. Especially for those clients. We see that those reports are missing more and more data basically. And that's just the analysis part of things. Yeah. And of course you have your EBT.</p><p>this point for many of my clients, I recommend too. Not room tests for longer than a week, which means that you have very little data to work with. or yeah, she do want to expand your runtime that it has to look at too. Yeah. But I was just like Chrome and, more or less a of Chrome users are also representative for a Safari or Mozilla Firefox users.</p><p>So yeah, it does take a lot of, fixers and double checking things. to make sure that you're looking at actual balance data, </p><p>Guido X Jansen: [00:08:49] marketing merges have suffers. And the sh here for AB testing has been impacted too. If you want to keep that thing to enterprise standards, but save 80% on your annual contract, you can consider comfort.</p><p>But their summer release, you can take advantage of full stack and hybrid features, strong privacy compliance, no blink and enterprise. Great security. Feel good about your smart business position in what you saved back your CRO program. Check out www adult's overtook slash 2020. And then key in case people are listening.</p><p>I hope not, but, in case people are listening and now thinking shit, say what happened, what is happening? Why are brothers? </p><p>Dumky de Wilde: [00:09:36] Yeah, so it really, I think it's down to two parts. So we've seen the sort of a legislative part, We've seen the GDPR, and the EU trying to limit it. The amount of tracking that's happening online.</p><p>So it used to be the case that it was really easy for any kind of app platform to set up. Yeah. A cookie. so Facebook could consider a cookie when they're on your website, they could set a cookie on the Facebook with domain. And that means that, you can, it can be tracked across all other sites that are also using the Facebook library and setting cookies on the Facebook domain.</p><p>then we have the EU saying, okay, that's not really what we want for our citizens. let's do something about that, but it just went on and I think Apple has done. And really they've been the leader on this weather, because they think it's a good cause or bit because they think it's gives them a competitive edge.</p><p>We don't know. But in any case, they took up the support for their users and said, Hey, this is not where we want for our users. We're going to protect our users from. These practices. and they started the intelligent tracking prevention it's been going on for a few years, but in the last year they really doubled down on it and said this whole third party cookie thing.</p><p>We're just gonna walk third party cookies all together. so no retargeting, no remarketing. and also as a sort of collateral damage, you could say, the first party cookies and any kind of browser storage was impact really. So that meant that, The identification that you could store for a user with their, either the advertisement and that they clicked on, for example, but also like a login credentials.</p><p>And that kind of stuff was limited to, one day, if you were coming from an advertisement or seven days, if you're coming, if you're not coming from an advertising, but directly to the site. And what is that. This has been a really big step in, what you can actually do in terms of attributing conversion, in setting, assigning experiments to users and keeping them within that same experiment.</p><p>So this is what Lisa was talking about. If you don't know that this is going on, it means that the same user can return within say a week or two weeks. and they can get assigned different experiments, right? they can do the B on both sides of the AB test. So yeah, Safari is taking up the lead to prevent their users being tracked and you see it, that other browsers are following suit as well.</p><p>So let's say the Firefox, Microsoft edge has been really, mostly blocking third party cookies. and that slowly Chrome is also following suit. </p><p>Guido X Jansen: [00:12:14] so sorry, at least on that in my mind, there will be. Two, two main ways of dealing this, one would be, trying to figure out a way to, to supply it to move away from cookies, but replaced it with something else.</p><p>So we can still track users for the length that cookies, would give us or the other route would be. Okay. We need to change the way we do experiments at all. So we need to do that within the boundaries, the new boundaries that we have, which way are we going? </p><p>Lisanne Maatman: [00:12:44] I think it's too early to really call any, any conclusions just yet.</p><p>we see that this has been happening for especially the last couple of months and a lot of solutions are being thought of, but I don't think we have a finished list just yet of, the solutions that we have. But I think it's, I think it's important to make a distinction here. So first of all, you have the short term tactics, right?</p><p>Just things you can do more in a short term to deal with this situation. So those are things that, for example, entails scoop surface tagging. that is something that you can work on, but I think. implementing that you had at the same time, asked to look at, longterm strategy because in the end you can do service sites tagging.</p><p>And of course we'll fix some things, but you will have to, work through a more sustainable solution here. And I think when we talk about a sustainable solution is really about. yeah, building a more direct relationship, basically with your visitors and with your customer. meaning acquire more first body data.</p><p>And I think that's really, something that we should all focus on. sourceful acquiring the data. creating more or less incentives for people to identify who they are, and that can be done via a login. I think that makes most sense for a lot of, platforms, but also white paper downloads or, any other way that you can, for example, get an email address and, Keep on recognizing people when they come back later on, </p><p>Guido X Jansen: [00:14:09] is it called Schumer?</p><p>We can expect more and more websites where the first page is a long. </p><p>Dumky de Wilde: [00:14:14] Yeah, definitely. you're already seeing that, look at, when you go to read something on medium.com, for example, that is like hover over it that says, Oh, you want to look at login with your Google account, click here.</p><p>It's really easy. that's really the kind of stuff that I think we'll start to see as well as incentive based. login. log in, sign up for our newsletter to get a 10% discount. That kind of stuff. </p><p>Guido X Jansen: [00:14:35] Was I getting more and more used to this a bit, by using more and more apps and for most apps you need to log in anyway.</p><p>but just still can be. Can be annoying if you just go to a new service or for, to, for example, just want to read something, a medium, click on the, on Twitter, go to medium and then your fourth. </p><p>Lisanne Maatman: [00:14:54] Yeah, definitely. And I think that's also a conversation that, we should have as consultants. There's also as a.</p><p>As a company, it's all about having the right skills, right? So this is also, I think what you mentioned that, of course, as an eCommerce platform, you want to sell things, but you also want to remarket people. So the first and main objective there is of course, to sell your products, for example, and.</p><p>trying or persuading people to, get them to log in, really requires you to think of, Hey, what added value can we offer for our clients and our visitors for them to actually give their data. I think it's takes. If your inquiry is actually us to better think about the added value for our customers.</p><p>what can we do in terms of shipment costs or in terms of, in the distance, this counts goes, for example. so it's Instead of just using a cookie that we can implement really easily with a snippet and just throw it out there. It's brings back the responsibility to us as marketeers as well, to better think about what are we offering our clients and how can we.</p><p>Ask them to give out their data. So only one hands respecting them as well, if they decide not to do that. setting that cookie down anyways, but on the other hand, if they decided to give their data to you as a company, to make sure that you really, add value for them </p><p>Guido X Jansen: [00:16:14] in that sense. online is starting to look more and more like the traditional, offline marketing.</p><p>The, we actually need to build a relationship with that. </p><p>Lisanne Maatman: [00:16:21] Yeah. Horribly. Yeah, </p><p>Dumky de Wilde: [00:16:22] no. Yeah. But I think so. Yeah. And that is the difficult challenge because as you were saying, it's on a it's you can focus on these short term tactics and talk about stuff like service start tagging, or, there's all these kinds of solutions that will help you extend your cookie lifestyle, that kind of stuff.</p><p>But it's really about. Getting all these people within your organization together, right? The marketeers, the online Mark, offline marketeers, the designers, someone with a user experience, background, and start to think about it. What is actually the journey that the user goes through and how can we add value in such a way that there is a kind of exchange where, they give up, their email address or their phone number in exchange for added value.</p><p>so that we are able to identify them properly across channels. Yeah. </p><p>Lisanne Maatman: [00:17:09] And I think it needs to add a bit on to that. Is that. Traditionally, we were used to look at cookies and also, therefore we were used to look at a very channel specific approach, right? you'd look at your, your ads, words, ads, or your Facebook ads or whatever.</p><p>And I think now also, taking that first party data as a starting Fornes the quarter shoots really look from the customer point of view. So looking at that. journey and third touch ones and shifting the focus from a more general, final approach or a, platform approach to really the journey and how you can help them as very specific points to, to get the information that they're looking for, or find the product that they need.</p><p>So it's really about you focus. And I think in that sense for us as marketeers to really do a better job. </p><p>Dumky de Wilde: [00:17:56] as well as a challenge, because how are you gonna, how are you going to test this right. Yeah. How are you going to test it across all these channels and make sure that someone stays within the same experiment?</p><p>that's, I think that's going to be really difficult. </p><p>Guido X Jansen: [00:18:11] Logged in, </p><p>Lisanne Maatman: [00:18:12] would make our life so much easier. Yeah. </p><p>Guido X Jansen: [00:18:15] For over 10 years now. Oh my God. Look at Pfizer's about evidence based conversion optimization with a focus on data and psychology. We see that analyzing data and recognizing customer behavior results in a better online dialogue with your clients and a higher ROI that team of strategists, analysts, psychologists, and UX specialists gathered valuable insights in your online behavior of your visitors and together with you optimize them elements of your zero program through redesign expert reviews, AB test and behavioral analysis.</p><p>For more information about their services, go to Owen dialogue. Look. For the people listening to this, and maybe I have a lot of, tools they're using right now. for example, a whole jar, that we just mentioned. So is that. Can we just throw them all away or, is there still a use case to keep using those tools or do we need to look for alternatives surface side alternatives?</p><p>Lisanne Maatman: [00:19:08] It's still far, especially tools like culture. They're still very much interesting to use. So I think we need to make a distinction here between analytical tools, such as for jar, where you want your heat maps and your user recordings. And they're all pretty much. Session based or even page based. So it doesn't really matter that you're not able to recognize use as off through a week again, especially for dose analytical purposes.</p><p>However, I think every time you want to start doing a personalization in Google apps and wash for example, or run an AB test in a visual website, optimizer that's where, your alarm bells or alarm bells should go off. Yeah, plus they are indeed you will have an issue recognizing Safari users or Firefox users off through a week.</p><p>So you don't have to throw them out. You just have to, for now, as long as you don't have any solutions in place, take into consideration that you're no longer able to recognize them. And that's a meantime, also work on, some fixes, for example, like a service site tagging or resetting the QV surface sites.</p><p>Guido X Jansen: [00:20:09] and you already mentioned that if you don't know. that this is an issue to begin with. you might not notice this. Maybe you noticed this, the specific segments, like Safari are becoming less and less prevalent in your analytics. so less and less users. but it might not be obviously quite obvious why this is happening.</p><p>So is there a way to figure out how much of your traffic is affected by this? </p><p>Lisanne Maatman: [00:20:35] Yeah, definitely. </p><p>Dumky de Wilde: [00:20:35] So there is, </p><p>Guido X Jansen: [00:20:38] I feel </p><p>Lisanne Maatman: [00:20:40] it's taken away. </p><p>Dumky de Wilde: [00:20:41] Yeah. I think what's interesting is before we start to think about what's actually impacted, just think about the things that you as a user can do and how that potentially can impact the way your analytics store or CRO tool is tracking you.</p><p>So we're not coming from an ideal world. Either right, because it's not just about these cookies. It's about, think about your opening, an email on your phone in say the Gmail app that opens. If you click a link on that, it opens in a browser within the Gmail app. Then you're like, Hey, I don't want to open this in the Jima app because I'm not locked in here.</p><p>Sorry, click on the Safari, about, when I go to the Safari app and there I'm currently logged in, so those already are two difference users that you're tracking two different sessions that have started and it's. Actually the same user that you're tracking. And then on top of that, because you're going to that Safari app, your story, the cookie there for seven days.</p><p>if I return after seven days following that same link, again, a new user and that's the. the things that we need to think about, we need to think about actually human behavior. And what does it look like and how is it going to impact our tracking and our analytics? When you consider that, then you need to think about it.</p><p>Okay. what's going to be the actual impact on my users and you then really need to look at session based information because that's all you have. So you can look at, how many Safari users do I have? How many, Firefox users do I have? and I've seen these tools where, people have been looking at, Oh, these many people are still using an older Safari browser, so you can track them in the oldest society browser.</p><p>And I would say, just assume that, within the next year, six to 12 months, every month is going to update or at least 90 days. 95% is going to update to, a version of a browser that's going to limit, the tracking capabilities. so yeah, looking at that. You can really see that if you're the number of Safari users and the number of Firefox users that you're are visiting your site, when it's really high, you really need to consider like the sort of action and implication that has for you right away.</p><p>If the number of Chrome users is a little bit bigger, then you might say, Oh, I have a little bit more time before, over the next 12 to 18. To 24 months when Chrome starts implementing some stuff, I have a little bit more time to actually accommodate for that. So I think that's the sort of calculation that you can do.</p><p>And other than that, it really depends on the business. So for example, is it like a, is it fast moving consumer goods, square people are returning, like every month or so to buy something new or is it a B2B business where, you know, someone like lead times are very long, someone might download a white paper and then they'd discuss it internally, ask for two months and then someone else from the company comes back, and they download a white paper as well.</p><p>And then, Another two months later, they finally contact someone in there sales department and say, Hey, we're actually interested in your product. That's a totally different story than, when someone. Comes back every month or so. </p><p>Guido X Jansen: [00:23:54] Yeah, exactly. and now do you guys approach us with clients that, where you see this problem popping up, that you see more and more, tracking issues?</p><p>like you said, of course it wasn't a perfect world to begin with, but, the problem starts accumulating. maybe you need to move to a surface science, tracking solution. So how do you approach this? do you do. Make an ROI calculation for this, or how does this go? </p><p>Dumky de Wilde: [00:24:17] it's a really good question.</p><p>Cause we, we haven't figured it out fully. either there is, you could do an ROI calculation, but there's a lot of assumptions in there. Yeah. so it makes. A lot of sense to think about the skill of your organization, the potential impact that and we can make a sort of, investment about what do we think is actually going to cost to implement something like service, our tagging.</p><p>and what is that actually the clients for whom this is interesting are mostly clients where, for example, they have. They have a lot of different countries that they're serving. So are their reach is just very broad. Really. So with one service, our tagging solution, they could serve all these different countries that they have.</p><p>That's a really interesting use case. The other use cases where there's a lot of inputs, for example. So by that, you have say an iOS app, you have an Android app, you have a website, maybe you have, a loyalty card or whatever you have offline stores, </p><p>Guido X Jansen: [00:25:18] little touch points. Yeah. </p><p>Dumky de Wilde: [00:25:19] Yeah. A lot of different things, spoons that you can put into your.</p><p>Service are taking solution. really that makes it, makes it more interesting. </p><p>Guido X Jansen: [00:25:26] Okay. So basically you're saying probably the first clients to move over through this, are the clients that already have additional benefits to using service sites even besides, moving to Kirkland's world? </p><p>Dumky de Wilde: [00:25:40] Exactly.</p><p>Yeah. Okay. </p><p>Guido X Jansen: [00:25:41] Interesting. And are artists specific verticals or other, is it, do you see, for example, eCommerce, parties moving through this faster than others? </p><p>Dumky de Wilde: [00:25:50] Or I would say so. I, the clients that I've been talking with are mostly e-commerce right now, although there are some B2B as well. but again, it depends on the scale and the potential impact, right?</p><p>So usually it's tights. Not only to the bigger sister. So tagging is a solution for a lot of different problems and it brings its own problems with it as well. yes, it does help you to, for example, extend the lifetime of your cookies. but what's more interesting for a lot of parties is that it allows you to, tie a lot of.</p><p>Information to get our server side as well. So for example, for an eCommerce party, you could think of, you have product margins on which products actually have the highest margin, And you definitely don't want your competitors to see those margins, but with a service thinking solution, you could, tie that database of product margins that you have together with the incoming stream of user event data, and then say, Hey, when the product margin is a certain level, I want to send a conversion to this platform, or I want to do something different with this user, give them a certain property, put them in a certain experiment, bucket, that kind of stuff.</p><p>So it does open up a lot of. New, potentially interesting ways of connecting user data with business data </p><p>Guido X Jansen: [00:27:12] certainly is on the doc, a whole new range of experiments opening up now that you can do more and more service sites. </p><p>Lisanne Maatman: [00:27:19] Yeah, definitely. I think one of the biggest things is that what them keep pointed out is that the situation that we started was.</p><p>With wasn't ideal at first either. of course you weren't able to run experiments for any longer period of time than I'd say three weeks max. and at this point I think, having the ability to reset scoops, for example, from server, enables you to do run tests for a longer period of time. to also for low traffic websites to do run some fast that have.</p><p>less impact or, less effects, but still be able to, to run significant tests. So that is definitely a possibility there. yeah, so that's, that really helps. Yeah, yesterday's brainstorm was so good. </p><p>Dumky de Wilde: [00:28:00] I really liked step's idea </p><p>Lisanne Maatman: [00:28:01] of running that test on the call to action buttons, making them orange will really make them stand out.</p><p>Don't you think? </p><p>Guido X Jansen: [00:28:09] Yeah, We want to design a real AB test winners and achieve enormous conversion uplift. Then stop, brainstorming, and take a scientific approach. If you can read Dutch, follow the steps, then online input, the best seller on the management book, Dalton out and rule in the office course and become an expert in applying proven behavioral signs.</p><p>Yourself goes to &nbsp;dot com for more information and freedom. Do you also see downsides on surface? If you compare, if you want to run any experiments and you have clients to do a service sides, a first client side, are those sites limitations or does it, for example, take longer to develop those experiments.</p><p>Lisanne Maatman: [00:28:49] There's a difference here. you don't have to run your full test service shot to be able to reset the cookie surface side. So there are examples, or their stool tooling in place that will reset. For example, your visual website, optimizer cookie, or your Google optimized cookie that allows your cookie to, be in place for a longer period of time.</p><p>Two knots to expire. There are toolings in place that will allow you to reset that cookies server size using your client's sides, a test tool. So using Google optimize or visual website optimizer, and I think that's for a lot of our clients, at least I think the more ideal situ solution in this case.</p><p>you do have. The easy setup, the visual editor, managing your tests easily, but you're able to run your tests for a longer period of time. So I wouldn't necessarily move over to server side testing right away. but half bath client's sides as with, fond, such of setting your cookie server shot.</p><p>I think that will. help out a lot of customers. </p><p>Guido X Jansen: [00:29:50] Yeah. That sounds like a nice intermediary solution. </p><p>Lisanne Maatman: [00:29:53] yeah. I think so. Yeah. </p><p>Guido X Jansen: [00:29:55] Okay. The blah, we're talking about, tools. Are there any new tools people should be looking out for when switching to serve sides? </p><p>Dumky de Wilde: [00:30:02] Yeah. Yeah. the big thing that's provoked this discussion online.</p><p>If you're, if you're in this niche, then you see a lot of bows around this going on. is Google tech manager service side. which has just come out in, in betta. And I think what's interesting with that is it's not necessarily something new. It's just that it's. It's packaged in such an easy way that it's become very easy for people to set up.</p><p>but if you're interested in that, there's been quite a few tools that have been doing this for a lot longer. it's almost like segment, but also, Tealium has been doing this for a while. and in terms of CRO, I'm not actually aware of any, Current tools on that or new tools on that. </p><p>Guido X Jansen: [00:30:44] Some of the existing tools of course are move, try to move surface side.</p><p>And, SiteSpect is going, as, as always been surface arts. yeah. Okay. tooling, the tooling already, it's mainly the tech manager that you need to look, look after in first place. And then, there are intermediary solutions for your actual testing tools. So if you're already using, for example, if you double the O like you mentioned, you could still be using that.</p><p>Dumky de Wilde: [00:31:08] Yeah, definitely. </p><p>Guido X Jansen: [00:31:09] There's no direct need to switch. </p><p>Lisanne Maatman: [00:31:10] You asked about the downsides of a surface, like tagging or resetting of cookies. And I think that's one thing that this whole thing started with a privacy of course, and also transparency about the data that you're collecting. And I think that is one important downside of having a service side tagging is that you will lose that transparency, right?</p><p>As you mentioned, when you do it, via traditional GTM, for example, you're able to see what everyone is collecting, in sorts of events and whatnot. however, if you move to our server sides solution, you're no longer a transparent, in a sense about what is the extract data that you're collecting from your user.</p><p>apart from all the practical thing and the practical, implications in terms of Sierra, I think there's also more of a. a principal idea here about, so we do want more privacy and we do want more transparency out wherever the solution for this, trend that we see now is to move their server side solution that kind of loses this transparent, way of working.</p><p>So I think that is an important thing that we have to take into consideration. </p><p>Dumky de Wilde: [00:32:16] Yeah. And you get totally new questions here as well, right? Because it's, we used to not really think about it ad blockers, but, with service site tagging, it becomes a lot easier to circumvent ad blockers as well.</p><p>For example. So to situation that you can have is that someone has opted into your, your marketing cookies and that kind of stuff, but then they're still using an app blocker. And are you gonna, are you gonna honor their. their use of the ad blocker. Are you going to respect that or are you going to say, they UpToDate in any way, so I'm just going to track them.</p><p>Guido X Jansen: [00:32:47] Sounds very familiar to a, of course, when we got all the cookery, legislation, of course it sounds nice in principle, but if everyone's doing it, then all the consumers have to click OK. Every website now. And if you have 99.9% of people doing clicking. Okay. And it defeats the point of.</p><p>Informing people of what actually </p><p>Lisanne Maatman: [00:33:06] yeah. </p><p>Dumky de Wilde: [00:33:06] What's actually happening. Yeah. Yeah, definitely. Yeah. </p><p>Guido X Jansen: [00:33:09] We'll see. We'll see how that plays out. So how, so I'm a bit looking into the future or near future at least. what do you, what does it, what are the developments that in this space? And I assume that start with more and more browsers that are double start doing this.</p><p>Lisanne Maatman: [00:33:24] I think that's indeed the first thing that comes to mind. So Chrome will also, in the near future moves to a more privacy friendly, set up. so I think it's basically about, making sure you have that relationship with your users so that old rails down, I think to acquiring that.</p><p>First party data, making sure that you use those, accounts in self identification to track, but also to, to personalize. So I think apart from doing your AB testing, I think, becoming more personal to your users will be an automatic extension of your AB testing program. Since you now are able to recognize them better.</p><p>And you want to also provide that personal experience throughout their, full journey. and I think we need to become more flexible and shift the way we think about traditional touchpoints, like marketing channels and, also measuring on platforms. So moving from that, very much general focus approach in which you.</p><p>Awesome likes your Facebook ads, but do not look at the landing page for example, or we optimize everything in our Edwards, but, don't have any idea of what the messaging throughout the platform is. I think that will be the key focus for the upcoming months for marketeers to start understanding how they can apply.</p><p>So my stuff's full journey instead of just one specific part of that such warrants </p><p>Guido X Jansen: [00:34:43] in general, I think that's an issue with, with the level of furor programs at companies, That they're very focused on the website itself, but don't necessarily, across, across touch points. Yeah. In a way of what you mentioned earlier, I think with Chrome, I think it was, in a previous episode, there was a steamer half, as I mentioned.</p><p>yeah, chromosome, there are market leaders. So they're probably the last ones to move, obviously also because it's a Google owned and, or at least directors and, it's not necessarily in their best interests to move in this direction really fast. </p><p>Lisanne Maatman: [00:35:12] Yeah. And at the same time, Google of course has a lot of first party data and themselves, So they're not really losing in the sense. we're also relying more on platforms like Google and Facebook because they do have that data and we need them to, provide us with, for example, data sets of people that are interested in a certain branch or, </p><p>Guido X Jansen: [00:35:31] yeah, I think a Google itself has a lot of.</p><p>it has a lot of that. It's all. But I think more of the users of their platform, like analytics or Edwards. Yeah. if Google switches off to us, switches to two rollers, privacy mounts, all those users rule out issues. Nothing. </p><p>Dumky de Wilde: [00:35:48] What's interesting though, I think is that they are preparing for that. So would you see with Google is that they, they admit that, if they don't have consent for.</p><p>say 30% or 40% of your users, they need to be able to do something with it. Sad, that big part that's unknown. So they are starting to, apply modeling and machine learning to say, Hey, we've had historical data. We've had data maybe from different sides. and we can apply that kind of data for some models to predict what.</p><p>These users would have done if they had given consent. So that's, I think that's really interesting. </p><p>Guido X Jansen: [00:36:25] Yeah. Do you use the data that you have and see if we can use machine learning to, maybe not know exactly, but at least have some ID basically basic understanding of what we. What they would have done or are there any other developments that we should be looking out for </p><p>Dumky de Wilde: [00:36:41] in this area?</p><p>so I think this is actually, it's an indication of the complexity of out's got to only become bigger and bigger, right? So on the one hand, it's going to be a real challenge for small businesses, mostly where they just don't have the. The capacity to deal with that kind of complexity. They don't have.</p><p>The one has to think about now, do I need to model for the users that don't have consented? Do I need to implement service our Tegan at the same time? I think the companies that do have the capacity for that, and are maybe a little bit more tech oriented as well. They really have an advantage to take, two, just take leaps forward here and, yeah, out of their competition in that sense.</p><p>But I think that's. Yeah. Yeah. And that's really the change that we might see in the next year or so where a few companies will take that lead. And, I'm curious to see how much of an impact it will. it will really happen. </p><p>Guido X Jansen: [00:37:36] and hopefully like you, you're started off with hopefully a lot of the websites that are a lot faster because they have less tax on my website.</p><p>That will be nice. </p><p>Dumky de Wilde: [00:37:45] That me, I'm more secure as well because. That's the funny thing, like we, we, accepted is that a system where, or an ecosystem where it's so acceptable to just load in all these JavaScript libraries from third party vendors, whether it's, from a little bit more trusted vendors like Facebook and Google or.</p><p>Any obscure third-party advertising system that you're working with. We're just every one of these libraries is an attack factor for someone to, to use an exploit's. Yes, it </p><p>Guido X Jansen: [00:38:15] seems sometimes that's why I have this. the extension goes through that. You're probably familiar with. And they can show a pop up with all the things that are lower than my website and some websites.</p><p>It's just insane. Sometimes I have a big screen, but sometimes my screen isn't high enough, all the different things that are being loaded. So that's </p><p>Dumky de Wilde: [00:38:33] and then Ghostery itself is sending. </p><p>Guido X Jansen: [00:38:35] Yeah, exactly. Yeah. That's also a fun factor here. so yeah. Thank you. Thank you so much for enlightening us on, the current state of, the calculus, more and more calculus, world.</p><p>and now we can move to post cookie, a world as zero specialist. final question. I ask almost anyone, any books that you would like to tip to our audience? Which don't necessarily have to be cookie related, but any books on digital analytics or CRO or experimentation or in it, somewhere in that area.</p><p>Lisanne Maatman: [00:39:04] Good question. I'm not so much of reading books myself. I'm more of a, </p><p>Dumky de Wilde: [00:39:09] the </p><p>Lisanne Maatman: [00:39:10] blogs and like smaller updates that I liked it and </p><p>Guido X Jansen: [00:39:14] stuff for me. And any blogs you recently or what are the, what are your, Go to blogs for information on this. </p><p>Lisanne Maatman: [00:39:21] Oh, actually, maybe this is a thing for quite a long time that I recently discovered the think with google.com a herb with a lot of knowledge there.</p><p>So I liked that. and apart from that, Let me think we have, let me check my inbox because there's a newsletter that I can definitely recommend for everyone. Let me see. Maybe in the meantime, a dinky, you have some tips as well. </p><p>Dumky de Wilde: [00:39:44] you mentioned somewhere. I have, I think he just does an amazing job at documenting all this stuff.</p><p>So if. If people don't follow him yet, follow him on, on Twitter, on his own blog, on, the measure Slack channel, for example, and he's just, he's everywhere. LinkedIn, he answers all your questions. it's insane. really great guy by the way. And I think in terms of, two sort of books, that area, if you're into.</p><p>more sort of data science for your business. There's a book called data science for business. I have to look up the authors. No to my heart, but, yeah, it's a really great way to think about not only the data science part, but really the business part as well. And that's really my main point in most of the discussions that I have with clients.</p><p>It's where I tell them, it's not just about the tools that you're using. It's not about the yeah. Yeah. th the stuff or the people you have, it's mostly about setting the rides goals, setting, ride, KPIs, understanding your business, understanding the landscape. And that's really where I find, Simon Wardley and, Wardley maps.</p><p>Really interesting. He has a book actually on medium. cold, Wardley mapping. And it really allows you if you're into that kind of stuff to think about this stuff from a business perspective, and think about where your organization is, where you're adding value and how you can move that into the future.</p><p>think about where you're adding value in the future. It's not for everyone, but if you like the business side of stuff, and </p><p>Guido X Jansen: [00:41:16] so they decided for business, I think that's a, Is that the one, the faucets. Yeah. And the other one, the medium blog, we will link to that one. </p><p>Lisanne Maatman: [00:41:27] I found my newsletter, by the way.</p><p>Yeah. I found it's called Benedict Evans newsletter. So it's, especially when you're interested in things like privacy, everything more from an ethical point of view and really his essays are pretty great. I think it's a good rate. </p><p>Dumky de Wilde: [00:41:41] We'll </p><p>Guido X Jansen: [00:41:42] add that to the show notes for everyone interested in, And, those, those read those books, they, check out the show notes for links to that.</p><p>Thank you so much. &nbsp;thank you for joining me on the podcast and, good luck with, moving clients to, to a post cookie, a cookie. You're welcome. </p><p>Dumky de Wilde: [00:41:57] Thank you. Thanks. It was a pleasure and thanks for the invite. </p><p>Thank you. Bye bye. This concludes season two, episode 39 of the award winning</p><p>from depth. Next Monday. In another episode, I talk with Ann Ricardo to her from that one Oh one about his experience with growing his hero agency and the struggles that came with that. And also the mistakes that these many clients make when starting out with two year olds, talk to them and be optimizing.</p><p>‍</p>",
  "show_notes": "<ul><li>Podcast aon Server-side experimentation: <a href=\"https://www.cro.cafe/podcast/server-side-experimentation\"><em>https://www.cro.cafe/podcast/server-side-experimentation</em></a><a href=\"https://www.cro.cafe/podcast/acting-on-your-analytics-data-in-an-increasingly-cookieless-world\"><em>‍</em></a></li><li>Podcast on Acting on your analytics data in an increasingly cookieless world: <a href=\"https://www.cro.cafe/podcast/acting-on-your-analytics-data-in-an-increasingly-cookieless-world\"><em>https://www.cro.cafe/podcast/acting-on-your-analytics-data-in-an-increasingly-cookieless-world</em></a></li><li>Podcast on State of analytics, experimentation, and personalization with browsers’ privacy initiatives: <a href=\"https://www.cro.cafe/podcast/analytics-experimentation-personalization-browsers-privacy-simo-ahava\"><em>https://www.cro.cafe/podcast/analytics-experimentation-personalization-browsers-privacy-simo-ahava</em></a><em>&nbsp;</em></li><li>GTM server side beta: <a href=\"https://www.simoahava.com/analytics/server-side-tagging-google-tag-manager/\">https://www.simoahava.com/analytics/server-side-tagging-google-tag-manager/</a>&nbsp;</li><li>On being lost:&nbsp;<a href=\"https://medium.com/wardleymaps/on-being-lost-2ef5f05eb1ec\"><em>https://medium.com/wardleymaps/on-being-lost-2ef5f05eb1ec</em></a></li><li>Optimizing GTM for speed and performance: <a href=\"https://www.dumkydewilde.nl/2019/09/optimising-google-tag-manager-gtm-for-speed-and-performance/\">https://www.dumkydewilde.nl/2019/09/optimising-google-tag-manager-gtm-for-speed-and-performance/</a></li></ul>",
  "guests": [
    {
      "id": "lisanne-maatman",
      "name": "lisanne-maatman",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    },
    {
      "id": "dumky-de-wilde",
      "name": "dumky-de-wilde",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/cro-in-a-post-cookie-world.jpeg",
  "language": "en",
  "type": "podcast"
}