{
  "id": "growth-minded-superheroes",
  "title": "Growth Minded Superheroes",
  "description": "Join Guido Jansen on a new episode of CRO.CAFE as he returns from a hiatus to delve into the Growth Marketing Summit event.",
  "date": "2025-01-08T20:07:07.492Z",
  "duration": 0,
  "audio_url": "https://audio.transistor.fm/m/shows/5036/c4cdae1fbb660a554d35396b5c3382f9.mp3?download=growth-minded-superheroes",
  "transcript_url": "<p id=\"\">[00:00:00] Welcome to a new episode of CRO.Café. I'm Guido Janssen, and guess what? After a long hiatus, I am back with some new episodes that you don't want to miss. It's been a while, but just like a superhero returning from a secret mission, I'm ready to dive back in the world of CRO. next week I am visiting the growth marketing summit in Frankfurt, where a hand selected lineup of optimizers will take the stage and inspire you with their raw knowledge. And I am the lucky bastard that was asked by the organization to interview all these experts from the stage and the audience in our own CRO Cafe.</p><p id=\"\">Podcast booth on the exhibitors floor. So naturally on today's episode, I have Andre and Julia, the masterminds behind this event to talk about growth, the mind and superheroes. So welcome back and let's get started with my first question to Julia. About how this event actually got started. Yeah, actually, you know, I [00:01:00] just thought about that because I came in here now and, took over the event from Andre this year take care of everything.</p><p id=\"\">And then I looked back and thought, Oh, he initiated this in 2010. And then I asked, I remember Andrea asked you, why did you do that? And what was like the, the main idea of doing an event like this? And you said. You know, initially we just wanted to bring together optimizers to connect, to network with. We had some clients, that just wanted to exchange ideas and talk about challenges they are facing.</p><p id=\"\">So in 2010, Andre came up with the Conversion And, Andre, if I'm right, there was like a two day event, right, with a boot camp, workshop, and bringing together already 200 people at that time. Yeah. We wanted to do a combination of conference and bar camp. Back then, bar camps were very famous, and that's maybe an unhappy anecdote.</p><p id=\"\">We called it conversion camp for the very first edition, and we did not know that the Catholic Church in the U. S. was doing something [00:02:00] there called conversion camp. which was to, convert, gay people into straight people, which is horrible, horrible idea. We did not know that something stupid like this even exists, but that was feedback from people in the U S.</p><p id=\"\">I heard similar feedback when, when Tom organized the conversion hotel in the Netherlands. also the Americans were thinking, what is this going on? so We quickly renamed it to Conversion because our idea of a summit is like we wanted to have the best people together.</p><p id=\"\">Back then I was already traveling around the world giving speeches at conferences and I saw there's a huge gap between the brightest people doing the best talks and the lesser good. Good talk. So my strategy was I create like a handpicked lineup of the best people I meet during the year.</p><p id=\"\">So my value proposition back then was you don't need to travel two, five or six different conferences. I already handpicked the best people for you.</p><p id=\"\">Yeah, we were talking about this at the beginning. CRO is [00:03:00] dead, isn't it? Some people say. Conversion. We, quickly realize that conversion rate is a stupid metric to focus your experiments on. or maybe not the best in all cases. We thought conversion rate optimization is too narrow. Or you could even go back to landing page optimization. there was a time back in 2008, I think Tim Ash published his book called Landing Page Optimization. That was a huge thing back then. So meaning you only optimize the landing pages and the rest.</p><p id=\"\">there was this time of landing page optimization, A B testing, then it, kind of submerged into conversion rate optimization. That was a time we call it conversion, summit, but we quickly realize it's about experimentation and, customer experience optimization and these topics.</p><p id=\"\">And they are basically there for growth. So we thought about. Calling it growth summit, but then, we found the name growth marketing summit interesting. So that's how we ended up with that name. We always wanted to find a name that clarifies what we [00:04:00] stand for. the audience profile changed a bit, you know, because we noticed more people from areas like product management are interested in this.</p><p id=\"\">in this topic as well and joined the summit. So we see more product owners, product managers coming to our event, UX designers. So it was quite a broad audience. whereas in the beginning, I think, Andre, it was really like the pure CRO people, and then like we broadened it up. And so we had to change the name to also make sure people understand it's really about something more holistically.</p><p id=\"\">called growth. And then the question of course becomes is growth marketing summit still a good name? that's, that implies what this podcast already called growth minded superheroes. And the answer is no. growth marketing implies this is for all the people that work for marketing inside marketing together with marketing, but the world is changing [00:05:00] and maybe this represents the maturity I just talked about.</p><p id=\"\">Landing page optimization, conversion rate optimization, then we call it experimentation and more and more teams are getting involved. So, now we realize, growth is a discipline for. all teams. </p><p id=\"\">It's still also for marketing people, for product people, for everyone. Actually, what Julia came up with, an idea I really like and I really support is, renaming it to growth minded superheroes, because everybody who comes to this conference, is a superhero because these are people that care, that want to learn more, that want to grow.</p><p id=\"\">I want to raise immaturity. These are the fighters for truth inside each company. We want to support them. We want to make them, the superheroes of our conference. So we will call it growth minded superheroes in future. It's also exemplifies what we stand for as a community with. A growing evolving and yeah, sometimes the names need to change because, audience changes, reality changes.</p><p id=\"\">So Julia, I'm now, [00:06:00] of course, very curious, does it only, imply a name change or what else is going to change this year? I don't want to, tell too much. So not too many spoilers, but just some hints would be nice. no, I mean, in the end, just to add to Andre's point, what was important also by changing the name is for us.</p><p id=\"\">Because it's all about the community. It's about the people, we noticed over the years that what makes the event so special is of course, the hand selected lineup of speakers that Andrea is always selecting, to have the best and, most relevant topics on stage, but then it's all about the attendees because we have such a strong community of people, a lot of people coming back, each year, we are growing the community. And the networking aspect of the conference is so important. And that's why we thought we need to put in the middle of everything, the people. So that's why we want to call it superheroes, because it's about the people, about the superheroes that make the event so special.</p><p id=\"\">And then about your question, what will be changed? Yeah, of course, [00:07:00] there will be a few surprises. but yeah, I don't want to spoil it too much. So people should experience it themselves. We always try to improve. We always try to optimize the conference. And what Andre and I did, was talking to a lot of attendees from last year to get some feedback, to optimize the event itself and to put this feedback into the event.</p><p id=\"\">And I really hope that this worked out. So the biggest complaint last year with this fresh fruit, fruit, fruit, sorry, fresh fruit was missing for the breakfast. Okay. If this is the biggest problem. Sounds like a great event, but that's the biggest complaint. Exactly, that's the biggest complaint. What changed is that we increased the possibilities to network with others.</p><p id=\"\">And it sounds maybe, unconvenient for introverted people, but we make it as convenient as possible because I think, you have the possibility to talk to a couple of hundred people there who did maybe on average a couple of dozen or a hundred experiments. [00:08:00] So you can learn so much by talking to other attendees.</p><p id=\"\">And we try to make that as easy and convenient for everyone, even the introverts who say, well, I don't want to talk to other people. No problem. Come to growth marketing summit and experience it. Are there any, particular topics or speakers that you're looking forward to this year or that you personally think, Hey, this is going to be a really important topic.</p><p id=\"\">looking out for next five years in zero or growth. what's going to be really important for people, to listen to or to think about. It's a tough question because, As I said, all the speeches are kind of handpicked and I'm looking forward to each of them. It's always surprising that finally it turns out different.</p><p id=\"\">compared to what you had in mind. but what I am looking forward to is a speech that we never had, before. and it's a talk from my colleagues, from two colleagues of conversions cuff, both coming from a product organization, and [00:09:00] talking about the pain they experienced inside product organizations and how to solve it.</p><p id=\"\">And that was their motivation to switch into CRO or experimentation and optimization and now they see the benefits that the two worlds could have from each other. And it's a speech that is all about closing the gap, bridging the worlds together. So I'm really looking forward to this one, although it's from our own.</p><p id=\"\">it's a tough one for our people. You know, they know that there are many well experienced speakers. So there's a high, no pressure and mark. Yeah, no pressure. Could you please talk about this and that? So, no, I, have a lot of respect for, our colleagues that also take the stage. And, Julia, talking about, going out there, especially after COVID, everyone's used to working remotely now, and there's a lot of, online conferences, webinars that we can, follow.</p><p id=\"\">So why do we still need to go to an offline conference? Why do we still need to travel? Why is this so [00:10:00] important? Yeah. You know, we were a bit scared after COVID, if people would really come back to the event because everyone was afraid. And then we noticed people loved that, they really needed, the exchange with others, the networking and the personal exchange and not only talking online.</p><p id=\"\">and that's why we see the growing numbers also of attendees, joining. And we're convinced that it's so valuable to be there to have the time also at the get together in the evening, you know, that gives space that you would never have in an online meeting to discuss things very personally. and that's why I'm totally convinced that events will be very important also in the future.</p><p id=\"\">People are social, people are social. Period. Right? Social interactions. Even for introverted people. They need social interactions and, This is why we think growth marketing summit is an experience, including the networking breaks and the coffee breaks. we will have some activities where people can participate and everything.</p><p id=\"\">[00:11:00] We have the, networking reception after the conference. speaking with other people is so valuable. Some people say, this is even more valuable than the speeches. They were inspiring, but connecting to like minded people who are in a different or similar situation, learning from them coming from different companies, but being in a similar situation, that's so valuable.</p><p id=\"\">So you can't do that online. It won't work. As someone that's leaning towards the introverted side. I started the podcast. To still talk to people, but, still going to, offline events. I think after COVID, it even gives some extra energy because people are at home all the time.</p><p id=\"\">Now it's extra special to go to, there's more intent behind it. There's more, energy, to go into such an event to make it even more special. and then you can go rest at home again. That's fine. That's also good. That's nice. But the meaning of everyone that you're already talking to, to a screen all day, it's very nice to do that in real life.</p><p id=\"\">And as Andre already said, we [00:12:00] wanted to make it as easy as possible also for the introverted to connect with each other. You know, I mean, you don't have to talk to each other, of course, but so you're not forced, but we will make it as easy as possible, for example, by providing for the first time an event app.</p><p id=\"\">This year that also connect easier with people to set tags for topics that you are interested in that you want to learn more about and to find the right people to match, you know, so I think that's also something that will really make a difference this year. as a visitor, how can I get the most out of the events?</p><p id=\"\">Should I bring certain things? do I need to prepare something? What do I need to do? How can I make this the best event of the year for me? </p><p id=\"\">how should you prepare? That's a good question. Just be there. So be, be open-minded, you know, I. Exactly. That would have been my answer. Just be open minded, go there with like a positive attitude and just think, okay, [00:13:00] you can learn.</p><p id=\"\">You will definitely take something from here. If it's from the talk, if it's from the networking, just be open, talk to people and use the opportunity that it gives. the only thing that I would say is now that I talked about the app, download the app like a few days before, set up your profile, set up the tags and things you're interested in to connect easier, you won't miss a talk as we only have the single stream.</p><p id=\"\">That's also different from other conferences where you have to pick topics in and then you have this, FOMO and think, Oh my God, I need to attend this or no, I want to attend this. But you have the single stream, single track conference where you can't miss a thing. that's also important for me.</p><p id=\"\">Other than that, yeah, just enjoy. Be present. Yeah. it's not that often that I'm speechless, but this time you caught me. I have no idea how you could prepare for, attending the conference, but I have one answer to that question as well. You know, because what I observed is people sitting in their [00:14:00] companies talking to their colleagues </p><p id=\"\">I would call it being trapped in their bubble. Everybody is trapped in their job bubble. And Many times you think, well, am I the only one that needs to convince their bosses to do X, Y, Z, whatever? am I the only one that has a lack of resources here? Am I the only one that thinks I'm fighting against whatever?</p><p id=\"\">And I think this is, something you will learn, when you come to, GMS, right? That there are people that have the same bubble. In different companies. And that's what I mean when I say the only thing you need is be a little bit open minded because you can learn from these people, they might have solved some things that you still need to solve.</p><p id=\"\">And also regarding the different names and the history we have, what we went through, [00:15:00] you will see people that already are in a different stage. Well, we now have product teams and we want to make them experimentation ready. while you are still in a center of excellence and you try to have a centralized approach and you're still remember how it was when you were the only team that did AB tests and whatever.</p><p id=\"\">So you will be helpful for everyone else that, that has a different maturity. You can learn from each other. because you maybe solved some of the hurdles already to move forward. And so that's the only thing you need. Be open minded, listen to the stories of other people. Exactly. I mean, at minimum you can just give each other a hug or cry together because you have the same problems, but more likely you will be able to solve your problems by talking to people and sharing challenges that you have.</p><p id=\"\">That's the value proposition, the whole community of growth marketing summit attendees is maybe, the [00:16:00] biggest walking asset, the biggest database of knowledge and experience that you can find, in the world. You won't find another place where you have that many people. For the real networking that happens in between.</p><p id=\"\">And that's the way you talk to your peers about, Hey, I have the same issue or I solve this in this way. Of course, at the networking and, the get together after the events on maybe during breakfast. We have some nice fruits. that's something we really improved and I think that will raise our NPS, to astronomical heights.</p><p id=\"\">We already ordered so many bananas and you can't imagine, I have so many bananas. Number one tip in organizing a conference in 2024, bring, bring fruit and lots of it. So, yeah, for everyone, June 19th in Frankfurt, book your tickets. If you don't have them yet, to, growth marketing summit.</p><p id=\"\">com and we'll all be joining some fresh fruits together then. Thanks. that's what will [00:17:00] do. Thank you. Julia. Thanks, Thanks. See June. Bye bye.</p><p id=\"\">‍</p><p>‍</p>",
  "show_notes": "<p id=\"\">Join Guido Janssen on a new episode of Zero Café as he returns from a hiatus to delve into the world of Growth Marketing. In this episode, he interviews Andre and Julia, the masterminds behind the Growth Marketing Summit, discussing the event's evolution from a small 2010 gathering to a prominent summit for optimization professionals. They explore the transition from Conversion Summit to Growth Marketing Summit and the future rebranding to Growth Minded Superheroes. The conversation highlights the importance of community, networking, and personal interactions in the ever-evolving landscape of growth marketing.</p><p id=\"\">Get your tickets here: <a href=\"https://www.growthmarketingsummit.com/\" id=\"\">https://www.growthmarketingsummit.com/</a></p><p>‍</p>",
  "guests": [
    {
      "id": "andre-morys",
      "name": "andre-morys",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    },
    {
      "id": "julia-rumpf",
      "name": "julia-rumpf",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/growth-minded-superheroes.jpg",
  "language": "en",
  "type": "podcast"
}