{
  "id": "holacracy-decentralized-management-and-organizational-governance",
  "title": "Holacracy: decentralized management and organizational governance",
  "description": "How to work together in your company the (fascinating) decentralized management model called Holacracy?",
  "date": "2025-01-08T20:07:07.493Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/25a3ca3f.mp3",
  "transcript_url": "<p>Guido Jansen: [00:00:00] Morgan. Welcome. To the podcast. And, first off, of course, we want to learn a bit about who you are. So, can you tell us a bit about your background and how you rolled into, doing CRO or, CRO related stuff at Convert.com?</p><p>Morgan Legge: [00:00:16] By accident. That's the short answer. so it's no surprise and I, I don't hide it on my LinkedIn profile.</p><p>I used to be a to your architect and, a renovation project manager for high value, renovations. And I came to convert originally five hours a week to do Holacracy implementation as a contractor. It's something I also had no experience in. But what we'll do, we'll dig into that. I'm sure you'll, you'll dig that out of me.</p><p>So I came into this world of which I knew, I knew, you know, I had ideas and I understood a little bit about digital marketing because I had worked in a very kind of archaic and slow moving industry, but you know, understood what marketing and digital marketing did for our business. But I, you know, didn't havereally.</p><p>In depth knowledge of what that was or what it could do. And as I got further involved in Convert, because of our structure, I have taken on many, many roles and learned lots of new and exciting things. And Dave didn't a little bit to this world. </p><p>Guido Jansen: [00:01:32] Yeah. So, so what did you, what are you currently using that you used before in interior design?</p><p>What are your bringing with you to Convert. </p><p>Morgan Legge: [00:01:40] Well, I think a lot of, problem solving, you know, I think it's when you're working in a, in a, in a SAS company, and when you're working in a, in a company that has a lot of, entrepreneurial, our structure is basically a, to succeed, you have to have an entrepreneurial mindset that's, a base qualification.</p><p>And I have an ability to. See the big picture and see the details. So for me, I can easily go in and out between the two. So I can see operationally how decisions can impact, you know, whether it's people, whether it's product, whether it's a cost to our customers. So agencies, for example. and I think that, you know, that background of being able to.</p><p>Please and be honest and cater to while moving projects forward successfully, to different stakeholders and teams is really good skillset to have. And apparently it translates really well. </p><p>Guido Jansen: [00:02:45] Yeah, that does sound like a good skill, indeed. So for those of you, for listeners that don't know, Convert has been a sponsor of the podcast for a long time now, but can you tell us a bit about what Convert does.</p><p>Sure. </p><p>Morgan Legge: [00:02:58] We're an AB testing and personalization tool for agencies and enterprises. Okay. That's the short answer </p><p>Guido Jansen: [00:03:09] and the long answer... </p><p>Morgan Legge: [00:03:11] the long answer is that we have a tool that developers love, very, easy to use and customizable of, for, you know, if you're inserting code, it is powerful and good value.</p><p>So, you know, that checks a lot of boxes for people who are really looking at the bottom line. And. You know, we, I think we can, we stuck up in complete, compete really nicely, with the other others that I will not name </p><p>Guido Jansen: [00:03:44] all those that are probably familiar to all of our listeners. </p><p>Morgan Legge: [00:03:47] Yes. </p><p>Guido Jansen: [00:03:49] You already mentioned you don't really have a title at school for it, as, as no one does.</p><p>but you have roles. And we'll get into why that is later on. but what are your roles. To give an idea of what are your roles at Convert.</p><p>Morgan Legge: [00:04:03] I have. So it's interesting. we're allowed to pick whatever role we want, whatever title we want to have to the outside world, kind of. So the title I have to the outside world as director of operations, I think that it speaks very nicely to.</p><p>How I have helped to grow, convert from 5 people to now 40. We just hired four people in the last 3 weeks and my roles have changed as the implementation of Holacracy has changed through the organization. So I think that the, the title that I give myself to the outside world is very, fair and a demonstrative of what the value I have in terms of the roles that I energize now.</p><p>I think I gave you the list before. There's like nine roles. It is quite the lis t &nbsp;. So I can say that, I hold roles in operations, in sales and success and in marketing. And I am the representative. It's a little bit funny. I'm actually a newly assigned to be the lead link or the leader for the sales and success team, but I represent the members of the operations team in our super circle meetings.</p><p>Guido Jansen: [00:05:27] Yeah.</p><p>Morgan Legge: [00:05:28] So it's, you have to, in your work, in an organization like this, you really need to be able to compartmentalize and wear different hats pretty quickly. it's certainly not for everyone, but it's, it, it allows me to keep my fingers in a lot of different pies, and really understand what the, the pulse of the organization is and how to grow the business.</p><p>Guido Jansen: [00:05:48] Yeah. And you don't necessarily do AB testing or experimentation, yourself. Can you tell a bit about what, what optimization or maybe the experimentation mindset, how does it look like at Convert itself? </p><p>Morgan Legge: [00:06:02] Well, I think that, so one of the core tenants of our DNA is progress, not perfection. I actually have it, embossed on one of my &nbsp;eags.</p><p>And this is, really a driver for everything that we do internally. So I think it's important to note that, you know, Holocracy as a system is self-steering and self-organizing. So when we talk about optimization internally, we're really looking at, The processes and the process improvements that we can leverage to make the work flow and the make the work better to make the organization better.</p><p>But at the core of all of that, because we're a remote team, I really think that empathy is the core of optimization. It means nothing to understand what your priorities are in a day, or what project management tool you're using or anything like that. If you can't come into your day and understand the context of what you're walking into.</p><p>So this for us is really, really important. you know, we're a hundred percent remote team. We're 10 times zones. We would do a lot of our work asynchronously, and I think that this is becoming, More kind of understandable to people in these crazy times that we're living in. They've kind of been thrust into this, so they maybe understand a little bit of what I'm talking about.</p><p>We've always been a remote team, so in order for us to optimize ourselves as professionals and as role holders. We have to first practice empathy when we show up to work. </p><p>Yeah. I think that's a beautifully, I mean, and that's, that's what optimizing is about, right? The empathy for the end user. how are they actually using your stuff?</p><p>Empathy is a, is really important, for that one. so we're here today to talk about Holacracy and how that's implemented at conference. First of all, for those who don't know the term, what is Holacracy? </p><p>I would say in simple terms, it's an operating system for your organization. So, you know, we think of traditional hierarchies as pyramids.</p><p>it really is a way to structure the work. It's, has. Yeah. It's an operating system. It's how it's built into how we run, convert. Yeah. </p><p>Guido Jansen: [00:08:46] For me, when I was, tried to describe it to people, it's, it's, it's, it's a weird combination between being very strict on certain things, but complete freedom on other things.</p><p>Morgan Legge: [00:08:56] Correct. Yes. I'm, I'm glad that you, you, you, you understand that differentiation because I talked to a lot of people in this type of format, and they're like. Oh, it's flat. You'd have no managers. You know, they think this is kind of like, we're hippies from the seventies or something. And you know, we, you know, just kind of stuff happens.</p><p>And the reality is, is that it's a very clear and very formalized and very structured, you know, but within your boundary of your role, you could do whatever you want to move the company forward. And that's very liberating, </p><p>Guido Jansen: [00:09:36] Can you explain a bit about one of those structures that you have in place. </p><p>Morgan Legge: [00:09:41] So, for example, I used to hold the role of HR champion, which is a role that, I gave back and now kind of morphed into something else that someone else energizes it. At that time, I came up with all the hiring processes all the. Ways in which, like all the details for how we were going to find and recruit people into this new system that we were using to run, convert. And I didn't have to ask for permission for that.</p><p>Right. So I think that if we think about it in terms of giving people freedom to do. What they know is the right thing to do. I came on board initially for this whole kind of Holacracy experiment. Dennis &nbsp;(Convert Foudner and CEO) had seen a Ted talk or something like that, you know, one of these like super inspirational things, you know, it's like, Oh my God, I need to do that.</p><p>And he was, at a kind of a crossroads. He'd realized that he had become, the boss that he never wanted to have, you know, he was hoarding information. He was a micromanager. he was always the bottleneck for decisions. And you realized that he didn't even want to work at the company that he had created.</p><p>And there was this shift about, you know, you need to be able to give control and decision making to people and just trust that they're going to do the right thing. and that's, you know, it's been certainly a process to where we are now, but that was kind of that, that was the start for it, right? So I think that when you give someone their.</p><p>The parameters of where they have their power and control and just say, Hey, you know, these are our OKRs. This is where we are, this, you know, our company information is very public internally. It's very transparent. This is where we want to be. Take us there. </p><p>Guido Jansen: [00:11:51] And I can imagine that for, for someone like Dennis, who is the founder, cofounder of, of convert, it's also, it can be liberating to not have all this, this, responsibility, but it's also very scary, of course.</p><p>Right? </p><p>Morgan Legge: [00:12:05] Absolutely. </p><p>Guido Jansen: [00:12:05] so how. How, how does it go? Maybe you have more experience outside of Convert, so, but how does it usually, go, how do founders handle this? I can imagine that are, yeah, it can </p><p>Morgan Legge: [00:12:18] be very tricky. Certainly tricky. you know, I, I'm not going to say anything that I hear that I haven't already said to Dennis.</p><p>You know, I think. When you know, when I started, you know, we had already had the conversation to see if we could give it a go, give it a try. did an audit to see, you know, what was going on, what roles we had, and learning the constitution of Holacracy, which is really kind of, it's the structure of how, you know.</p><p>We operate, whether it's in tactical or governance meetings, so day to day or, and you know, there were more than a handful of times, you'd be like, Oh, but I want to do this, and I don't agree with that. And it's like, okay, but you don't own that role. Right. So I understand that you have opinions about it.</p><p>But you need to trust that you have someone who's going to make the decision that's good for the company, even if it's, maybe it's not the decision you would have made and it's, it certainly takes time. It takes, I think obviously you have to have a willingness there. Right? I don't think it's anything that can be thrust on someone, but I do think that the.</p><p>It's very, it's been very liberating for both him and his co-founder because it allows them to spend time with their families. It allows them to spend time on projects and roles that are really important to them. and. I mean, why would you start a business and want to work on a business when you have to do the stuff that you don't actually like doing?</p><p>Right, </p><p>Guido Jansen: [00:14:08] exactly. Is there, as a founder or people listening to this podcast and that they, people working for them, like is there in Holacracy no way as a founder to be able to influence anything in your company anymore besides your own roles or how, how does that work?</p><p>Morgan Legge: [00:14:25] I see. So I think I can, I can collectively hear them like either rolling their eyes or shaking. Right. I think for founders, I say I want to be really clear. Like, you need to nail your hiring right. this is super, super important. Like you have to hire for the right qualities of people who can push back, who can lead, who can set boundaries and expectations, who can take responsibility when things go sideways, right? and who are, natural learners. And then you also have to be able to give some budget, a little bit of budget to roles for them to make decisions that need to be made. and. It's, I mean, I see. Can they influence, I mean, you know, one of the roles that Dennis holds in our super circle is goal gladiator. So he sets the OKR for each quarter and the overarching strategy for converting. It's the lead links for each circle. So we have product in development, smooth ops, marketing and sales and success that then take that OKR or OKRs, depending on where we are, and it's up to them to interpret those and set metrics for them. and those leaders are the ones that, set the prioritization, you know, the defining, defining, relative priorities and, maybe some multiple strategies at the circle level. So, yes, as a founder, I mean, he does have. But he doesn't have the, he doesn't have the power to tell me, Hey, Morgan, you know, you're energizing the role of lead link for sales and success. I want you to achieve this OKR by doing X, Y, and Z. And you know, it doesn't work that way. </p><p>Guido Jansen: [00:16:34] You can influence your goals, but he can't be influenced the way you try to reach them.</p><p>Yeah. And for those that have no idea what we're talking about, OKRs stands for Objectives and Key Results, and we'll definitely link to some more explanation to that in the show notes. We won't go into that right now. so you already, you mentioned something about hiring. I want to get back to you, on that, in a couple of minutes.</p><p>But, first as far as, so you already said you came on board with converts. and then as well as happy. And that started with the situation they were at at the moment. sort of was a transition. From mum, the holography to Holacracy. So, I can imagine that that's also challenging if you don't start out that way.</p><p>So what were the biggest challenges in changing to this new way of work? Like did people </p><p>Morgan Legge: [00:17:19] leave?</p><p>Yes, absolutely. People left. certainly, you know, as I was defining the hiring process, there were definitely false starts in, you know, how to hire a, what to hire for, Elapses on like how to fire people. and I think difficult &nbsp;you know, there's a lot of coaching, right? One-on-one, like for me, with Dennis as well as with me, with his co-founder, Claudio with me, with actual individual role holders to say, no, actually. You can make this decision. We don't operate on consensus anymore, right?</p><p>Like this is kind. If you have your own kind of autocracy here, you could do what you want and it's, It's scary. It's certainly scary, especially when you've been used to one type of management and organization, and it's also too, I think it's, it's scary for, for people because , we all get educated.</p><p>And kind of inculcated in the certain way of working and living in like expectations and culture and hierarchy. And then to tell someone, you know, Hey, just throw that out the window and this is your domain. You can do what you want here could be really scary and also very liberating, right? But it's not like . We grow up in that environment no matter where you're from. Right. Some people may be more comfortable with that than others, but it's not </p><p>Guido Jansen: [00:18:52] inate. </p><p>It's both, being very strict on some things and being very liberal on other things. So I can imagine it's for people that are having issues with both ways.</p><p>Like it's, it's too strict right now, or. It's so liberating that I actually don't know what to do anymore. Like you fall back into being really passive and you're being used to being told what to do, and that's not happening. </p><p>Morgan Legge: [00:19:18] And there's also, I think, this kind of a paralysis of choice, right? You know, I can have so many of these options, like which one do I choose?</p><p>And it's like, okay, a, B and C are all right answers. You just have to make a decision. And then you just, on the flip side is thought of that is that you need to take responsibility, right? So if you end up making a mistake, like we have a channel for that, it's called fail forward. You would take a decision and it ends up not being what you expected.</p><p>Then in our DNA of transparency, we expect you to own up to that and not going to get fired for that. It's not a reason for someone to get fired. It's, it's a learning experience. It's like that whole progress, not perfection thing that I was talking about earlier. </p><p>Guido Jansen: [00:20:09] And I assume it's not like that. There's no discretion anymore in the company.</p><p>Right? I mean, there does need to be consensus on something that you do, but it doesn't mean there's </p><p>Morgan Legge: [00:20:20] not consensus. There's not, you're not looking for consensus. you're, you have consent. So you're governed by consent. so I think the differences that, you know, in my roles, I am. I'll pull in people with more experience than I do.</p><p>you know, more technical expertise. Certainly, I've never would pretend to be an expert in, you know, our product. For example. I'm not an optimizer, but I do, I can take in the input of what professionals. Have an experience in and then apply that information to make decisions. Right. I say you get into a dangerous place when you don't ask for it.</p><p>When they kind of have this ego of, I know better of, which could be a little bit dangerous, but it doesn't, it doesn't happen very often. </p><p>Guido Jansen: [00:21:27] And, you also mentioned that, comfort is completely results, there, there's no office. would you say, that the Holacracy and, and having a completely remote workforce, is that a match made in heaven or not necessarily?</p><p>Morgan Legge: [00:21:41] I think so, it's funny, I run a monthly group that is. Specifically for, Holocracy practitioners that are remote and been running the group for, I guess, three years now. And I've always said that it's like such a great match, you know, and I don't understand why more remote companies don't sign up for this. I think that having this, this self-steering and distributed authority model works really well, especially if you're asynchronous.</p><p>Right? I've mentioned earlier, we're like 10 times zones, nine, 10 times zones. I don't even bother to keep up or, to be honest . No, I mean, it can be a pain to try. Don't get me wrong to try and, you know, if we have to have a synchronous meeting, it's, you know, I, and I am now actually starting my days at 7:00 AM in my time zone, because I want to have more overlap with Europe, but that's a choice that I made for myself.</p><p>Right. it's like, yeah, it, it just, because then you're not waiting, you know. Six, 10, 12 hours for someone to come back online to make a decision to talk about it too. You know, things can move quickly. I always like to, and that's, you know, when I touched on the beginning, is understanding the empathy and understanding what you're walking into.</p><p>When I opened my Slack in the morning at quarter to seven, I can see everything, like almost every channel is. Illuminated. I could see so much stuff happened between when I got offline and when I got back on and I didn't have to be involved in any of that. It's like magic, you know, things happen and move forward when you're, when you're sleeping.</p><p>Why wouldn't, why wouldn't you want that? I don't know.</p><p>Guido Jansen: [00:23:41] I can also imagine that for the people that have been working in a, in an organization that does Holacracy for a couple of years, if you're used to that. Okay. You're ruined for life. </p><p>Morgan Legge: [00:23:52] I realized that actually a couple of years ago. I, yeah. I, I said to my girlfriend, I was like, Oh, you know, like, I'm really, really screwed.</p><p>Like if I, if I ever leave, I either need to start my own business or I need to, I can't, and it can't just be like, go to. A place that is organized on Holacracy. So you have to be remote as well. Like, no way. I'm going and doing a commute anymore. Right. So, yeah, </p><p>Guido Jansen: [00:24:20] I don't think that's a, that's a, that's a filter on any </p><p>Morgan Legge: [00:24:22] jobboard </p><p>it's not, and LinkedIn only recently started doing remote, you know, before this whole covert thing. So hopefully, I hope that through all of the, We get through, we get through the tough stuff of Covad-19. we're able to have real conversations about what remote work is and what it isn't, and about what different structures of work exists, rather than being.</p><p>I'm in a big rush to go back to the status quo. Like maybe we can use some of these learnings about what we liked and what we didn't like about being in lockdown or working remotely or whatever it is to make things better. </p><p>Guido Jansen: [00:25:12] That will be great. Right. It sounds like a great opportunity we have right now</p><p>Morgan Legge: [00:25:15] I think so. I think that, you know, it's a, certainly that's a, it's, it's not for everyone, but I do think that, we do have an opportunity to have a wider discussion about what work looks like.</p><p>Guido Jansen: [00:25:30] Yeah, definitely. shifting topics a bit. so, at Convert, you also, preach Conscious business and conscious business is one of your roles at Convert so. Well, </p><p>Morgan Legge: [00:25:43] it entails of being the change that we want to see. very simply. there's, so we have a three-pronged mission for convert, for conscious business.</p><p>one of them is for our customers. So we have, always grandfather pricing. So we will never. Fire a customer, for example. I was looking, I would say, actually the other day I was looking at that revenue channel and I, I saw all these code names and I didn't know what they were, and someone told me, Oh yeah, this is the plan where people are paying like $59 a month or something.</p><p>It's like from whatever. </p><p>Guido Jansen: [00:26:26] I actually saw a, I think it was a LinkedIn or tweet from Dennis this week. He said that we're actually two to customers still around that were on the $9 plan, the initial plan. </p><p>Morgan Legge: [00:26:39] Exactly. You know, and that that's like, that's, </p><p>Guido Jansen: [00:26:42] and then never sort of grandfather ideas that they never get a </p><p>Morgan Legge: [00:26:46] raise</p><p>raise. You leave us, you break up with us.</p><p>It's something else. But no, as long as you're like active and know so. And I love that. Right? So conscious businesses, a couple of things. So for the customer, it's like grandfather pricing and you know, for, for whether you're a single proprietor, you're an agency that you know that we always have your back.</p><p>We're never going to. we're very privacy focused, which I'm sure you know, and probably some of the European listeners know, we really take, GDPR and privacy and security compliance to heart. And we actually, it's default in our tool too, right? So if you're an American user, you actually have to turn those off rather than, having to go into some.</p><p>You know, nebulous sub menu somewhere to try and find the right thing. and then the other thing, the other two components of our conscious business is that, environmental. So we're a 15 X carbon positive, which means that we offset 15 times the carbon that we produce as a company. </p><p>Guido Jansen: [00:28:02] Oh, is that the goal of like 15 times?</p><p>Where, where did the 15 come from?</p><p>Morgan Legge: [00:28:06] Initially it was one, and then we were like, you know, we could do more than that.</p><p>Since before I joined convert, our servers have always been carbon neutral. We then now also offset all the energy that we use for our applications, convert wide. We have started to actually this quarter, we've started to implement, kind of a bonus where after your hundredth sign-in, we plant 50 trees.</p><p>so I really love that one. and then, so we did an audit with South pole &nbsp;(Southpole.com) , last year, and then we offset that, amount that we produced. And, you know, as a remote company, it's certainly, you know, as a SAS business, it's certainly a lot less of a footprint than you would have for, you know, a product based business.</p><p>Guido Jansen: [00:29:05] yeah. You already have no, no office, </p><p>Morgan Legge: [00:29:08] no office, no commute. But you know, interestingly, our audit does, encompass, you know, the energy, the heating. they got really, really detailed. Like I had to make a whole inventory of all the equipment that I bought for work, work, which in the year that, that year was actually quite a bit.</p><p>and you know, that all was accounted for an offset. Right? So. It's very, I was surprised actually at how detailed it was. And then also, I mean, the other thing we do is, so we have to, we, every core member of convert has, a company card for their budget, for their role and for their productivity perk.</p><p>And we have to send those physical cards. All over the world. So we've offset that as well. Right. that as conscious business, one of the policies that I put in place, for this year is that we no longer send swag to collaborators. So if you remember, I think it was what, last year or the year before, something photo shoot, something like that.</p><p>yeah, so that was me saying, I'm not buying stuff. we have, like for one of our collaborators who, one of our agencies who lives in actually Spain, I did the work and I found, I asked, I had a little questionnaire for him and. Found out a couple of key key things about him, and then I found a local experience for him.</p><p>So it was actually a biking tour to a Hort chatter factory, in Spain. I forget where, but, you know, finding these kinds of like details of like speaks to, Leaving a better experience for the people that you're collaborating with. Right? And you're also doing a better thing for the planet as well. And that's really important.</p><p>the third thing that we do that I, I'm very, very proud of is that we actually will turn down businesses that don't align with our values as a company. So it's not something I think that a lot of companies talk about. I think it's. Some of them do, but I think also, you know, it's kind of this, like a couple of the agencies that I've talked to that we work with, say, Oh, you know, we kind of do that, but we don't talk about it.</p><p>Right. And they like the fact that we do it. So that then they can say, Oh, well, I can't, you know, actually test your site. They're on convert because we won't accept it. Right? So, gun manufacturers, for example, any site that incites hate, or, what's the word? family values. you know, that this is often doublespeak in the U S for, you know, sending women back to the fifties.</p><p>And, Not giving people equal rights, you know, it's like, let's go, let's go back there. When everything, when America was great, you know, these kinds of things. zoos, for example, is another one that we don't, align with and this is now built into our, free trial sign up page. It's actually a lot more explicit than it used to be.</p><p>Because we don't want our awesome tool to be used for making those organizations that are. Optimized. Yeah. </p><p>Guido Jansen: [00:32:40] We don't only don't fire customers by raising prices with you, also don't hire those customers.</p><p>Morgan Legge: [00:32:46] You know, and we have had to have, yeah. Very selective. Right. I mean, the thing is, you know, before, I would say that our processes are a lot better optimized internally so that we catch these.</p><p>there have been times when we've had to have difficult conversations and say, Oh, yeah, okay. You've been testing for three months on our platform, and we only recently figured out that we don't actually want you, which is kind of an awkward conversation to have, to put it mildly. But, I think that, you know, we, we all have.</p><p>This choice in terms of how to make money. You know, we're not a nonprofit. We, we never, suggest that, even to our own employees that people work for free or anything like that. and I think that it, it falls to the conscious business mentality of really doing better and being better. And. You know, maybe there's some people who don't really care.</p><p>I don't really understand what optimization is, or AB testing music, and that's fine. But in this place where those organizations are also powerful, have deep pockets, are really trying to target micro target the audience that's going to bankroll their agendas. I think that we have a unique place to. Do something about that.</p><p>If it's not something that aligns with us and those are tough choices. Yeah. </p><p>Guido Jansen: [00:34:19] And I'm speaking of being selective and that also applies to the hiring that you, do already said, for holacracy the hiring process is really important. So I'm, I'm curious, I've read a bit about, about this, on the, on the comfort block, how you guys do hiring, but, I'd like to hear from you, how do you approach this?</p><p>How do you, stay away from having this bias in the hiring process? </p><p>Morgan Legge: [00:34:43] Yeah. Do you want to do a whole episode on this?</p><p>So I think so for anyone who's listening, who is moving to a remote center team or moving a hundred to a hundred percent remote team, I think the same holds true for them. And that is think about what's, what your values are and what's important to you. And make your applicants self select out if they are not the right fit.</p><p>It's not about getting a thousand applicants for a job. It's about getting 10 good ones. So hiring takes a lot of time and onboarding takes even more. It's really expensive and in a lot of cases, very mind numbing process. to be honest, it's a, so one of the things that we do. Because we have this, this blend of remote and Holocracy that's super important is we have this three week, we require audio, video, and written, answers to questions in the first round.</p><p>It doesn't matter if you're a developer, it doesn't matter. you know, which role you're applying for if you cannot show. Self-actualization. one of the questions is, tell me about a time that, you messed up and what you learned from it or something. It's a real soft pitch of question, right?</p><p>You'd be amazed how many people either won't or can't answer this in a way. That you'd think would show that they have like read the job description or read about convert or something like that? You know, the other video question that we asked that I think is really great for us because we are a default video on in terms of communication, two minutes to record a video of original content only and teach us something we probably don't know.</p><p>So I don't care what it is. It could be anything. It could be related to your role. It could not be. And you get some really interesting content. You know, someone wrote us a song once, someone showed us how to brew the perfect cup of coffee. someone went on a, did a tutorial on, their secret passion was continuity and movies.</p><p>And, you know, but you know, you have this kind of question. You just like, you get a real sense for how people engage in a remote environment, on things they're passionate about and how they are articulate, right? How or how they articulate themselves. Right? We don't care about the accents. or if you have like.</p><p>Superb command of English. That's actually not really important. </p><p>Guido Jansen: [00:37:41] &nbsp;This what I also found interesting to read because you're, you require this, the video and the audio, but you're also trying to eliminate bias from the process. So how on earth, if you. I mean, you can imagine, you have a bias against someone from a certain part of the world or against a certain &nbsp;language maybe or accent that someone has.</p><p>you already assume things when you were, when you hear a certain, certain acts and maybe how someone looks on video, and you want to prevent that in your heart. You guys tried to do that. So the </p><p>Morgan Legge: [00:38:13] first thing that first round, the only person who sees those three items are, it is the, like for me, for example, when I was HR check would have been me, the actual role that's being filled in the circle of marketing.</p><p>The marketing, hiring person would never see that information. As soon as these people check all the boxes for round one. Of the application process, they get anonymized. </p><p>Guido Jansen: [00:38:42] So round one would be more a general fit with the company that someone in HR could, assess. Then you move on to the actually job specific.</p><p>Morgan Legge: [00:38:53] so everyone gets a code name, you know, sometimes it's spices. I used to use trees. we've used dog breeds, but we discovered that that was actually introduced bias because people would look up what the dog breed if it was cute, not, you know, it was like, I really like, you know, the German shepherd, but it's not as cute as the Dachshund.</p><p>So, but</p><p>right. so it's, you know, so we go through those, get anonymized. We have a virtual assistant, and their job is to go through and, black out anything, any preposition. Okay. Any, reference to. company name, any location, citizenship, I mean, in every piece of collateral that they give us. It's very time consuming.</p><p>and they do an excellent job of that. Then what happens is the video and the audio recordings go through AI and they get transcribed and everything gets removed from there. So then they get passed on to the circle that's doing the hiring and they can look at the information, the other information, cause those three questions that I talked about are just part of a series of other questions that they'd be asked.</p><p>And they can then say, Oh yes. I liked the, I liked these answers to these technical questions, or, you know, whatever it is, but they actually don't know the genders, citizenship, anything for the candidate. So yeah, it's, but it gets us a diverse team, and I think that, you know, that's why we ended up with 10 times zones.</p><p>It's, you know. It's, it's also too, like I don't make the, so it kind of drives me bananas when I see these job postings that say you must be located in central European time.</p><p>Okay. If I'm willing to work that time zone, doesn't matter that I'm located there. </p><p>Guido Jansen: [00:41:07] Yeah. Even as if it's in my </p><p>Morgan Legge: [00:41:09] I'm a night owl. Maybe I PR, maybe I take care of my parent, my aging parents. And actually the shift that I would love to work is, you know, so I don't assume to make decisions for people about what is right.</p><p>You know, if I have a time zone requirement, then certainly I put that in there, but I don't care where the person lives. </p><p>Guido Jansen: [00:41:37] those are always work. Or have you had the situation where you said, okay, in hindsight, we could have known this if we hadn't blacked out all this.</p><p>I mean, obviously you don't, you don't want hundreds and hundreds of people, so you don't have a huge pool. </p><p>Morgan Legge: [00:42:00] I think that, I think that definitely some of the mistakes that I encountered at the beginning is that I didn't put a values testing early enough. So it was much more focused on skills. And then we'd realize that someone made it to round three and they actually weren't aligned with us in terms of values and vision for the company.</p><p>And then it was like I had just wasted four weeks of my time trying to get someone through pipeline. So realize that actually I'd rather take someone who's aligned, who's maybe skills are a little less, because we know that we've. It's </p><p>Guido Jansen: [00:42:41] harder to change the alignment than to upgrade the skills</p><p>Morgan Legge: [00:42:45] we're always. looking to see, you know, are they self-starters? Are they creative problem solvers? Are they goal oriented? What other people's skills? Like do they have empathy? These kinds of things, which we know. Makes good Holacracy practitioners and great remote workers.</p><p>So if you get to the end and you are missing a year of experience for something, or you know you're, you'll have a deficit somewhere. You have all, you check all those other boxes, which makes it really, really easy for you to be a great contributor rather than someone who is an information silo who doesn't play nice with other people, who has no kind of collaboration or empathy skills like that stuff in any environment, whether it's remote or not as super toxic and difficult to work with.</p><p>Who wants that right.</p><p>Guido Jansen: [00:43:45] what are the, the check boxes you need for people, to match them with Holacracy in general? What are good </p><p>Morgan Legge: [00:43:54] character trait for that? having, Certainly they, they orientation got the goal orientation, the ability to, to see details, understand concepts as well. </p><p>Guido Jansen: [00:44:08] How long does it take on average people that are not used to Holacracy, how long does it take them to to adjust or how long to get them to adjust? </p><p>Morgan Legge: [00:44:18] It's not black and white of </p><p>Guido Jansen: [00:44:20] course. </p><p>Morgan Legge: [00:44:21] There's no real answer. I mean, it's. Holocracy is a evolution. It's like a belief that, the organization of Holacracy One that runs the, the teaching and the resource center for Holocracy implementation.</p><p>We have, an evolution of Holacracy in, it's like this huge, It's a very pretty graph, which I could say to you, and it has these different stages and it's like what you see is across convert. It's like the further we get into this adoption. I see that where I thought, we were in terms of, you know, people or hiring or, process improvement, you know, and maybe I thought we were further ahead.</p><p>We're actually further back. I think that it. It changes. It's a different answer depending on, cultural background, plays a role for sure. even though we're hiring for specific traits, then it's also, we have people who, what I call our legacy members of the team who've been with the team for since the beginning and are still adapting.</p><p>To this new way of working and certainly do an excellent job. You know, there's still deficits there, right?</p><p>Guido Jansen: [00:45:44] start with, </p><p>Morgan Legge: [00:45:45] yeah, actually we do, we start with, A couple of. So the other thing that we do that I think is not just good for Holocracy and remote work, but I think it's really good for any type of a company, is that we do 90 days in the beginning, and it's very, very clear. Like it's a 90 day contract and it's an opportunity for us to try it out and both of us, it's like you can kind of think that you can.</p><p>Suck it up for 90 days, no matter what it is. If you know there's an end in sight, you know, it's like,</p><p>it's a long time, but you </p><p>Guido Jansen: [00:46:27] know there's an end, </p><p>Morgan Legge: [00:46:28] right? And you know that it's going to be done on this date. So if you really hate convert and you don't like us, it's like you can say thanks, but no thanks. And we've had people do it. and that's okay.</p><p>Guido Jansen: [00:46:43] Okay. Can you say the percentage of people that go beyond the 90 days? </p><p>Morgan Legge: [00:46:46] It's over 90. Yeah. So over 90, we actually had really hot, really high churn for people who in the beginning for, Hires, and it was pretty bad for retention and implementing all these things that I just talked to you about.</p><p>We've gone from that to over 90%. So even though this hiring process, some listeners may say, my God, that's a lot of time and investment in everything. It's like, hire slow. Yeah. Higher. Yeah, it does. It pays off. And it's like, you think about all that time that you spend and it's like, yeah, 90 days is a long time, but especially if you have, you know, a lot of this is new, right.</p><p>For a lot of people, and we don't dive super deep into Holocracy in the beginning. We kind of give them a taste of what it is and what that looks like. people get a lot of, Transparency. and no, I think that you have to make sure it's good for both parties, right? It's, I think it's, it's, it's arrogant to think that as an employer that we're great for everyone.</p><p>It's not the case.</p><p>Guido Jansen: [00:48:03] So, for, for both, the conscious business part and all Holacra. What are your, what are the things you're trying to change or improve in? </p><p>Morgan Legge: [00:48:10] The feedback loop is a big one. so more of a feedback culture. that is one thing. internally, we're actually, It's actually funny you should say that.</p><p>I just had conversation before we got on this podcast with the sales and success team, and we had a big, we're having a big shift in strategy for a Q3 and so we're looking at how we can actually get better feedback and more streamline our systems. So I guess actually it's both. but really, , yeah. More of a learning environment in terms of feedback, you know, it's a little bit, I think it's, it becomes challenging when you have a very multicultural environment because even if you have people who are entrepreneurial and goal oriented, we still have very different cultural learnings about how we accept and give feedback to each other.</p><p>And. I think that's been something that's held us back and something that I'm working on now, I actually have the role of achievement advocate, which, is the one that's going to be responsible for. Making that happen. So working, working on that, I'm working with, the lead links to think about, you know, how they have energizing calls with their circles.</p><p>Like how we, we have secretaries and facilitators who run meetings like how they are encouraging. Objections and bringing agenda items. So, you know, as a cognitive psychologist, you know, it's all about how you say it, right? So. Do you have any questions as opposed to what questions do you have? Makes a big difference.</p><p>Actually, it sounds something like something really small, but it actually makes a really big difference to the type of interaction that you get with a cross functional and cross cultural team. So small details like that. and. You know, planting seeds to, so like I've done in the last four years, five years, can't remember.</p><p>So in the next 3 to 12 months, we're focused on a couple of different areas for people of feedback internally. And. Having a stronger, more dynamic culture of feedback. And that goes to how you ask questions, whether it's, in a meeting or one-on-one too. Like you talked about in the very beginning, maybe asking for input or con, you know, consensus, you know, what that looks like.</p><p>and in multicultural team, that can be difficult. So that's one of the things that we're working on as a sales and success team. We have, shifted to a strategy of teams over tools. So in this covet environment, we've actually seen, A real uptick in, enterprises coming to look at convert to explore us as an option because we have a really robust tool, and this is.</p><p>Holacracy is actually giving us the, the, the leverage to be able to be agile in this, right? So we can change some of our processes internally on how we are flexible in taking over customers, how we can offer migrations and things like that. And then also what that process and that feedback looks like from the customer or from a developer that's using the tool so that we can be better.</p><p>Placed strategically. Right? So I think that communication and feedback is really the, the, the key component for, we're getting prepared now, but for Q three Q four and then in 2021.</p><p>Guido Jansen: [00:52:20] Morgan, we're definitely running out of time right now. So my final question for you will be, are there any books you'd like to take to our </p><p>Morgan Legge: [00:52:27] audience? Actually, there are a few that I would suggest, and I think one of my favorite books that really changed the way that I think about, teams and feedback is.</p><p>There's, there are two, so Radical Candor by Kim Scott, a really excellent book. It really challenges you to think about how you give and take feedback as a leader. The other one is Reboot by Jerry Colonna. really looking, and, and challenging leaders to work on themselves first rather than their organizations.</p><p>And how, how your, your relationship with. Power, money, authority, all these things need to be, dealt with in a way, and it will really help you be a better leader. so isn't this a very interesting setup for his book? He gives some checklists and things like this, and I would also recommend, for any teams that are listening or, You know, in agencies there, maybe you're working online now, but you're actually, you know, part co-located and part remote. there's a really good book by Lisette Sutherland who's actually based, I think in Amsterdam. it's called work together anywhere. And she talks a lot about, she does workshops and everything like that, but she wrote a really great book on how to.</p><p>Do great work in remote teams outside. So this is like fully outside of Holacracy, but really how to, and as a manager, how to make that work productively. so those are the three. My three top reads.</p><p>Perfect. </p><p>Guido Jansen: [00:54:23] Okay. Definitely add those through to the show notes. Thank you so much, Morgan. For telling us about more about, the way Holacracy and remote, working can work, in these times, and it can be very beneficial for the company and the employees, and have a nice working environments. and, to hear that, even.</p><p>Or not even, but, in times like this, I think it's a story for company that they've been doing remote for a long time. Yes. Spread the word. This is, this is normal. </p><p>Morgan Legge: [00:54:54] This kind of can, and I would just encourage your listeners to think differently about the way that they work and how they can work. You know, when we get out of crisis mentality, the kids are not going to be home.</p><p>You know, you're not going to have two people. Yeah. You know, so it's not crisis mentality. It's real remote work. This isn't real for about Laura. And I think that thinking about that and, and really, you know, scaling your organization or your business to leverage what remote work has to offer is really beneficial.</p><p>I'm really happy that you gave me the opportunity to just speak to your community.</p><p>Guido Jansen: [00:55:35] Yeah, that's, that's very true. Would you say that this is not a remote work I've been remote working for, this doesn't feel like it's for me, but especially, well, especially because of the kid from 1.5 years old now continuously being at home makes it very difficult. It's not normal. Not the normal situation.</p><p>So yeah, thank you so much. I think this is a great content for everyone interested in this, this topic. And, I think a lot of freelancers and a lot of, CRO agencies already trying, of course now they're forced, forced remote. We're already into, hiring at least a couple of people in our workforce remotely.</p><p>So think this is going to be a very interesting, thank you so much. </p><p>Morgan Legge: [00:56:19] Me too. Bye </p><p>Guido Jansen: [00:56:20] bye. And yeah, I hope to talk to you soon. Bye. Bye.</p><p>‍</p>",
  "show_notes": "<p>In this episode I talk with Morgan Legge, Director of Operations &amp; Certified Partner Outreach at our long time sponsor Convert.com. Today is not necessarily about CRO specifically, but rather about how to work together within your company. Morgan is going to tell us about the decentralized management model called Holacracy which I personally find fascinating and we end our talk talking about how this also led to Convert applying something that is called Conscious Business by for example eliminating bias in hiring and becoming carbon positive.Holacracy.org</p><ul><li><a href=\"http://GlassFrog.com\" target=\"_blank\">GlassFrog.com</a></li><li><a href=\"https://over.springest.nl/holacracy/\" target=\"_blank\">over.springest.nl/holacracy/</a> (Dutch)</li><li><a href=\"https://saasclub.io/podcast/saas-startup-failures-vulnerability-and-leadership/\" target=\"_blank\">Dennis’ interview with Omer Khan on The SaaS Podcast </a>(founder lessons)</li><li><a href=\"https://en.wikipedia.org/wiki/OKR\" target=\"_blank\">OKRs</a></li><li><a href=\"https://contentsquare.com/covid-19-ecommerce-impact-data-hub/\" target=\"_blank\">E-commerce Impact Data Hub from ContentSquare</a></li></ul>",
  "guests": [
    {
      "id": "morgan-legge",
      "name": "morgan-legge",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "https://youtu.be/Bo2w2THxAus",
  "main_image": "src/assets/images/episodes/holacracy-decentralized-management-and-organizational-governance.jpeg",
  "language": "en",
  "type": "podcast"
}