{
  "id": "how-to-become-a-better-cro-professional-with-abi-hough-and-craig-sullivan",
  "title": "How to become a better CRO professional",
  "description": "You can improve digital customer experiences, but how do you improve yourself? Abi & Craig show how to keep learning & developing as a CRO professional.",
  "date": "2025-01-09T14:36:18.242Z",
  "duration": 1888,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/cee29f00.mp3",
  "transcript_url": "<p>Guido X Jansen: [00:00:00] Hello everyone. And welcome to a CRO.CAFE session here at Digital Elite Day. I'm joined by Abi and Craig, thank you so much for joining me. And the topic we're talking about is self-development for CRO's, and how to become a better CRO Professional. And hopefully we assume you want to be better at what you do anyway, because that's a trait of CRO: we want to make things better.</p><p>So why not? Why stop at the website or customer journeys. And let's continue with this and try to improve ourselves as well. We have over 100 people joining the session. welcome everyone. if you have any questions, you can use the chat here in zoom to ask them and I'll see if I can, put them in front of Craig or Abi.</p><p>so the first question, for Craig and Abi, we all have different backgrounds and skillsets. everyone is zero. It has, because it's going to be really hard to find someone that has studied, in college. so there's no single Shiro profession, role, is not in a single defined role there.</p><p>so what overall advice can we give our listeners? to get started with zero and improving their skills. Wants to go first. </p><p>Abi Hough: [00:01:25] That sound that over to Vista Sullivan, I think. </p><p>Craig Sullivan: [00:01:27] Can you give that one to me? We did chat about their side BNI and there's both broadening and deepening your skill set.</p><p>so it's a fairly common treat, to see that really good CRO people are what. We call T-shaped and they have some tremendously fantastic specialisms stuff that they're really super bad, but they're also good or very good, a lot of other things. And it's this combination of disciplines and perspectives on too.</p><p>Designing and improving and experimenting with products that actually, fills in a lot of their sort of gaps in your knowledge. So in order to, to do this work really I think it's fairly well accepted that you need skills in multiple disciplines. You don't necessarily need to be an expert in all those disciplines.</p><p>So yeah, there are many different types of CRL people who specialize in different areas, but broadly it's about getting wider knowledge, but also deepening. Knowledge in the areas that you really enjoy and people end up specializing, not in what they think is the best, but they tend to specialized in things that either Ghouta B they're quite hard to master.</p><p>So there's a challenge involved there. and basically, so there were some incentives there for them to then study that thing more deeply. And the third thing is that they actually enjoy. Way doing it. it's no fun doing a CRO, a discipline or a specialism.</p><p>If you don't actually enjoy it, that area of work. So you have to experience a lot of various of work to learn, but you also have to experience lots of areas of work to find out what you're really passionate about. Yeah. Yeah, </p><p>Abi Hough: [00:03:11] because if you don't have the passion for the topic, then you're not going to do your best at it.</p><p>And, I think finding one thing or a couple of things that you really enjoy doing, then that kind of shines through in the work that you're outputting as well. so it's really important to find those things that float your boat, so to speak. I think. </p><p>Guido X Jansen: [00:03:31] Yeah. so hopefully you're already have this passion.</p><p>Yeah. That's going to be a hard, there's no course to develop the passion. I think, but when we, prepped for this, this session, we did. Came up with a list of at least some inherent traits that we think people should have. and then we see, see, most hero people. And these are these an errand trades are things like, bravery, passion, creativity, determination, humanity, the curiosity, and to be sociable.</p><p>and this is all in addition to the soft and hard skills that you probably can't and learn. and think the most important one is that we, defined in terms of hard skills were experiments, design analytics, psychology, and, qualitative, qualitative research. in addition, of course there are a lot of skills, like you just said, Craig, there's a T shape here.</p><p>So it, it can be a lot of skills that you combine here, like copywriting, data visualization, Most of us as some, have some basic understanding of each MLC is as how browsers work. And then there's the soft skills of communication, presentation, storytelling being user centered, caring about what users, think and how they experience things.</p><p>Craig Sullivan: [00:04:41] You see the, and there are all these, people there's maybe a prescribed pathway, but there isn't, and some of the best CRO people I've met have cross trained from other disciplines. Who've been great UX and they've got into experiments or they've been a really good visual designer, but they got into analytics.</p><p>But the things that these multiple disciplines do is no, you can start to understand why people can or can't use products, but then you can actually begin to measure the impact of that knowledge. So it's this capability to triangulate problems by having. a wide range of skill sets allows you to use more toolkits and inspect the problem from different angles and it's those angles and that perspective that make you better than somebody who's just a single discipline sort of practitioner.</p><p>Guido X Jansen: [00:05:30] Yup. And, so again, tell us a bit, maybe Abi started with you, what are the latest skills that you tried to develop? </p><p>Abi Hough: [00:05:39] You want me to be brutally honest? The latest, the skills I developed was how to homeschool and nine-year-old,</p><p>actually, I say that jokingly, but in order to teach a nine year old, six months worth of schoolwork, I have to. Do a lot of improvement in myself. For example, I had to throughout how to store retail really well. There's no point in just sitting in front of a nine year old and saying, we're going to do this today.</p><p>So yeah. How to sell it into him. So that improved my skills. So I had to learn how to make the most out of, minimal materials, everybody panicked bite. So the stuff that I needed to homeschool him. It wasn't available. So making the most out of, a limited budget or limited resources or helps to go towards optimizing.</p><p>And it sounds really odd, but. It was probably the worst six months of my entire life. I'm very glad he's now back at school, </p><p>Guido X Jansen: [00:06:44] a lot of crazy Devacy you need a lot of bravery determination, </p><p>Abi Hough: [00:06:49] the sell into probably the hardest stakeholder you'll ever have to deal with. This is a very strange year.</p><p>I'm sure for a lot of people and I wouldn't have thought I'd be saying, here's what I took away. And this is what I've been learning over the past six months, but honestly is it's opened my eyes. And the thing that I took away from it is. You can improve being a CRO, not necessarily because you're sat down doing all the things that people are telling you to do, but from an outside influence on a situation that you were put in, you can always learn to optimize that in some way.</p><p>And it's having that mindset to be able to flip a situation so that it works for you that I think really adds to making a good CRO. I don't know what you think, </p><p>Guido X Jansen: [00:07:36] right. Yeah, what's the latest skill you develop that Greg? </p><p>Craig Sullivan: [00:07:39] I had to a couple of things with lockdown again. I ended up running a plant project where I had to basically grow on, deliver, or leave for pickup.</p><p>Plants for a 659 plants to people in the local area who couldn't get them at garden centers during lockdown, or they were isolated. So I had to learn how to, forecast exactly how much yield was going to get out of the plants I would grow. So to have enough. Talk to satisfy the demand. So I ended up having until, yeah, let know all about selfless forecasting and stock planning and sewing stuff at the right time.</p><p>So I had to learn how to run like a miniature garden center or a nurse. And through that work, I also got involved with a lot of locals businesses in lockdown who had no it skills at all, and suddenly had to set out websites and get stuff running on platforms like Shopify. So I helped a few of them and that was.</p><p>Completely outside of my comfort zone, they don't have big budgets and big companies and shiny offices and you're working on a shoe string and that has to be ready today. So yeah, those were another couple of great lockdown skills. Yeah. </p><p>Guido X Jansen: [00:08:52] so a lot of opportunity and in a global pandemic.</p><p>so we just messaged a big list of skills that you need to have. or that you could at least try to develop and then you need to have some sense of. Okay, where to start, what to pick and you need the Mo after motivation and ability to do So could you guys give us some of your favorite picks or approaches to learning a new subjects and how to develop this growth mentality?</p><p>Craig Sullivan: [00:09:18] I think it's a realization that we work in such a fluid and dynamic environment that. Knowledge that you see is current right now. If you were to freeze my knowledge right now, within three months, it started to go out of date within a year. It would be horrendously out of date. So standing still, or having the same pile of knowledge after a period of time, just isn't an option it's changing too much.</p><p>And we must also learn to do things in new ways to automate things, to use machine learning tools as our friends and solving. Problems. That will be one of the challenges that we have in future. But I think there must be a realization. I cannot be an expert in all of this, and your knowledge can only be augmented as well as the network of people that, So my best piece of knowledge right now is not loads of cool stuff that helped conversion. It's knowing what I know and what other people know that I don't know. Cause I can go and ask them. So if you ask me a question, I know precisely, no, I have no idea, but I know a guy who does, and that piece of knowledge is infinitely more valuable than either trying to cram everything into my head, which is impossible or become an expert in all those areas.</p><p>So knowing the extent and boundary of your own knowledge is perhaps the ways. Piece of knowledge of all, because then you're not stepping outside that that you can leave your ego at the door and ask them or help and say, do you know what? I have no idea what to do here.</p><p>I'll go and ask. So and and they will have an answer. So that is true, really important than network of friends and compadres and people in CRO we'll determine a lot of your success. I would say. </p><p>Abi Hough: [00:11:00] Yeah, I would agree with that. And for me, it's definitely, networking and meet ups, provide the biggest benefit for me because I can't be on social media, 24 hours a day, or reading the latest podcast.</p><p>She'd burn out quicker than you can blink. but. By going to meet ups and just speaking to other people in the industry, it gives you the opportunity for them to say something like, Oh, did you hear about X, Y, and Z? And you're like, Oh no, I didn't hear about that, but I'm going to go and find out about it.</p><p>So it was just, it's like a filter that allows you to learn new techniques and theories that are coming through and what everybody else is doing. so that's a great way of doing it. And also, you can speak to people about. What's not gone right for them. You're not just hearing all the glory stories about how wonderfully somebody has done your hair in the nuts and bolts about how things didn't go so well and how they fix the problem.</p><p>And you can be aware of things to look out for yourself. So </p><p>Craig Sullivan: [00:11:55] for me, go ahead. There's all the usual things to mention, obviously like reading books, blogs, there's a lot of really great stuff on Mitcham all of the engineering and experimentation teams that very big company. &nbsp;published blogs on Mitcham, there's on the job practice, but, if you're already working in this industry, try and work with other CRO people or other companies.</p><p>Cause you'll you learn, you think, Oh, that's quite good to, I'll have to put that in too. So it's great. it's a, for another people is for stealing all our best ideas. But it's how you approach this in a matter where you can look at everything that everybody's doing and then try and actually pull out the things that really.</p><p>Help you in your specific area of work there isn't one answer. There's only you a problem, and a set of tools to inspect that problem. That's all there always is. Right? And every problem is a unique, but I would also see going and speaking and getting over your fear. I'm. Always terrified of speaking like five minutes before I'm just like car, I'm shaking, Oh, everybody thinks, Oh, that looks dead easy and he's calm and everything. No. It's quite nerve wracking. And for those of you who haven't considered, because you think it's nerve wracking. everybody else has nerve, so you're no different. Take the plunge, get a go meetups, create some material, what some other talks meet your own stuff.</p><p>And then you can practice on the circuit because becoming a speaker who was under the best things that I did, because when I started giving away my knowledge, I got so much back. I give away the more people give me an return and that's a good lesson for all. Sierra is if you all, don't your knowledge, tightly will.</p><p>It'll just. And with her, Whereas if you give away your knowledge freely, then you'll establish a huge network of people who will make your knowledge pool even bigger. </p><p>Guido X Jansen: [00:13:45] Yeah. And some people now might as, okay. Maybe I want to speak, but I don't know how to start or where to go. Abi , maybe you're a great example in this.</p><p>Your first public session was at CXL life. so how did that happen? </p><p>Abi Hough: [00:14:00] it was, I think somebody called Craig Sullivan may have just suggested I did it. Yeah. So I'd never done any public speaking at all ever. And, I'll be honest with you. The idea of a trip over to the States sounded like a really cool idea at the time.</p><p>but I was absolutely. Petrified. and CXL live massive conference within the industry. And I just said, yeah. Okay, I'll do that, but I've never done any public speaking. I was absolutely. I'm not going to say it, but I was very nervous. but I got over there on the fly and it was all fine.</p><p>But for the two days to my speaking slot, I basically wanted to come home. I was so scared, but what I did get away from that was the support of all the other speakers and the conference organizers who were absolutely amazing. given me a Lego kind of confidence. Yeah, you can do it. It's great. and I did, I got on that stage and I did my 15 minute talk.</p><p>And from the entire time I, I thought my tongue was going to drop out of my head and I didn't know what I was going to say. And it on my, I couldn't speak properly cause I didn't have any water, but the talk went really well. And I got a few laughs out of it, which is what. I wanted to achieve.</p><p>And I also got to highlight my passion, which is quality assurance and making sure stuff works right before we rolled it out. And how important that was along with checking websites for errors before you even start optimizing them and how much money you can make from that before you begin an AB testing program.</p><p>And. It's not something that I regret doing now. I was very grateful for the opportunity. I had somebody shame me to go and do it, even though it was so far out of my comfort zone. I'd have never </p><p>Craig Sullivan: [00:15:51] contemplated. We want to encourage people to go and try and do this. You'll be surprised if you do a talk.</p><p>If you get video, you write to conference, organize and say, look, I've got this really important thing to say. here's some details about it. Here's maybe a video of a talk I've done before. Even if it's one you've recorded at home, that's fine. You'll be really surprised that there will be open to sharing your idea and you won't find out unless you actually try and to get over the nervousness of public speaking.</p><p>Yeah, almost every city and every town in the world has an organization called Toastmasters or something similar. And these people's jobs are to teach you how to, do a speech at a wedding or something like that. And honestly, these guys will coach us a really good talk overview in a few weeks time.</p><p>So there's a top tip. If you want to learn how to get over that thing of public speaking, do your first thing or become even better, go to Toastmasters and get them to help you. </p><p>Abi Hough: [00:16:48] And my two top tips would be storytelling. It makes it so much easier when you're doing a presentation. And the second top tip would be, don't be afraid to, take the piss out of yourself for want of a better word, because adding humor into it makes it human.</p><p>If that makes any </p><p>Guido X Jansen: [00:17:06] sense. Now, meals, we also got a comment from anime class and, Greg pushed her to talk at super week, but everyone starts contacting a crack for four talks. You can just go to Toastmasters or go to medium.com. There are a lot of local meetups on there, or any kinds of topic.</p><p>Craig Sullivan: [00:17:25] Measure camp had a whole session. Last time we had a physical meetup that was all about on how we could encourage greater diversity in the speakers that we see at conferences. And that was fascinating. And there's a lot of things that we can all do. If we built alliances to meet that better. </p><p>Guido X Jansen: [00:17:44] I also got a question from my Elysia.</p><p>She asks on the topic of, of, speaking engagements. what, if you feel you have nothing new to say in the talk? </p><p>Craig Sullivan: [00:17:55] I think if you're curious and interested and you pick that curiosity by exposing yourself to lots of other things that people are seeing, I go along and watch talks on stuff.</p><p>That's way beyond my skill level. I'm like, and people ask me, where are you watching that stuff on? Predictive modeling, using Markov chains for I'm like, wow, it's really hard, but it makes my stuff feel rubbish. and so by exposing yourself to lots and lots of talks and interests and things that people are talking about, believe me, it will give you ideas for your talk.</p><p>Cause at some point when they're talking, you'll think, wait a minute, that isn't right. And then some loyalty to you where you have to get up and say it meaty. so it's way of tricking yourself into fight, dig a of material so that you do have something to see </p><p>Abi Hough: [00:18:41] that Mary's always, </p><p>Guido X Jansen: [00:18:43] yeah. And my way of thinking about this, there's also that, especially when you go to a conference, when there's multiple tracks, you just announced the topic and then people show up because they want to know more about this topic.</p><p>otherwise they wouldn't come. </p><p>Craig Sullivan: [00:18:55] There's a whole that runs in the U S that my friend, Michael, all guard works with. We'll try and publish the link to that for the help with coaching, a lot of, up and coming female speakers, lots of initiatives like that going on, where people are trying to, help, increase the amount of interesting stuff that we're seeing.</p><p>And it's working already long way to go. But getting better, but yeah, please, if you have something to say, or you can develop something to say, please say it, the world wants to hear it </p><p>Guido X Jansen: [00:19:26] back on the topic of, of the skills you need to develop. There's a lot of skills. We just mentioned a lot of them, a lot of ways of, of, Improving yourself speaking engagements and will be one of them, but say you come in a situation that you really want to know more about a specific skill.</p><p>Maybe it's not Mark of change, but, but maybe machine learning or you see something fancy, from a fellow, a general practitioner. You want to dive in yourself. How do you generally approach learning more about that? Would it be you just started reading courses, doing courses, doing blogs, or do you start doing speaking engagements?</p><p>Where do you, where would you start? How </p><p>Craig Sullivan: [00:20:02] would you books and courses CXL has some wonderful stuff. And, I have a course on their disclaimer, but there's a whole range of stuff. Statistics, every single angle of experimentation is probably covered in the material. So there are very specialist, one there's also.</p><p>Very good general training sites as well. We'll offer stuff. copy hackers, do some free, copywriting training on their website, which is really cool. and I highly recommend 'em, mobile coal prices, copywriting course on CX. it's very good and lots of other people think so. but books, yeah.</p><p>I've ordered myself a whole load of machine learning books and PIF and stuff recently, and I'm plowing through them and it's mightily confusing and very hard, but I'm learning some stuff. I was doing some testing for a site, so I just ordered myself. Tons and tons of machine learning books.</p><p>And they're sitting there on a pile, nagging me to read them, So I've started reading three of them. It's tough going. it's like chewing on old dry cardboard or something, but you gotta, you've got to make time and force yourself to carve out time in your life or some development because otherwise your skills are gonna atrophy.</p><p>You've got to have a certain percentage set aside. </p><p>Guido X Jansen: [00:21:18] Have you ever questioned that for you? from the chat from, Tim Stewart? of course then being Tim, it's not a single line question, but, </p><p>Abi Hough: [00:21:25] and I move, we got </p><p>Guido X Jansen: [00:21:28] Tim talks about, okay. People underestimate the non-zero skill part of, of being a CRO.</p><p>So Abi , how much would you say, how important is that? How much time do you spend developing the nuns? The non traditional zero skills? So we, we spoke about. experimentation design, psychology analytics and growth research. let's call that the arts art skills. How much should we focus on soft? </p><p>Abi Hough: [00:21:51] I think that equally as important as the other skills to be fair to you, the issue that I see is we're selling in a complicated industry to any new business, right?</p><p>some, a client who's never heard of CRO before. you have to be able to sell in the process, what the aims are. it's not just AB testing. It's a whole plethora of the elements that we're looking to optimize. So for me, having the ability to. Explain that clearly and how the process is run and what the results are, what we've done and, breaking down the silos.</p><p>So communication to me is actually one of the biggest skillsets, that you can work on in terms of a soft skill. And just realizing that the people that you're dealing with the. They are people as well. They have problems. They've got stresses. </p><p>Craig Sullivan: [00:22:43] And </p><p>Abi Hough: [00:22:44] the better that you can, the better that you can speak to a client just on the same level.</p><p>It's we're all trying to achieve the same thing. So having that awareness that the people that you're dealing with they've got their own problems and pressures and being able to relate on that basic human level. To try and get to a point where you're all trying to get to is one of the most important skills that I think is a CRO.</p><p>You can have, nobody's out to prove somebody else's better than the other person, or, my test is better than yours and your task was a fail and all this kind of thing. We're all just trying to get to one place. So if we can communicate together rather than having a competition about everything or trying to prove a point.</p><p>Craig Sullivan: [00:23:29] There's a simple, there's a simple philosophical way of thinking about this as well. We expend all this energy and time and data and research, trying to understand the visitors to this client's website. Right? Why aren't we using our CRR skills to understand. The client and their business, right? And this is the mistake.</p><p>This is the gear gap. the relationship false into common mistakes are where you just deal with one person in the company. But I bet you've never met anyone else, or the rest of the teams or any of the stakeholders. They're just invisible people. Behind this one content, are you really getting under the skin of the business?</p><p>Do you know how they work, how they tick? we have a massive kickoff checklist of 150 set of questions. We try and ask in the first couple of weeks of the client, try and get answers to, because we realize if we don't understand those then soft skills that we apply to our base on the wrong foundation.</p><p>So expand it using your CRO scale. To understand the client is just as important as the visitors to the website. and you have the skills there to figure that one out too, if you're doing the job. </p><p>Abi Hough: [00:24:45] So empathy is the word I would use. Not only for the users on the website, but for the people that you're dealing on the other side of the wall as well.</p><p>Craig Sullivan: [00:24:54] Yeah. I think my three point plan is shut the fuck up. Ask really good questions. Listen, repeat. That's it. I remember there used to be a TV series in the year. Okay. they had this guy who was a business troubleshooter and he would go in and just ask people loads of annoying questions, but the business and the stock and the lead times and cashflow and everything else.</p><p>But at the end of it, you would be able to work out. You've got a problem here. You're carrying too much stock. If you cut it by this and get this warehouse here, you get an extra million pounds of revenue, every year, right? And I always used to love those kinds of programs. It's questioning and listening that gets under the skin and gets you the information that you need to then figure out what it is.</p><p>You're optimizing. It's a business you're optimizing, not a website. So understand the business, not just the website. </p><p>Guido X Jansen: [00:25:48] Yep. Final question for both of you on, in the, a really short answer. Cause we're almost out of time. so who or what has taught you the most useful things since Euro? </p><p>Abi Hough: [00:25:58] Oh, okay. Mine will be quick.</p><p>So people, humans, any kind of human you can think of, because my view is if you observe people using a product, you're going to know how they use it, what problems they've got with it, and how they react. Interact with stuff in the real world. And it's only by observing people in their natural habitat.</p><p>If you want to put it that way, that you can figure out how you need to solve a problem. so for me, it is. The users, the end user at the end of the day. Yeah. That's the biggest influence on me because it never surprises me. In fact, I'm always surprised on a daily basis about how the general population, you something or interact with something.</p><p>And it always raises an eyebrow because I learned something new every day. And I think how on earth. Did they even think about using that in that way? Yeah. Massively affected my approach to what I do with regard to QA. That's why I'm quite good at it because their mindset is now instilled on my mindset.</p><p>So that's why I generally get a really high hit rate on. Yeah, AB tests and things, because I'm thinking like, standard user rather than CRO person. </p><p>Craig Sullivan: [00:27:15] So it's an ego thing. if you do enough experimentation. My thing that I learned was 18 months moderating use of tests in the lab, often of my own stuff.</p><p>I used to get angry, like they were being critical of my work. and once I got over that, I realized it's not about me. It's about the user interface and them, I'm there as an observer. I'm trying to figure out what's wrong with what I designed and that realization eventually is you cannot be a perfect designer, such a thing doesn't exist.</p><p>There are only users, your design and validating that it works. And then you try and plug that gap took me 18 months to learn it. But it's a really important lesson. It's not about you or your personal feelings or your colleagues' opinions or what you're. Boss thinks it's about the users and the product and the behavioral change.</p><p>And that is all amen. </p><p>Guido X Jansen: [00:28:07] If you have any questions, the last four for Greg or Abi , the zoom chat will probably close if we end the session. but as we can probably continue on Twitter as the hashtag #DigitalElite20, and we have Abi at @WTF_UX or @OptimiseOrDie for Craig.</p><p>Craig has a free audit checklist for Google analytics coming out in two, three weeks in the works for the past five years. they're gonna fix all our problems.</p><p>and we have, of course, we have an upcoming us urography podcast session with, Abi . we're still discussing the topic, but it might be something, inspired by the Netflix series on the whole everyone's striking everyone, or maybe some top reasons for QA fields. We see, we'll see what happens.</p><p>Maybe we do two or three. And if you want to, make sure to subscribe at cro.cafe/subscribe. thanks everyone. thanks for joining Abi . Thanks Craig. And I hope you enjoyed it.</p><p>‍</p>",
  "show_notes": "<ul><li>‍<a href=\"https://digitaleliteday.co.uk/\" target=\"_blank\">Digital Elite Day</a></li><li><a href=\"https://medium.com/@optimiseordie/the-ultimate-google-analytics-audit-checklist-3ca9c55644c6\" target=\"_blank\">The Ultimate Google Analytics Audit Checklist</a> by Craig</li><li>Recording of Abi's session at CXL Live 2017: <a href=\"https://www.youtube.com/watch?v=U5juWTPlWY4\" target=\"_blank\">How Do You Find $100m of Lost Revenue Without Creating an Experiment?</a></li><li><a href=\"https://www.toastmasters.org/\" target=\"_blank\">Toastmasters</a></li><li><a href=\"https://www.meetup.com\" target=\"_blank\">Meetup.com</a></li><li><a href=\"https://www.measurecamp.org/\" target=\"_blank\">Measurecamp</a></li></ul><h4>Core skillsets/traits mentioned:<br></h4><h5>Hard/technical skills</h5><ul><li>Experiment design</li><li>Analytics</li><li>Psychology</li><li>Qualitative research</li><li>Copywriting</li><li>Data-Visualisation</li><li>Same basic understanding of programming / how browsers and HTML work<br></li></ul><h5>Soft/social skills</h5><ul><li>Communication</li><li>Presentation</li><li>Storytelling</li><li>User Centred</li></ul><h5>Inherent traits:</h5><ul><li>Mentality</li><li>Bravery</li><li>Passion</li><li>Creativity</li><li>Determination</li><li>Humility</li><li>Curiosity</li><li>Sociable</li><li>…</li></ul><h4>Ways of learning &amp; resources<br></h4><h5>Ongoing/general learning</h5><ul><li>Blogs</li><li>Conferences</li><li>Medium (for Engineering teams)</li><li>On-the-job practice</li><li>Networking</li><li>Conferences &amp; Meetups</li><li>Work together with other CROs</li><li>Online forums/slack</li><li>References Guides (<a href=\"https://baymard.com/\" target=\"_blank\">Baymard Institute</a>)</li><li>Podcasts</li></ul><h5>Specific skill improvements<br></h5><ul><li>Courses</li><li>Books</li><li>Speak at a conference on a specific topic</li></ul><h5>Some good resources</h5><ul><li><a href=\"https://cxl.com/institute/\" target=\"_blank\">CXL Institute</a></li><li><a href=\"https://www.coursera.org/\" target=\"_blank\">Coursera</a></li><li><a href=\"https://copyhackers.com/\" target=\"_blank\">Copyhackers.com</a> (Copywriting)</li><li><a href=\"http://harrisonamy.com/\" target=\"_blank\">Harrisonamy.com</a> (Copywriting)</li></ul><p>‍</p>",
  "guests": [
    {
      "id": "abi-hough",
      "name": "abi-hough",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    },
    {
      "id": "craig-sullivan",
      "name": "craig-sullivan",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/how-to-become-a-better-cro-professional.jpeg",
  "language": "en",
  "type": "podcast"
}