{
  "id": "how-to-run-copy-experiments-and-why-you-should-differentiate-with-peep-laja",
  "title": "How to run copy experiments & why you should differentiate",
  "description": "In this episode we learn about the impact of copy on conversion and what things to take into account when running copy experiments.",
  "date": "2025-01-09T14:36:18.243Z",
  "duration": 2789,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/ca2e2245/f12c2c6d.mp3",
  "transcript_url": "<p>Guido: [00:00:00] Any questions before we </p><p>Peep: [00:00:01] start? can I say shit and fucking </p><p>Guido: [00:00:04] yes. Yes. Okay. As much as you like. Ben, thanks so much for joining us on this hero Fe both gas. And of course I think a lot of people will know you and probably when you search Google for zero specialists, it's your picture? That's that pops up.</p><p>but w how did you get started with this year, or you also didn't study CRO. </p><p>Peep: [00:00:25] That's great. </p><p>Guido: [00:00:26] How did you get started? How did you roll into CRO? </p><p>Peep: [00:00:30] I was on like a marketing consultant, bit of SEO, BBC, all that stuff. And then one of my clients actually handed me a book by the Eisenberg brothers, waiting for cat to bark, I think.</p><p>And that was like, Oh, that's kinda interesting. And then started Googling and they had a blog back then this is 2008 maybe. Yeah. And, a few people were writing about it. And then I was, there was an interim and marketing company, mind Valley. That's still around now they do personal development or whatever, but back then they were also writing about their split tests and were, was like make money online type of blog.</p><p>And so that's kinda how I got started. And then when I wanted to start my own marketing blog in 2011, I was just, I knew I need to niche down. I can't just write about marketing. And so I started to basically do some market research. What kind of niches of marketing are not that competitive?</p><p>Let's say. And then my analysis showed that CRO was very uncompetitive, like not very many blogs, I think in the West had a blog back then and yeah. I'm not sure if white or final hand maybe they do. And I like very few, and the articles were very basic. Yeah. Superficial and short and dumps.</p><p>Like I could, I could build something here. And so I decided to start a CRO blog and also by starting a blog, I decided to become a CRO person. And when you specialize in something, You actually start getting better at that one thing. Cause you only do that one thing. </p><p>Guido: [00:02:08] Yeah, exactly.</p><p>Yeah. And that's why, I like to go on stage and talk about chiro, especially in the beginning. I just signed up for talks about CRO, I think in 2012 or something, just sign up because I want to know more about this. And then if they pick me up, I have to actually </p><p>Peep: [00:02:25] do it. I was writing blog posts basically as an investigative journalist.</p><p>Yeah. Like I picked a topic and then I forced myself to do research. Like everything that's been written about a topic I'm going to compile it into a summary posts. That was my blogging strategy at the very start. </p><p>Guido: [00:02:44] I read that basically your blogging strategy was also, if I write an article, it has to be the best article in the world about this particular topic, right?</p><p>Peep: [00:02:52] Yeah, exactly. Yeah. because as I said, The Otter CRO blogs were not very good. And so I created looking internal standards that if I do this write long form articles, every claim backed up by data, all that stuff, then I can dominate. Then the, I did. </p><p>Guido: [00:03:07] Yeah, exactly. and for anyone, that has ever read a CXL blog post, you're very aware that they are in the long form.</p><p>There's usually not a couple of hundred words is a couple of thousand words maybe. And, as someone working in CRO and talking about copy, more than once a week, You probably heard just like I have, that's, the people say, people don't read online. </p><p>Peep: [00:03:31] It is true. They skim, we spend a lot of time looking at texts, but do we read every single word?</p><p>Typically not, but of course it depends on how interested we are in something, like if. If it's like a bunch of fine print legalees, but there's a possibility that I'm signing away my house. I'm going to read everything right? The same way. if you're actually deeply interested in the topic, you're going to read it.</p><p>But knowing that most people are not deeply interested, most people are waiting for in the line and Starbucks or whatever, then you know that they're going to skim. They're just going to just casually browse and then you need to design your copy and write your copy in a way that is suitable for. People who don't read everything.</p><p>Guido: [00:04:23] Yeah. so that didn't mean for you that you just, okay. People just skim. So let's make my articles shorter. So how did you go about that? </p><p>Peep: [00:04:32] the long article, the decision was threefold. So one was that the superficial, if your article is three to 500 words, you can't really add at depth to it. So I have to really go deep and it just, you need more words.</p><p>That's one, two back then there was data, which is still true today that if you look, which kind of blog posts get the most backlinks. SEO back links or most social media shares. It's long articles. There are very few exceptions, Seth Godin, but it's because he's a celebrity, he can write, 100 word articles, but everybody else, I still true today that you need to write long articles to get back links.</p><p>Because again, when other people write their blog posts and they want to link to a source, that's reputable. They look at your longest blog posts. Hey, this seems, dance, this one, </p><p>Guido: [00:05:25] I haven't read it, but it's very long. So it's probably better for my personal brand if I share a long, because it's not as much </p><p>Peep: [00:05:31] interesting people might think that they actually read it.</p><p>Guido: [00:05:35] Yeah, exactly. So what would you say, in general, if you would compare, copy to all the other elements on a page, w what is the impact of copy? how important is. Copy. if we're just skimming and </p><p>Peep: [00:05:49] totally, it really depends on what is, what is the brand, those Apple doesn't need too much copy, even though if you look at your sales pages, they add quite a bit.</p><p>but visual brands, obviously, if it's squishy handbags or whatever, they need less words. But for a lot of, I would say majority of the products, it is the copy that sells them. So anything that is expensive, anything that is complicated, your B2B software or, anything that is not that visual needs a lot of copies.</p><p>So at CSL Institute, for instance, so we have, we sell online courses and we have like more than 50 each course has their own sales page. Then we have PPC landing pages and webinar landing pages, and these are all. Copy heavy. it's like mostly words, minimalistic design, which is like our visual brand is minimalistic design.</p><p>And so we learned very quickly that in order to increase the conversion rate on those pages, we need to make the words better. We need to improve the copy. so for us copies like 90%. If, and in general, like if a couple of years ago, I think, yeah, 2018 or something, we built our own CXL AB test physically library, looking back at all the tests, we've run it over the years.</p><p>And what was it that, What was the test about, what, and we were basically trying to figure out what kind of tests proved to be winners nutshell. Most of the winning tests were copy focused, not like a meal or 2000 word rewrite, but like adjusting wording here, the better headline, better button copy better.</p><p>Presentation better value proposition, things like that. So copy is huge. And obviously there's the Unbounce stat that came out from there. I don't remember how many thousands of landing pages, that they found that copy predicts copy is two times more influential than design. I think copy predicts.</p><p>28% of the conversion rate versus design was like 13 or </p><p>Guido: [00:07:56] something. Yeah. and how do you go about finding where the copy, is well up for improvement? Because I feel for me personally, that it's, not necessarily a black hole, but it's very difficult to find out where a copy is lacking.</p><p>Because if you go to Google index, it's not going to tell you, where are, where your copy, needs. For a lot of research or heat maps. I can figure out where stuff is broken in general. but finding out it's where a copy is broken, how to improve it. That's very hard, not a lot of tests are designed to do that.</p><p>So how would I, what would be your tip for people to go out? How do you go about finding out. </p><p>Peep: [00:08:31] I won't say to it's, it's a lot like any type of conversion research. Let's say that we just look at the website and we're going to see how can we make it better? No. If the website is not very optimized, it's like crappy design and then has typos and you don't know what they're talking about.</p><p>It's very easy to say, Hey, make it more clearer. You know what this is about, and you need to improve this design and this and that way. But if you're, if you have above average design and copy. It's very hard to eyeball it. So what you have now is that you need to do research. You need to do conversion research, quantitative qualitative, to understand what the problems are.</p><p>And so optimizing copy is very much the same, unless it's really obviously terrible. And you can see, Hey, I don't understand what this is about. You need to do research to understand what is wrong with it. the conversion heuristics, like where we need to improve, the clarity is very applicable to copy.</p><p>If I don't understand what this is about, I'm not going to buy. So you rate the clarity, you, and So copy testing is the methodology. It's also the SAS tool that we built the launch this year, which is exactly what it does. Is it asks questions, research questions about copy from the audience that, the, website is intended for essentially to understand where the sources of friction, because, in behavioral design, In order to increase the conversion research, sorry.</p><p>In order to increase conversions, you need to increase motivation and lower friction. In a nutshell. Yeah. So in the copy is same way. what can we do to make it more persuasive and what can we do to make, reduce friction? And how do you find out, we'll ask the people, how do they feel about it?</p><p>Do they feel it's clear? Do they feel that these argument is speaking to them? And so on </p><p>Guido: [00:10:31] and, you with copy testing.com. You're obviously you're collecting, more and more input. Not only for your own site builds a four, four copy doesn't, the clients. So what do you see, is usually the issue with a copy is it's not phrased, right?</p><p>There's is it confusing? is it like, off-brands it doesn't, it's not matching with the overall brand perception? What are the issues that you see. </p><p>Peep: [00:10:53] I would say that, the most common issues is still clarity. As I already mentioned, clarity's people tend to be super vague and especially considers in B2B copy where they, companies all often use big words, fancy words.</p><p>That sound nice, but actually they're not saying anything, like we're, using the. Latest AI technology to improve conversions. And then it was like, what does that actually mean? </p><p>Guido: [00:11:23] what technology? Yeah. </p><p>Peep: [00:11:24] Yeah. what are you actually doing there? And, And is it the Navy, like you don't actually understand so </p><p>Guido: [00:11:30] AI or machine learning, or is that what </p><p>Peep: [00:11:33] Andy and I, and what does, is the Navy testing tool or whatever, so clarity is a big issue.</p><p>Guido: [00:11:38] and so does that mean that people need to be more specific? is that usually the resolution for that </p><p>Peep: [00:11:43] more specific as well as use language that you would actually use? In a conversation with fellow human being. </p><p>Guido: [00:11:53] So people, give you the data. Okay. We want to, want to have this evaluate it.</p><p>Where are the problems usually? is it the headlines? Is it like product descriptions, call to actions? What are people saying? What are people visiting sites usually stumble upon? </p><p>Peep: [00:12:08] I think there are two, two, two, two types of issues that we, that'd be fine. And one is That I call copy blind spots.</p><p>Copy blind spots is that you write all these things about your product or service people read through the whole thing and they still don't get it. They still have questions. So in a normal situation, in a normal, in the physical world, I go to the shop. There's a sales person. I can ask questions.</p><p>There's a back and forth. Online copies all you have. So if your copy doesn't answer every single question a prospect might have, it's, you're losing out on money, but often when you've writing, when you know the product so well, and you're writing the copy about your product, you forget what it's like to be somebody who doesn't know this product.</p><p>So you, you don't mention every single thing. And some people don't come to the site, they read it. They're like, Oh, I don't know, does it do this? Does it do that? And you don't, you're not going to call. You're not gonna File a support ticket and ask, maybe if there's live chat on the website that can quickly sort out.</p><p>But if it's a chat bot and chat bots are usually idiots, like you just abandoned them purchase. there are two studies that I've seen on this where Norman Nielsen had a study saying that, 20% of purchases are abandoned. Because of, poor copying, complete copy and IDC, a market research company, you looked at a bunch of B2B websites and said, even 50% of purchases are abandoned because they don't contain the full information.</p><p>People read it and they still have questions. So copy testing will tell you where your blind spots are, which is huge too, is that people have objections. Like you say something, you claim something and they're like, Oh, I don't know about that. And so unless you figure out what is it that they have, like a problem with, so here's an example.</p><p>There's this company called supply. They make, razorblades and no, the Gillette Mach three has three or four blades, like the mainstream brand that's a, and supply has a single blade, a razor, and a lot of people had. Questions that I don't believe a single blade can actually be as good and their copy.</p><p>They didn't really spend too much time explaining why a single blade is better or like why prefer single blade? And another thing was this, supply blade is $75 compared to, there's a dollar shave club, So 75 bucks is a very expensive non-electric. Razor and people had all kinds of issues with it, all kinds of problems.</p><p>And the copy on the website did not address any single thing. So people come they're like, Oh, what is this made of? Like, where is it made? Is it made in China or America? Or, like all kinds of things. And, if you don't know what the, what problems people have and you have a problem. </p><p>Guido: [00:15:10] Yeah.</p><p>so the copy itself might still be fine, but you're still leaving questions. Unanswered </p><p>Peep: [00:15:15] questions answered and you don't handle objections and online, like in a sales situation, you can, like they say, Oh, I don't know about that or whatever. Then you can say, actually it is so good, blah, blah, blah.</p><p>Because all these things online, you have to preempt, the objection is coming. And so you have to write about it, like address it. yeah. Yeah. Cause that's your only chance. </p><p>Guido: [00:15:42] The most obvious example of this popping up in research was, on a website where, and there's actually, it was more like a, also a cultural thing where we saw that when we tested the websites, specifically with Germans, They always, almost always runs through the terms and conditions page that happened.</p><p>Nowhere when the Germans went through the terms and conditions page to look up for the questions that were on an answer it's a, in the </p><p>Peep: [00:16:08] corporate and delivery </p><p>Guido: [00:16:10] exactly delivery. And okay. if I'm, if I want to return the product, what happened? </p><p>Peep: [00:16:14] Oh yeah. </p><p>Guido: [00:16:15] And not that interested in doing that </p><p>Peep: [00:16:17] and all the roses cut the executive at 22 centimeters.</p><p>Guido: [00:16:21] Exactly. That's what they were interested in. And that's something we didn't see in other countries, but still it's, adding that information, for non Germans already had an impact. Also had a positive impact on conversion because we didn't see that behavior, but those people apparently still had those questions.</p><p>so yeah, it might, it will be. That's your website, at least with Germans. </p><p>Peep: [00:16:40] Totally. Yeah. whoever you're selling to, so the way you want to conduct copy testing is, sometimes it matter who the, sometimes you sell mass market products. So basically anybody could be your audience.</p><p>And if you're selling pants, like everybody wears pants. maybe unless your pants are like ridiculous or very expensive. </p><p>Guido: [00:17:00] with everyone working from home these days, maybe less people </p><p>Peep: [00:17:04] might be, but basically the way you conduct copy testing to think about their audience, then you need to recruit them from somewhere.</p><p>if it's mass market, it's easier. If it's more specialized, the beautiful thing about, the internet is. You can go to Facebook groups that are interest based. These are all people who want to lose weight or these people into yoga or whatever. And if yoga people are your audience, you can say, Hey, would you please come?</p><p>May, read my website and leave, answer some questions about it. And then I'll pay them on is like user testing works similar fashion or with B2B audiences. Of course it's trickier because if your copy is about. organic traffic, the can't be just anybody. In fact, we tested this, we had a client who was a, I think a Dutch company who, a service for organic traffic, AI, something, and which we had, regular people read it and also research questions.</p><p>And then they were like, what else? like the daily car traffic have to do with organic food. Like they didn't get it. And before B2B audiences to context like who's reading, it really matters. And so that gets trickier. And so with copied testing.com, our service, we have realized that, delivering B2B audiences is actually some, it's an unsolved problem.</p><p>It's a big problem. so our, the future of the product is actually, like we're getting it dedicating a lot of resources to solving. Delivering B2B audiences. </p><p>Guido: [00:18:35] Yeah. Yeah, because I can imagine that you guys already building your own audiences to test this. But I can imagine that for a lot of companies it's relevant to actually be able to basically give you a list of their audience.</p><p>Totally email addresses too. </p><p>Peep: [00:18:49] Exactly. So using your own panel, my work and your own email list, people, the problem with that is that if they're already familiar with you and your service, There's a bias in there. They don't have all the questions, they know how your stuff works. So they're not actually the best audience to read your web copy and give you data on it, insights on it.</p><p>So you want actually people who have never heard of you. Who are like, skeptical about chat? </p><p>Guido: [00:19:15] depends a bit on what you want ultimately, if it's a B2B environments where people do on the reorder stuff, then that might also be very relevant to just validate it with your existing audience.</p><p>Peep: [00:19:25] it could be, yeah. Yeah. With CXL and copied testing and there's a symbiosis. So we have, some hundred and twenty-five thousand people in the CXL newsletter. database. And so we are recruiting our B2B panel from the CXL email list. So we have a, it's mainly marketers.</p><p>So we have a very strong marketing panel. So any title you want, SEO director, brand people. you name it. We have, yeah. That's easy. security warehouse managers, not so much. </p><p>Guido: [00:19:57] Exactly. That's a bigger challenge and what I want to know. So what are the things when, when running experiments on copy, when we're validating copy, are there any particular things to take into account there versus.</p><p>regular or more visual, copy. I think it's, to me it feels usually it's a bit easier. every tool that can be, quite some things, quite a lot of things that go wrong, different browsers, different, devices of course, copy always feels a bit relatively easier. </p><p>Peep: [00:20:25] Totally. I think you could even set up a test with Wiziwig editors, Yeah. not nothing much difficult there. The problem, One challenge with changing copies. if you think the changing one word will make a big difference, it usually doesn't cause it's a small change. And since people mostly don't read the scam, they might not even notice that you changed a couple words.</p><p>Although I have a seen a very particular case, for CXL, itself where a single word made a huge difference. So I've wrote. So our CXO brand, like we're taking this a hostile brand approach. We were running a lot of ads saying like it's too difficult to CX elicited content and like need to work hard.</p><p>It's not easy. So we're &nbsp;selling it or, and so I've wrote a version of the CXL Institute. Copy that post very much, like over the top, this is too difficult. You're not good enough for this. You're going to fail. You're probably loser. And so I'll use this word bad-ass in the copy.</p><p>I was like, Oh, it takes a real bad-ass to actually go through this. And I didn't think twice about this word. And then when I looked at the results of the copy test, I was floored. So out of 20 people that we tested it on, which is, a good sample for a qualitative, assessment, probably out of 20 people, like 16 had a problem with it.</p><p>They're like singled out this one word. I was like, wow, I even forgot I wrote it. But like they noticed as one word. If it's possible, the one word can trigger. And obviously if it's the headline or a button copy that is more isolated from the rest of the copy, it can have an impact. Yeah. yeah. </p><p>Guido: [00:22:08] Yeah.</p><p>It's surprising sometimes how a single element can infuriate people. I had a similar thing with people seeing, w all my only gift store e-commerce, gifting where people have to fill in the phone number of the person they're sending the gift to. Oh, yeah. Mandatory fields, no explanation. And people really got pissed off about like it's it's, I don't have it because why should you, it's a surprise.</p><p>So why are you going to call this person what's happening? </p><p>Peep: [00:22:35] Why are you going to </p><p>Guido: [00:22:36] spend them to really got pissed off? So it's funny to see how small things, things that you didn't think twice about, can take off, people. Do you have, so what I also wanted to talk about, we just talked a lot about, about the copy.</p><p>you've written a book about differentiation, right? </p><p>Peep: [00:22:53] I haven't written about it. I've written the book so far. I only have a blog post, but I started to write a book about differentiation. I started to write one, this last winter and then COVID hit and suddenly. It, it didn't seem relevant anymore somehow at a time, so I left it and, now the time has passed and I guess we're all used to the new normal, I think we're past, like in, at, in the spring times, March, April, there was a lot of anxiety and like what's going to happen now.</p><p>We know it's going to be like this for another year or something. He knows. And yeah, I do intend to pick it up. I have a little bit changed the direction of where I'm taking the book. So basically strategy differentiation and branding. It's like a Holy Trinity. They all play. To get her and affect each other.</p><p>And so I do a lot of reading and thinking about this and, yeah, </p><p>Guido: [00:23:48] but when I read about it's a while your tweets or blogs about this, there seems to be there's a fairly, a lot of frustration almost with. With how, brands approach this and go for sameness all the time or don't differentiate enough.</p><p>So I was wondering, where does this come from? how do you look at this and what are brands doing wrong basically? </p><p>Peep: [00:24:12] I don't know exactly how it all came to be, but if you look at competing companies in basically any mature category, They're all saying the exact same thing about themselves as if they were the only one in the world doing that thing, and size is an easy one to pick on.</p><p>Or if, especially, if we look at super saturated categories, like EMA marketing, they all say, Oh, easy to send in an easy to use email marketing or send beautiful newsletter. One email marketing software, doesn't send newsletters and you can, yeah. It's just baffles me. </p><p>Guido: [00:24:51] We'll do a research and just block out the logos, and just ask people which brand is they won't be able to say that </p><p>Peep: [00:24:59] basically.</p><p>Exactly. And then I tried hard to find. A brand that is truly differentiated in, in SAS. And so I asked a lot of people and often people came back to me and say, Oh yeah, MailChimp. They are really differentiated. And so if you go to MailChimp's website, like everything they say is plain vanilla, something that anybody could say, especially now they're all in one tool even.</p><p>but of course, what is different about MailChimp is that MailChimp is the market leader. They're the biggest. Email marketing, software out there now. there's this really great book, called how brands grow. It's nothing about branding, actually. It's just some marketing studies and it makes an eloquent case where that awareness or market penetration matters way more than differentiation.</p><p>So the fact that people know that you exist. You become part of their consideration set, especially in like in B2B, because when I'm deciding which email marketing software to use, I only consider maybe four or five different ones. And there's a most certainly tools that I have heard of. Yeah. So once you have passed that hurdle, people have heard about you, they know that you exist.</p><p>Differentiation matters much less. So MailChimp doesn't need to be different. Others need to be different from MailChimp. It's the same way. let's say new AB testing software comes out tomorrow. And if it's exactly optimize their VWO or, then it's why would I ever consider this new tool?</p><p>And if, or if it's just like Google optimize. Again, </p><p>Guido: [00:26:43] why would I bother? Yeah, </p><p>Peep: [00:26:44] I would. I bought her with this new tool and this tool is dead on arrival. You cannot come to the market as an unknown, as an upstart in a mature market, and think you can grab some market share. maybe if you spend a lot of money, like it has happened in the CRM category where monday.com came.</p><p>no CRM. This is project management. So monday.com. I don't know how many billions spent on ads or like millions. but like they, I think they bought their way into awareness. So I think it's totally possible, but most of us don't have that kind of money and still, there are no guarantees that, you can buy your way into it know without just burning the money.</p><p>So as a small company, you definitely want to have. Differentiating angles, same with phones, like we have something phones, Apple phones and whatever. If you're an upstart phone making company, like they all use the same Snapdragon, stuff inside. So like why would I use this new brand?</p><p>Unless you are considered a bit cheaper? and you can do that sustainably or, </p><p>Guido: [00:27:51] I think that's great. I think it's, that's our animate, it's a TedTalk and they explain, why companies, that are similar always are in the same location, the physical location. So it's like a car sales dealers.</p><p>Why are they always next to each other? Wouldn't it make way more sense. just to spread out, and they explain, what actually works for them. so we'll be in the same, same location and that's, talking about physical space, but I think the similar, trends, is happening with online.</p><p>It's it benefits those companies that are established already, to become more similar, seminars, I guess </p><p>Peep: [00:28:26] probably cause, let's say how B2B software purchasing works is that. you look at the superficial like features, let's take a drift versus in our car. So they used to have some differentiation.</p><p>Now, if we look at their feature set, basically it's identical. The only thing that's different is the brand and how they positioned themselves. And the drift has changed their strategic narrative even twice now. And I think it's because of the competitor benchmarking, why the sameness occurs is you always look at, how is that competitor different or better than you are.</p><p>And if they have that feature, we're going to have that feature too, which is why the features can never be a sustainable source of, differentiation. And as B2B buyers, they gonna, they're gonna make like a matrix of Oh, how are they different than if they're not different than. then it's about sales negotiation or exactly how all those things </p><p>Guido: [00:29:25] you were at, some books on branding and differentiation.</p><p>I th I think you even said, actually most books are not on about differentiation at all. so what would be a good, is there a book that, that stood out for you on differentiation? </p><p>Peep: [00:29:39] All right. there's actually, there are very few books out there. the classic, differentiate or die. I think that's still a good one.</p><p>Yeah, I like that one. and today basically, if I had to say what is a one sustainable competitive advantage you can have or differentiation is its brand. there's a book called different by a young me moon. And that's about how you can differentiate through brand. that's a good one that I can recommend, but otherwise there's surprisingly little written about differentiation.</p><p>it's it's like a, an afterthought really. And if, and it shows because if you look at, categories, whatever business category is, like companies is so similar, especially like my favorite example is hotels. It's every single hotel has the same type of chicken process.</p><p>And then you go to the room, they having the bathroom to have the same stuff, to have the soap and the shampoo and a shower cap, but no toothpaste, no toothbrush. why. Yeah, why are they all like that? It's because they copy each other. So it would be very easy to just be the anti-pattern, Exceed the expectation. what can a hotel chicken look like if everything was possible and everything is possible? I think, there's some low hanging fruits there. </p><p>Guido: [00:31:09] Yeah. and so branding is, for established companies. branding is the only thing basically that's left, to differentiate them right.</p><p>but for startups, you say you up that's, where your opportunity is if you want to, basically, attack the established order. so one of the things that they should differentiate or our artist specific areas, that are especially effective or, </p><p>Peep: [00:31:31] there is like a laundry list of things.</p><p>There is the, if you're a startup, you can be the first one doing something like, say, copy testing.com is the only tool for this thing. It's not going to be like that forever. like there are going to be copycats and other things. but there is a first to market. advantage that you can ride on for a while.</p><p>you can be the innovator, in a space also like Tesla cars, Tesla used to be the electric car company. Now, of course, every car company is producing electric cars and soon their batteries will be. Same as Tesla. So unless Tesla can play, the innovators came and be always two steps ahead.</p><p>remains to be seen if over 10 years they can keep that up. But, yeah, so that is a way. And then, you can specialize for a specific target market. So you'd say invoicing for, a heavy metal bands, of course there needs to be enough market there to support you, or you can, attribute leadership.</p><p>So attribute leadership basically is that you doubled down for one. Use-case or your Bezar better at some aspect like Zappos, which Amazon bought many years ago, they were known for customer service or WP engine used to be known for super fast WordPress hosting. Now of course, very competitive space, but I think the WP engine still owns that in, In people's minds that positioning.</p><p>So you choose one of the attributes that you want to be, best at. So if I work to build a new AB testing tool, know what attributes could you, Double down on like the best code editor or I don't know, probably not enough, like you need to think about it. so that's, or you make your products in a special way.</p><p>old beer is made like this, but we make the beer that way, there's something different about it. yeah. And of course, customer experience, like customer experience is like brand. Anybody could differentiate on. on experience. </p><p>Guido: [00:33:37] Yeah. And I think, especially in B2B there's there are way more chances to do that.</p><p>companies being treated </p><p>Peep: [00:33:43] well. even in plane services, imagine a plumbing service, cause plumbing is a commodity, like so many plumbers. But what if the way they answer the phone or send you reminders and like you could go above and beyond, like you could really differentiate and when you call there, they could have something going on.</p><p>that is like super VIP service, </p><p>Guido: [00:34:05] Yeah, everything is a subscription these days, so maybe there's a subscription for plumbing and, but it's hard to sustain. It's easy to copy those kinds of things. </p><p>Peep: [00:34:15] Yeah. if it's successful, it will most certainly be copied. there is advantage of being first.</p><p>There's a lot of, examples of being the original, Coca-Cola the original Cola. and so on. but, execution of obviously what are you able to execute on that vision? Because we also know, a lot of cases where first ones faded away, social networks or whatever.</p><p>Of course </p><p>Guido: [00:34:36] we have a lot of guests here in this urography. do you have any maybe clients or people in the industry that you think, we should have on the show? Who should we invite? </p><p>Peep: [00:34:44] Let's see, let me think about the names that I actually follow myself. what would be a good perspective is, cause I think see a row, is still in many organizations, CMS. Insignificant tactical. It doesn't get enough attention, compared to sales or, like something that's really important to big. So it would be interesting to have, maybe even like a panel, like type of thing with some big company, somebody who's has optimist, experimentation built in as a thing and some, or I have a back and forth, as SaaS leader that I greatly admire and follow is, Jason Lemkin.</p><p>He has done SaaStr conference. so hit, he doesn't probably have anything to say about conversion optimization per se. But, it's an interesting business guy. </p><p>Guido: [00:35:39] if you can connect me with him, then that will be a, that would be great that we can ask him, for, to show. And you said zero is often not seen as important as sales.</p><p>I think everyone will agree with that a bit. Why do you think that is? </p><p>Peep: [00:35:55] Yeah, I think there are some narratives about a CRO that have that really stuck with people where. the, your classic, this is the button copy thing, quartet, color testing. And so there's small things have really got into a way of people taking it seriously.</p><p>we need, we </p><p>Guido: [00:36:17] need CRS on the </p><p>Peep: [00:36:17] bigger things for sure. optimism, experiment, cause lean startup as a concept is exp experimentation, right? Yeah. Build measure, learn. we're doing the same thing you say they had the better story and they're talking about it in a bigger scale, like finding whether what you sell is that somebody want to pay for it.</p><p>So maybe see a role. People have also chosen, a smaller battleground, And maybe, maybe, we've been talking about, should we be called something else for a decade, right? Yeah. I think there's still something to it where if it's like the word growth hacking, that you say growth, hacking people, roll their eyes.</p><p>and it started off. Meaning one thing. And then now it's a crypto jerk, it's the same guy as the growth hacker, it's, they're auditory term, more than anything. So maybe it's also like we need to like growth engineering all has a positive spin to it.</p><p>So maybe there's maybe there are, the experimentation, I think has a positive connotation to it. and also when, see a row now with the rise of rev ops, it's, chief revenue officer. maybe it should be called experimentation </p><p>Guido: [00:37:31] term, validation, experimentation still, if, as that's a, for people, expectation also feels somehow has a as a, like a random connotation, like people think, okay, we just do we experiment.</p><p>We just. Try random stuff, because </p><p>Peep: [00:37:46] that's </p><p>Guido: [00:37:46] also not what it is. yeah, it's definitely an interesting discussion on probably something we'll continue doing for the next 10 years. how should we brand ourselves? </p><p>Peep: [00:37:53] Exactly. While still think conversion rate optimization. Yeah.</p><p>Guido: [00:37:57] Exactly. but thank you so much for joining me on the podcast. my final question for you would actually be at something, I at least look forward to each year as the state of conversion optimization report that you guys ever do. Can we expect expected this year too? it's a weird year, of course, </p><p>Peep: [00:38:12] but I think so, I'm not in charge of writing it or doing the research, but usually we ship it, like first week of December or so I think we're going to do it.</p><p>Good. </p><p>Guido: [00:38:24] if the survey is still open, we'll we'll add a link through the, to it's in the show notes of the podcast. Some people can, can sign up, or if the survey is not open yet, but we can just link to the reports directly. We'll do that. Thank you so much. And, yeah, I'll talk to you soon.</p><p>Peep: [00:38:38] Thank you for having me </p><p>Guido: [00:38:39] have a great day. Bye-bye.</p><p>‍</p>",
  "show_notes": "<ul><li><a href=\"https://www.copytesting.com/\">Copytesting.com</a>‍</li><li>TED talk: <a href=\"https://www.youtube.com/watch?v=jILgxeNBK_8\" target=\"_blank\">Why do competitors open their stores next to one another</a></li><li><a href=\"https://www.youtube.com/watch?v=jILgxeNBK_8\" target=\"_blank\">‍</a><a href=\"https://cxl.com/blog/differentiation-strategy/?fbclid=IwAR1So5DLJgLlH2MNelfP1Nvrm1PJFbpA-BsVLvtweUuIPZ8MZ1Y9k48dqpM\" target=\"_blank\">Peep's blog on differentiatio</a></li><li><a href=\"https://cxl.com/blog/differentiation-strategy/?fbclid=IwAR1So5DLJgLlH2MNelfP1Nvrm1PJFbpA-BsVLvtweUuIPZ8MZ1Y9k48dqpM\" target=\"_blank\">‍</a><a href=\"https://twitter.com/jasonlk\" target=\"_blank\">Jason Lemkin&nbsp;</a></li><li>CXL <a href=\"https://conversionxl.typeform.com/to/CIeV4Uuw\" target=\"_blank\">State of Optimization Industry 2020 Survey</a></li></ul>",
  "guests": [
    {
      "id": "peep-laja",
      "name": "peep-laja",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "https://youtu.be/vTdKIcNxrfo",
  "main_image": "src/assets/images/episodes/how-to-run-copy-experiments-and-why-you-should-differentiate.jpeg",
  "language": "en",
  "type": "podcast"
}