{
  "id": "how-gvc-gaming-reshaped-marketing-budgets-for-all-brands-after-implementing-optimization-techniques",
  "title": "How GVC Gaming reshaped marketing budgets for all brands after implementing optimization techniques",
  "description": "We learn how one of the largest gaming brand has implemented robust marketing measurement & optimization techniques that completely changed marketing budgets",
  "date": "2025-01-08T20:07:07.493Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/6eb00151.mp3",
  "transcript_url": "<p>Guido X Jansen: [00:00:00] Welcome. We have Chris Lee and John Dawson. </p><p>John Dawson: [00:00:04] Welcome. Um, </p><p>Guido X Jansen: [00:00:06] first off, uh, um, I'll ask you to introduce yourself who wants to go first? </p><p>John Dawson: [00:00:11] Chris? </p><p>Chris Lee: [00:00:11] I'll go first. I I'm, uh, Chris me on the head of marketing effectiveness or GVC GBC is one of the world's largest sports betting and gaming. Okay. </p><p>John Dawson: [00:00:22] And I'm John Dawson. I'm the managing director of scam Marcie QBD.</p><p>So we're based over here in Utrecht. And I've been working with Chris at GVC for the past five years to help them build their team and build their capability. </p><p>Guido X Jansen: [00:00:34] Yeah. And Chris, you did a talk this morning, um, a workshop or talk </p><p>John Dawson: [00:00:40] and workshop, workshop, </p><p>Guido X Jansen: [00:00:42] workshop. I think the empty out one of the world's largest gaming companies improve the odds of marketing success.</p><p>So tell me, what was it about. </p><p>Chris Lee: [00:00:51] So as a, as an organization, we spend about half a billion euros every year marketing our, uh, different brands. Yeah. Uh, in the UK, across Europe, uh, S uh, South America in terms of, uh, Brazil, Australia, and yeah, that's, uh, it's a lot of money to invest. And so as an organization, what we want to do first and foremost, understand is what is that delivery in terms of value?</p><p>To us as a, an organization in terms of money, bottom line revenue, but also, you know, can we spend that more effectively? Uh, are we, are we over saturating in certain channels? So do we do too much TV advertising relative to, uh, too much display online display advertising? </p><p>Guido X Jansen: [00:01:40] Yep. And, um, um, well, to me it comes to mind a famous quote.</p><p>I think it was this attribute to Coca-Cola that most of your marketing. When he spends, </p><p>John Dawson: [00:01:52] lots of people have had that achievements. </p><p>Chris Lee: [00:01:55] John Wanamaker, </p><p>John Dawson: [00:01:56] I believe is one of them want </p><p>Chris Lee: [00:01:58] to make a half of my marketing dollars. I believe he said was wasted just to know which half. Exactly. And that's, you know? Yeah, we do.</p><p>It's actually not as simple as that. So, um, But it's less than half it's, less than half I think. Yeah. Yeah. I think my CFO would, uh, have a bit of a fit if you knew that 250 million euros were being wasted. Uh, so it's not a case of brilliant that that is wasted. It's just inefficiently targeted. So it's making sure that your you're not, uh, you're targeting your funds.</p><p>So it's in there is where you're going to get the better return. Versus something else. So, I mean, if you've seen a TV commercial five times, do you need to see six, seven, eight times? Probably not. You've already got the message and therefore, you know, reinforcement of the brand through the channels. Um, whether it's, you know, if you're on a website and you see a banner, uh, or you're driving your car, you see a billboard where you're listening to the radio, then maybe that's more effectively spending those channels rather than.</p><p>Uh, halftime when I act are five Nyla, but yeah. So, </p><p>Guido X Jansen: [00:03:12] so the workshop was mainly about sharing your experience. </p><p>Chris Lee: [00:03:14] Yeah. Sharing the experience about how we've done that. So, uh, we started off, um, uh, how </p><p>long </p><p>Bart van der Meer: [00:03:21] ago? </p><p>Chris Lee: [00:03:22] So we started in 2016, so we're into our fifth year now. So we didn't, uh, we ha we had an effectiveness capability, but we, it wasn't best in class.</p><p>And it had these deficiencies. So, uh, we re we, we sell a program of work. We focus it on focused on three UK brands, our main three UK brands, which is laboratory coral and gala bingo. Um, we've served as godly, uh, consolidators, that program of work automated. It makes sure that we're getting to the answer quicker.</p><p>Uh, and then we were acquired by GVC in. Uh, uh, 20, 2018 and now we've expanded it to the full portfolio. Uh, so it's, uh, it's an ongoing program of work. It's not something that will stop, uh, but it's embedded it's in the organization. You know, we are regularly chatting to different stakeholders, not just marketing, but finance operations, uh, our partners, our media agency, our suppliers, like, uh, &nbsp;um, To, to keep it, to keep it moving forward and, and, and, uh, evolving.</p><p>Um, that's the thing. It's, once you've got the answer, you want something different and something new. And so it's, what is that evolution? Um, and that's where the &nbsp;come in, come to the fall. </p><p>John Dawson: [00:04:53] So I think one thing to add to that, Chris is you talk about marketing effectiveness. But the, the scope of the analysis you do covers promotions covers other business drivers events.</p><p>It's a much broader business driver analysis, I guess, that you actually perform. So, although the optimization is very much on the marketing side and increasing the values on the marketing side, you help the business understand a hell of a lot more than, than the advertising impacts. You help them understand different events.</p><p>What's the likely impact of this event next year and these kinds of promotional plans. So it, it goes deep and it goes very broad. </p><p>Chris Lee: [00:05:31] Yeah. Yeah, it does. I think the, you know, we're all, uh, well I personally, I say I used to, I don't gamble, uh, if for a gambling company and I don't gamble. Uh, but that's not, that's not because I see money </p><p>John Dawson: [00:05:48] make </p><p>Chris Lee: [00:05:48] money.</p><p>Uh, No, I never have to know. It's never been a, it's not been something that's, uh, that, that appeals to me, but I'm a sports fanatic. So, you know, every, every other summer there's a football tournament, whether it's the euros this year, world cup in two years' time in Qatar, uh, you know, those are big events.</p><p>And so actually in this sanding, You know, walk what just natural demand that's going to deliver, uh, or whether it's the champions league final. And then again, that's really, those are, that's an important one. Uh, but that's the sports betting side. There's the whole casino online casino, whether that's slots, whether that's, uh, poker, black, Jack, uh, Bakker at, uh, yeah, you can play, you can now play live a live game of poker.</p><p>If you want to with a dealer. There's a creepier there sat across on the table or Nora virtual, the Nora Navitar satchel. Uh, it is an actual croupier, uh, and you can gamble, uh, and people like that, you know, and that's, you know, knock the cow and, uh, Las Vegas have been around for a long, long time. This is just an extension of entertainment and that's where it is people that people like to gamble.</p><p>Guido X Jansen: [00:07:08] I'm always fascinated by, so my I'm, I may have a background in psychology and I also, uh, I don't gamble. Uh, but we, of course the Vegas is a very popular spot for, for conferences. So a yearly, you have a conference over there. I'm fascinated by how those buildings are set up to keep everyone in to keep everyone happy to keep everyone gambling.</p><p>Chris Lee: [00:07:29] You say you don't gamble, but do you play the lottery? No. No. Okay. You dug down </p><p>John Dawson: [00:07:34] say movies, you just, but you're right. It's, it's, it's so many experiments, natural experiments. And this industry in particular is there's just an enormous amount of data experimentation, uh, done in the right way. You know, that can tell you an awful lot of things about people, how they behave.</p><p>Um, you just gotta be doing it in the right way. Yeah. So, </p><p>Guido X Jansen: [00:07:56] do you know, what kind of companies joined you for the workshop this morning? What was what's kind of, </p><p>Chris Lee: [00:08:02] uh, he </p><p>John Dawson: [00:08:03] was too early. Everyone was, yes, they did. So coming in at the last minute, I know, I, I know we had a local companies. I think we have people from other parts of Europe as well in there from the people I spoke to both advertisers, themselves, brand owners of research agencies.</p><p>So there's a, there's a really good mix here, actually with </p><p>Guido X Jansen: [00:08:23] different companies. And then what did you get? Kind of, uh, certain questions from the audience, what kind of </p><p>Chris Lee: [00:08:30] information we run out of time? So, uh, I mean, one question was, how do you know, how do you do this? Uh, </p><p>Bart van der Meer: [00:08:37] what, where do you even start? </p><p>Chris Lee: [00:08:39] Where do you start?</p><p>John Dawson: [00:08:40] So, </p><p>Chris Lee: [00:08:42] yeah. Yeah, voodoo. </p><p>Bart van der Meer: [00:08:44] It can, can seem overwhelming, especially if you don't have anything like you had a few years ago. Like, how do you start measuring anything at all? And then actually using that to improve things. </p><p>Chris Lee: [00:08:56] It shouldn't be surprising because we are in the data age, but the data's there. Uh, some of it is hard to get or harder to get.</p><p>Uh, but most of it is, is now captured a standard. You, you know, um, you did, you don't realize that it probably is, but, um, visually everything that we do as, as. Individuals is captured in some form, uh, well, in, in, in some sort of form, you know, we know this is, um, you know, how many people are watching TV at any one point in time, how many people are doing it on a dual screen, um, versus how many people are online searching for the different brands.</p><p>So, although information is there, it's, it's being able to then capture all of that. I'm bringing you together and say, well, what relationships can I see? And if I can't see those relationships, that helps me quantify. And if I can quantify, I can therefore optimize, how </p><p>Guido X Jansen: [00:09:56] big is the team doing </p><p>Chris Lee: [00:09:57] this? So the team is, so there are, we're a mixture actually.</p><p>So we're a mixture of internal and external. So internally we are seven at the moment, uh, externally we've probably got about the same number of people. So, uh, and those, those are from our partners. So we're not scared of doing is actually using outside parties. You could build this yourself, but if you're going to build it yourself, you're going to have to have a much larger workforce because people leave, people become sick.</p><p>Um, but you still have deadlines to hit. So, uh, it's actually a better model to have a hybrid where you've got part of it internally. Cause then you get to witness field CA see here. What's happening with the organization, uh, and then meld that with the expertise and technical expertise that you get from a supplier like, uh, Scott, Rudy, </p><p>John Dawson: [00:10:51] can I, I mean, I think just going back to the question about how do we do this actually at the right at the beginning, you talked about this in your talk today, you broke it down into four elements.</p><p>You know, you talked about what are the business processes we need to influence, not just one of the current processes, but what could the processes be if we had more insights. What data you actually had available? You did an awful lot of work around data pipelines and the practical stuff. Uh, we supplied the tools and we, we helped all of these elements scammer, but specifically we supplied some tools that really help you get insights out of the data quickly.</p><p>And then the training, I think you trained people internally, how to do things. You also train people internally how to interpret and how to take actions. From the insights that you, you were able to provide. So when they come be confident about things and actually when there was some uncertainty, see, I think you were pretty open with saying, you have to understand.</p><p>And of course this is one industry that understands risk, right. Explicitly understands risks. So I think you have a great opportunity there. So yeah, it's process data tools and people. In that, and those are the four things that we set up as a program and have developed and evolved over time. Yeah. I'm interested in it.</p><p>So, </p><p>Guido X Jansen: [00:12:08] um, uh, we both were both work in digital marketing. Um, um, I personally work in optimization, either running experiments, running AB tests. And what does he at a lot of companies, uh, and, and you name it, those four elements. We see a very, um, well, I would say at this balance in investments, a lot of a lot goes into tools.</p><p>It's apparently very easy to buy tools a was really hard or apparently it doesn't happen, uh, to invest in people and the knowledge buildup. Uh </p><p>John Dawson: [00:12:38] how's that well, can I say something to the cause as a tools provider, right? We make tools, those tools don't land. If the people can't use it. Exactly. So, yeah, it's actually on us to provide the resources, to provide the learning.</p><p>We S we provide you online e-learning certification, but. And miles aside, you know, there's no substitute for being in the same room and actually taking people through this and it's a learning process. So I think from, from our side, we absolutely recognize that I think what we had was a client who was prepared to.</p><p>Uh, and, and acknowledged and understood that this was really important and it does take time. Yeah. Uh, they want one thing this industry has, is, and if you look at financial services and telcos, you got the same thing, you've got data literate people, and you had a lot of data list for people. What was maybe lacking was how do we communicate some of this stuff?</p><p>How do we take the most advantage of it? </p><p>Chris Lee: [00:13:38] Yeah, it is. I think, uh, If you think back to your school days, you know, you ask anybody, you know, what was the worst subject that you stood at? And everyone got maths, everyone hated maths. It was like the lesson that everyone wanted to try and avoid other than the geeks as it were.</p><p>So, um, so what, I mean, a good, a good practitioner will try and actually, um, Dismiss some of the myths around it, because it is complex. You know, some of the mathematics is complex, but you don't need to know that as a market here, you don't need to know that I've used a nonlinear transformation on a certain variable.</p><p>Um, you know, what you're interested in is that for every Euro that I've invested that you get, and then I'm getting a Euro 20 back in terms of investments. </p><p>Guido X Jansen: [00:14:37] I used to be able to interpret what the tool, whatever the </p><p>Chris Lee: [00:14:40] tools. </p><p>John Dawson: [00:14:41] Yeah. But that's also, you know, the tools themselves need to demystify things a bit.</p><p>There's um, Uh, I don't know if you guys have it here. We have, uh, in the UK we have the magic circle, right? So magicians have to keep all these things secret. How do you do the call tricks? It all has to be a big secret. If you reveal the secret, you get thrown out of the institution. And there's a bit of that, I think at the analytical community, God, if we tell these people how we really do it, right, you can't really tell them what the methods are.</p><p>I think you should have a, I think you actually have to have a, uh, uh, a state of mind that says there's no black box here. If you can't. See inside. If you can't trust it, if you don't understand where it's coming from, you're not going to use it. So again, it's, we have to demystify, uh, we have to try and use plain language, simple language, and people will put it towards them.</p><p>If it's going to benefit them, they're going to put it towards them and they'll get value from it. Um, it's when they don't know what they're doing when they don't know why they're doing something, they're just pushing a button. Doesn't work. </p><p>Chris Lee: [00:15:42] No. </p><p>Bart van der Meer: [00:15:43] Yeah, my, my experience is actually, uh, more, more, like you said that it's not that people that they can't understand, but most of them just don't really care.</p><p>They just want to know what did you learn and how do we apply </p><p>John Dawson: [00:15:55] this? Tell me what to do. </p><p>Bart van der Meer: [00:15:57] Yeah, exactly. Black </p><p>John Dawson: [00:15:58] box black box marketing, right? Yeah. It doesn't work. </p><p>Bart van der Meer: [00:16:00] Nope. But, but, but, but most people who are not into the analytics, like maybe we are, tend to think that way, like, all right. I just want to know what, what I need to do next.</p><p>Chris Lee: [00:16:11] It's funny. You should say that because the, uh, I've tried first presented to our CEO at the time. Uh, yeah, after the meeting, he told me to go inside. He goes, Chris, what should I do? Um, and he, you know, he wasn't interested in the math. He just was interested in now, what do I do differently? And, uh, I said, well, these are the results.</p><p>This is why he says we've ever spent in this area. So we need to pull back. And there's an opportunity in this area. Um, and it was very simple, you know, and he didn't need it. You know, he didn't need to know the complex math. We, we used to actually get to the answer and for him, that was fine. He could then, uh, empower his CFO so they can go, go.</p><p>And actually, yeah, it was cute. </p><p>John Dawson: [00:16:56] Was that, was that shock, Chris? </p><p>Chris Lee: [00:16:59] It was the formation, very famous </p><p>John Dawson: [00:17:00] chart we showed today. </p><p>Chris Lee: [00:17:03] Uh, yeah, so it. What we did was, uh, it's your typical pitch layout that your manager, your football manager would use with a little, uh, circular desks till you've got your goalkeeper, your defense, your midfield, and, uh, your attack.</p><p>And so, uh, we use that analogy because again, he was a big sports person, um, around, well, what are your. What w who's your midfield, who is your midfield? And the midfield for us is it's our TV advertising. It's our print advertising our radio, all of that above the line communication. That's your zip powerhouse?</p><p>That's you're the one that generates your demand of starts feeding all of the balls forward. Either out to the wings where we have, um, our partners in terms of our affiliates. Or to your center forward the center forward being branded PPC, branded search. So when you're going to Google and type in a brand, you know, you want that brand to be the number one brand that's up on the list.</p><p>And so, but that's really not. That's just providing a purpose. It's your star striker. It's your Christian Christiana, Rinaldo, or Lionel Messi. You feed them the ball and the ball is being fed by your TV, your midfield, and they'll stick it away every time. But you still need the, your defense. You need your CRM activity.</p><p>You need your bonus, your promotions, the things that really defend your brand against attack. </p><p>Guido X Jansen: [00:18:37] That's a good strategy. Just figure out the sports. A analogy that you should use or whatever sports, the person you're talking to likes then. </p><p>Chris Lee: [00:18:45] Yeah. Thankfully he was, he was a folk, you know, he liked, he liked his football, so yeah, where it's suddenly like water polo and then good heavens </p><p>John Dawson: [00:18:57] in the communications.</p><p>Right. You've been a communications game. Our audience wants to be communicated to efficiently and effectively. And that was brilliant example. I thought </p><p>Chris Lee: [00:19:06] of taking something simple. Yeah, taking something complex and, um, presenting it in a very simple, but easy to understand, uh, fashion, uh, and that worked and really worked for him well, so, </p><p>Bart van der Meer: [00:19:18] and what are the most interesting or most noticeable things you've, you've come across in the last few years?</p><p>Things you might, maybe you didn't </p><p>John Dawson: [00:19:26] expect or, um, </p><p>Bart van der Meer: [00:19:29] something you had to present in a football analogy, </p><p>Chris Lee: [00:19:32] football analogy. I think, uh, Well, there's no analogy to this. Um, but what is w what it certainly has shown us is how much of our marketing is having an effect on our existing customer base. So the marketing of dominance has been seen, we're seen as an acquisition tool thing to get people into the brand, through the door, as it were the virtual door, because we were looking at this sentence of a digital digital brands, uh, But actually quantifying that probably 40% of our return is coming from our existing customers.</p><p>And, you know, you think, well, actually when you step back, I think, yeah. Actually stands to reason. You know, we are, you know, they, that they're going to be influenced just as much as a new customer to reengage age with the brand. Uh, sorry. That's a big, I mean, that's been, that's been huge for us, uh, but also because.</p><p>Some channels have more of an influence on our existing customer base. Um, and that has helped re rebalanced the view of what marketing does, um, </p><p>Bart van der Meer: [00:20:44] which channels might be specifically useful. </p><p>Chris Lee: [00:20:48] Yeah. Yeah. It's your, I mean, your mass communication channels. So a mass communication being TV and print. Um, </p><p>Guido X Jansen: [00:20:54] I see there's a lot of companies that, that marketing is getting is getting confused with sales.</p><p>A lot of marketing teams have sales targets while that doesn't necessarily. </p><p>Chris Lee: [00:21:04] Yeah. That's where we are. Even our market is at sales targets in terms of number of new newly acquired customers. So </p><p>Guido X Jansen: [00:21:13] focused on new customers. </p><p>Chris Lee: [00:21:14] Yeah. I mean, that's massively important if you don't acquire customers in the long run, you'll have no customers.</p><p>So it still is. It's still is important. Uh, </p><p>Guido X Jansen: [00:21:24] But not the sole thing </p><p>John Dawson: [00:21:25] yeah. To focus </p><p>Chris Lee: [00:21:26] on. Yeah. Yeah. But, but then, you know, you will, if you're just focused on acquisition, you'll focus on the channels which drive acquisition. And that doesn't necessarily mean that you will drive your brand in the long run, because what we want to be is we want to be here in five, 10, 15, 20 years.</p><p>You know, everyone, everyone wants to, to maintain, uh, maintain a brand, but also grow a brand. Uh, and so it's been important for that. So, </p><p>John Dawson: [00:21:57] yeah. And you did, you know, that longterm view is something that guys very much consider. It's not just the short term ism because actually on the acquisition only basis, you probably are short term.</p><p>You're going to under invest by understanding those broader context. The fear of course, doing these exercises is always it's been done for the accounts. This is how we cut the budget is how we put money to the bottom line. Very often when you do these things, you realize that the value we're undervaluing, some of these activities, actually yes, there might be a case to invest more or maybe invest differently as well, even, you know, things that are surprising, traditional channels still work.</p><p>Yeah. Um, it's not always popular. And the interesting thing, you know, a lot of marketers make the mistake of thinking their customers are like them. There's a, there's a really famous chart that shows, you know, if you go around media agencies and they say, where do people consume media? How do they consume it?</p><p>Media, media, people, media planners, generally get this completely wrong. They under yeah. Estimate what the real population does. So, yeah. Um, the great thing about data is it it's data is generally, uh, an independent, unbiased source. And that's, that's one of the reasons you look at the data </p><p>Guido X Jansen: [00:23:09] you don't, if you don't have the data, my most popular department to go through for feedback is customer service.</p><p>Yeah, </p><p>John Dawson: [00:23:14] yeah, yeah, yeah. That's true. </p><p>Guido X Jansen: [00:23:16] Yeah. They usually have a pretty good idea about what, the things that are going wrong, or at least </p><p>Bart van der Meer: [00:23:21] what Christmas what's going wrong as sales. Usually he </p><p>John Dawson: [00:23:24] knows what </p><p>Chris Lee: [00:23:24] works. So if you go to those </p><p>John Dawson: [00:23:26] too, </p><p>Chris Lee: [00:23:26] yeah. </p><p>Guido X Jansen: [00:23:29] Uh, thank you so much for coming here. Uh, any, any else, any specific topics, uh, at the conference today or tomorrow that you look forward to learning more about</p><p>John Dawson: [00:23:44] sustainability is going on, but we've, we've missed that one. I don't know. </p><p>Chris Lee: [00:23:48] I feel like I've seen the VR machine, so, ah, I haven't seen a VR </p><p>Guido X Jansen: [00:23:52] machine yet </p><p>Chris Lee: [00:23:53] down there. Um, that's good. </p><p>Guido X Jansen: [00:23:56] Yeah, that was my lunch break. </p><p>Chris Lee: [00:23:57] Yeah. Well my would be selling law. It's got a, an Oculus for Christmas, so, uh, that's really cool by the way.</p><p>John Dawson: [00:24:06] That's nice. Yeah. </p><p>Bart van der Meer: [00:24:08] The speaker, before you told us about a talk, that's coming up about the &nbsp;museum and how they, um, optimized it for, uh, where people look. So they did research on where do people look, what kind of paintings and are long, and they optimize the museum. For debt. So that </p><p>John Dawson: [00:24:26] might be interesting.</p><p>Yeah. Very cool. Very cool. There's some really good stuff on programs. So looking forward to it. Yeah. </p><p>Guido X Jansen: [00:24:33] A final question. Is your presentation available online or will be </p><p>Chris Lee: [00:24:36] yes, it will be </p><p>John Dawson: [00:24:37] perfect. Yeah, </p><p>Guido X Jansen: [00:24:38] we can link to that in the show notes. </p><p>Chris Lee: [00:24:40] Okay. Cool. </p><p>Guido X Jansen: [00:24:42] Thank you so much and have a good day. </p><p>Chris Lee: [00:24:43] Thanks you too. Thank you.</p><p>Bye bye.</p><p>‍</p>",
  "show_notes": "<p>GVC – the owner of some of the largest gaming brands around the world – has been on a mission to improve marketing payback across all brands. In this talk, Chris Lee – Global Head of Marketing Analytics, will explain how the company has successfully created a marketing analysis function to be proud of. Operating across many markets and brands, the team has implemented robust marketing measurement and optimization techniques that deliver significant performance benefits and have changed the shape of marketing budgets across the group. We’ll showcase parts of the solution to demonstrate how decision making is aided and discuss the broader vision they have for marketing measurement.</p><p>John is a co-founder of ScanmarQED and leads our UK office. He started his career in the media agency world before moving to Accenture as a founding member of their marketing sciences team (now Accenture Interactive). He has worked with Fortune 500 clients all around the world to establish new marketing measurement and optimization solutions that help marketers get more value from their budgets.</p><ul><li><a href=\"https://gvc-plc.com/\" target=\"_blank\">GVC&nbsp;Holdings</a></li><li><a href=\"https://www.scanmarqed.com/\" target=\"_blank\">ScanmarQED</a></li></ul>",
  "guests": [
    {
      "id": "john-dawson",
      "name": "john-dawson",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "https://youtu.be/Pn7eMgHAkBg",
  "main_image": "src/assets/images/episodes/how-gvc-gaming-reshaped-marketing-budgets-for-all-brands-after-implementing-optimization-techniques.jpeg",
  "language": "en",
  "type": "podcast"
}