{
  "id": "how-you-can-motivate-your-organization-to-adopt-cro-with-ruben-de-boer-online-dialogue",
  "title": "How you can motivate your organization to adopt CRO",
  "description": "Learn about the ways you can motivate your team and organization to adopt CRO, whether you're just starting out or already have an ongoing CRO program.",
  "date": "2025-01-09T14:36:18.242Z",
  "duration": 2411,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/8a2f930a.mp3",
  "transcript_url": "<p>Guido: [00:01:22] Welcome to season two, episode 29 at Rubin. Welcome back to the cafe. And for those that missed the first Dutch episode with you, can you give us a short introduction of your journey into CRO? </p><p>Ruben: [00:01:33] Yeah, thanks for inviting me again. you know, always a pleasure to be here. so my name is Ruben . I work as a conversion manager, at the online dialogue, CRO consultancy.</p><p>And, I've been doing this, CRO for over 10 years now. I love the combination of psychology data making impact, but also helping people and organizations in CRO. I've been working as the CRO manager here since September last year. Before that I was the head of CRO and UX Sanama, which is one of the biggest publishing companies in Northern Europe.</p><p>Guido: [00:02:06] So you switched from client side to agency side. </p><p>Ruben: [00:02:09] I switched to agency sites. </p><p>Guido: [00:02:10] Yes, I'm experienced now </p><p>Ruben: [00:02:15] actually very good because, a lot of diversity, a lot of smart colleagues from which I can learn even more again. And I have the opportunity to help more organizations and, helping and, making people enthusiastic for experimentation and validation is something that, is one of my biggest passions and it gives me energy and I love joy.</p><p>So. Good. Good to hear. Yeah. I hear a </p><p>Guido: [00:02:36] trigger for this podcast or prompt if we a, wants to say in a BJ Fokker terminology. Well, your article on LinkedIn. Yeah. and we'll link to that in the show notes, with the title out to motivate your organization to adopt CRO. And one of the lines in that is that, what was your trigger to, to ride that and, your experience with, doing this with, with multiple companies.</p><p>is that you say we need a thousand times more focused on, organizational change thousand times. That's a lot of Ruben. Tell us why. </p><p>Ruben: [00:03:09] Oh, of course. A thousand times it's not evidence or fact based. What I try to make clear with the line </p><p>Guido: [00:03:15] is this could be 999 times. </p><p>Ruben: [00:03:17] Exactly. It's something around that number.</p><p>Now, what I tried to try to say with that line is that. We as CRO specialist, we need a lot more focused on motivating the organization and really setting the stage for experimentation and validation. we know so much as CRO specialist, we know that over 75% of the releases on websites, results in a notebook verse changes or even hurts conversions.</p><p>we know what's your own maturity. It looks like we read about it in blogs and presentations who knew our linked in. Does it have booking? Does it. Microsoft other great companies, but still I see so many CRO specialists and teams struggle within organizations. They're somewhere in the corner, in the back of the, of the organization doing their AB tests, but not really motivating the organization to depth the mindsets and the depth of the culture of experimentation and validation and to be successful in our line of work.</p><p>I think that is vital for us. </p><p>Guido: [00:04:13] No, so basically there's this weird gap between what we work on with the websites. And how we work with the organizations that we work with it. </p><p>Ruben: [00:04:22] Yes, indeed. And, I think it's, it's, it should be part of our jobs. And a big part of our job is to teach the organization and to change that culture and the mindset of organization, but it's hard and it's very hard, but as CRO specialist, we already know quite a lot about it.</p><p>Actually, </p><p>Guido: [00:04:38] we should be able to do this. </p><p>Ruben: [00:04:39] Exactly. We know a lot. We know we have the mindset, we, we know how to change behavior because he did constantly and daily on our websites. now we need to use that knowledge and use that in our organization. </p><p>Guido: [00:04:50] And in your blog post, you mentioned you created a small model, to do this and, partially based on also including a system one versus system two, to implement this.</p><p>So how can, how can we use system one system two to do, to help us do this, with an organism? </p><p>Ruben: [00:05:06] Well, actually system one, assistant two is of course where, where the struggle begins, for the listeners who. When I was familiar with it's a system. One is our primal brain, our, our, our brain. We have, for many years already, it's our instincts, our reflexes.</p><p>And it's the strongest part of the brain rule thumps at 95% of our decisions and choices are made with system one system two is our rational brain and it is the brain. It can reason it can think in past present and future. It can think if I go to the gym now and keep it up four or four months to come next summer, I'll have a six pack.</p><p>A matter of saying, but this is system one system two is where the struggle begins a cost, system two knows what's good for us and what we should do, but system one is not, is more focused, is only focused on the present. so for instance, we want to go to the gym. you have this plan in your head.</p><p>If you go to the gym three times a week, I'll get fit, for well-trained body. but when the time comes, when you have to go to the gym, you started with that conversation in your head. Well, you know, it's good for yourself to go to gym, but it's raining or the bear stays pretty nice or yeah. Already </p><p>Guido: [00:06:12] cycled to work.</p><p>So basically our already did some exercise. </p><p>Ruben: [00:06:15] Exactly. So, so behavioral change often feels okay. Cause it could be because system two doesn't know how to change. It doesn't know what to do. It could be the system. One is not motivated enough. it's more motivated in the here and now to do something else.</p><p>And most of the times it's a struggle between the two systems </p><p>Guido: [00:06:32] and basically the system one also wants to preserve energy, right? And that's, that's in those thousands of years revolution, that's what it's, trains and learn to do. There's not enough food, should be careful with that. It should be very careful at what I spend my energy on specifically with exercise.</p><p>That's it's usually hard to do. It takes a lot of energy. </p><p>Ruben: [00:06:53] Yeah. Why should I do that now? Exactly. And that's also a, what I've mentioned in my blog posts, which we referred to it. There was a research that was really shocking to me is that even in life and death situations, we have a really hard time to change.</p><p>And that's because of its struggle, </p><p>Guido: [00:07:09] an example from a former medical field, with people being diagnosed with a terminal illness that could be fixed by changing their lives. </p><p>Ruben: [00:07:17] Yes, exactly. It's it's patients with clots arteries and it's, that's a serious condition. It's really. Painful and scarred starts getting more painful when it results in an early and painful death.</p><p>which is horrible. It's absolutely horrible. but a doctor said that people can, get rid of the pain and gain, have a healthy life and grow old. If they change their lifestyles though starts, starts doing more sports, stop overeating, stop smoking stuff, alcohol, less stress, and more relaxation in their lives.</p><p>Yeah, so live a healthier lifestyle. And if those patients do that, almost everyone can survive. but research shows that only 10% survives. It's a very liberal change is dead heart at evening life and death situations. we are horrible at changing and it should make us think because we as zero specialists and data analysts want to change the mindset way of working and the culture of an organization though.</p><p>In order to realize that it's something you should take serious and therefore the line we should spend 10,000 times more. At time on organizational change, </p><p>Guido: [00:08:21] usually buying something online or trying to change an organization into doing more experiments. This doesn't really sound like a life or death situation.</p><p>So the score will probably be even worse than just 10% converting to actually do it. </p><p>Ruben: [00:08:36] Exactly. Exactly. So it is, it's a hard challenge and, but it is fight all four for our success as a. As CRO specialist and data analyst. </p><p>Guido: [00:08:44] And you're a model, are you a, you talk about basically three elements, three parcel form where you can implement changes.</p><p>That's the physical environment, social environment and rewards. so can you take us through those, let's start with the physical environment. What can we do there? Yeah. </p><p>Ruben: [00:09:00] fiscal farm is of course, very well explained in the book nudge. we can change behavior for tweaks in the, in the physical environment.</p><p>So in a, in my, in a conference presentation, which I gave a couple of weeks ago, I gave the example of something I did with, within the company. I worked at five, six years ago and I was the first year a specialist there. And, I had to set up experimentation, work and process within the company.</p><p>There was just one problem. The company wasn't even data-driven yet. But they had a huge amount of data. So what I did, the tweaking fiscal environment, I got a monitor and it placed it at a spot at the entrance of the company. And everyone had to pass it Andrews, at least six times. You have to pass it to go from one side to the office, the other side.</p><p>And you go to toilet. When you go to the cafeteria, when you leave the office and I placed a monitored air with a live Google analytics dashboard. So. Then it's three advantages. First of all, you see data at least six times a day. Yeah. And because it's a life, their sports, these numbers flesh because they update constantly and what flashes draws extra attention.</p><p>Second, there were different product teams and product owners who were responsible parts of the website. So I showed the page views or at each of those sections on the website. So I created some sort of internal competition because if you will, faster data screen and you see that you get the most space shoes, of course you would start bragging about it and teasing yours, your colleagues a little bit about it.</p><p>So it was a fiscal tweak with, with a social component to it. The third one, it was the first, the third advantage was perhaps the biggest one is that visitors also saw this dashboard. And then we get the nice bias that if we enter company and we see data being shared, we automatically assume that the whole company is data driven.</p><p>So all the meetings with Facebook there started with visitors, notifying that we are so data driven, including the, the meetings of the board of directors. So the board of directors possibly heard several times a day. Wow. It's so cool. How your organization is so data driven and that you share data with placing a monitor and at a spot where everyone sees it.</p><p>As to tweaking the fiscal environment, which resulted in people being more data driven and making it easier for me to set up for rate optimization, </p><p>Guido: [00:11:14] marketing merges have suffered, and the Sharon for AB testing has been impacted too. If you want to keep that thing to enterprise standards, but safe, 80% on your annual contract, you can consider comfort, but there are similar release you can take advantage of full stack and hybrid features, strong privacy compliance, no blink.</p><p>And enterprise great security feel good about your smart business decision in Fest, what you saved back your CRO check out the www adult's overbook slash 22. That's basically you start at the end with the showing the notch grasses, and hopefully one will become more than I did. I have a similar experience, although I did.</p><p>Get some backlash in the sense that, well, you can just, you can just start doing this without even having a perfect data because the monitor also incentivize people. So to think about, Hey, but this, this data point it's not correct. Or it's not actually showing the real value that we should be open to mind or something like that.</p><p>Thank you. Okay. Yeah. That is true. We know this, but we don't have this data yet. So let's do something about that. So it can spark a conversation, but it can also be a bit tricky that people think there are, they're more data driven, more, more data capable than they actually are. Yes. So you see them feed them using numbers that, and they use that in certain ways that.</p><p>Well, I've, I've, I've sat at many presentations, I think. Okay. You're using data, but that's not actually what the data is saying. </p><p>Ruben: [00:12:50] No, exactly. I fully agree. </p><p>Guido: [00:12:52] Love like your creative interpretation of the data, but </p><p>Ruben: [00:12:56] no, I fully agree. And I think, Marianne from a two group set as well. And in this podcast, you have to, you have to be careful with, with, what kind of data you show.</p><p>But, but, even if they use the wrong data, they do use data. It's the same as, yeah. </p><p>Guido: [00:13:09] It's a starting point. </p><p>Ruben: [00:13:10] Yeah, exactly. It's just, it's the same. Do you, do you try to change an organization? You, you get resistance and resistance. Isn't good, but it's still involvement. Yeah. So it has to start somewhere. But coming back to that, I think we have to use that experimentation mindset in our organizations, within change management, there are a lot of models.</p><p>like I said, Marty on his express stage was excellent. He showed the six steps. We know the eight steps from John Cutler, which is a very famous book from mid nineties. but it works different than every organization. These steps are basically actually it's expert opinion and best practices. And from our AB tests, we know that's not that doesn't result in a most winner, so we should use difference.</p><p>Tweaks and methods and seeing our organization would work if desperate works for your organization, use that. If it doesn't try something else, </p><p>Guido: [00:13:59] maybe it's an email, a daily email you need to send out or </p><p>Ruben: [00:14:02] exactly, exactly, or have a host of competition on which test one and half the F a, if the charts hanging somewhere in the office so that everyone sees it, display the science of a B test and that people with both States on which, which will win.</p><p>you can think of several reasons that to tweak the fiscal requirements, but. Do experiment and, through, see what, what resonates the organization, what works in your organization? What it doesn't </p><p>Guido: [00:14:26] exactly. And just get started, right? I mean, I think people like us tend to be a bit careful in this and that's okay.</p><p>But the data isn't perfect. Jazz. Yeah. Or we can run with both can, I'll be a proper AB test that we can run within the organization. We have, we have physical constraints or we can also split the mem and proper groups or something. but just try these things. You'll, you'll see. Yeah. How things pan out then, and hopefully, the change is big enough that you can see a result without having the actual numbers.</p><p>It's significance to show that </p><p>Ruben: [00:15:02] I, I totally agree with that. We, we, I mean, when you have to experiment to see what works in your organization, right? What doesn't, but some things, will most likely work are proven as well by, by science. And I'm one of those it's it's you need to find proof. Yeah. I mean, if you cannot prove that they beat testing works for your organization, then you can mention that that LinkedIn does it and Microsoft does it, but will not resonate.</p><p>so if you're a one man army. A one, one zero specialist organization just start doing as many of the tests as you can learn to code if you're too dependent on development. Yeah. Because you can use that as a proof at works. And again, you can play nice games. You can show it in presentations. You can make people guess which test won.</p><p>but proof definitely is one of the things that will work and you need. Changed organization. </p><p>Guido: [00:15:49] Yeah. And then, like I said, just, just things like a dashboard or something like that, showing them, the current status of things do do spark conversation and then a bit of, hopefully a fun, fun, yeah.</p><p>Exercise or, or challenges between the teams. as I see what the numbers are from the other. Team, that does work </p><p>Ruben: [00:16:13] out. Yeah. As we mentioned, do a test experiment. What she show, what daddy is show. I mean, it might be different from higher management compared to your direct colleagues and that as well for higher management.</p><p>If, if, if your management is, if the salary is dependent on 95% on bonuses, For instance. Yeah. They probably want to see more business cases and winning tests and a percentage of revenue of conversion revenue uplift. Whereas maybe if they are not. So the on bonuses, and this is just an example of maybe wanting to be more involved within the experimentation process.</p><p>Yeah. Maybe you have to test the idea. So it works for every organization, but, but like we said, we should spend more time with it and do gets targeted as soon as possible </p><p>Guido: [00:16:56] and sort of, sort of physical, like for environment, try to try to, change things there and then social environments, I think we dipped into it a little bit already, but </p><p>Ruben: [00:17:04] yeah.</p><p>Yeah, of course. as as mentioned block, am I in my presentation, social environment is also something we of course know from our work as, as conversion specialists, We we've seen our AB test. We've seen it on, on many websites, rev, ratings reviews, testimonials, they changed the behavior of people.</p><p>so do think about how you can use that within your organization. get the people who are enthusiastic together and host brainstorms together, have for lunch and learn together. come up with best ideas, a hypothesis, start a community. Get people together and, involve people. And again, how it ends organization.</p><p>And you have to, you have to try it out. But we know as covert specialists that that's social proof, social validation, it works. We know the community building works. and I know that people change their behavior. Once they're in a community </p><p>Guido: [00:17:54] show, show all the works show with all those y'all doing, that's basically a basic social proof tactics.</p><p>Ruben: [00:18:00] Yeah. Yeah. And what I really liked what I also said in my presentation. one of my clients, especially since the converse specialist there, Sasha, I think you know her as well. Yep. Yeah. At the end of every AB test report, he shows the names of the colleagues. And as course of the, which test one competition.</p><p>So this is really smart because it sets us up social norm, because if all your colleagues are scoring points a year are nuts. You will definitely participate next time or try harder to, to yes, the right test winner includes for loser. Yeah. And it's also a very smart way to set with a small tweak, set the strong social norm to get people more involved and more thinking about what you're testing.</p><p>Guido: [00:18:37] Yeah, we did. We also did, at the hotspot where we have where we ran test and we, we just, we let the person that came up with the test or executed the test and let them present instead of someone, from zero team. Just us doing this. It's a whole team effort of people in the countries that run the test or think of these tests.</p><p>And that really works. Yeah. </p><p>Ruben: [00:18:57] Yeah. That works really well. indeed has gift people with stage and to present, but also for yourself as a conversion specialist, we know from very basic psychology , that likability and authority are, are very important. So be humble and, help people instead of. Once I see a lot of, of times happens when, when a colleague comes up with a test idea and we are like, okay, is this based on data?</p><p>Is it based on user research? No. Okay. Well, we'll put it somewhere in the back and at the bottom of the test backlog, and we'll see, we'll notify you when we test it, which will then never happen. we also tend to say to, for instance, UX designers from, okay. Now from now, we're going to experiment, did everything.</p><p>So you're not allowed to put your designs straight away a life anymore. And that doesn't work. You have to be nice. You have to be likable too, to get people to follow you. Instead of saying, this is not some, this is you're not allowed to do this anymore. You can also reframe it as Hey together. We can improve your designs.</p><p>And instead of saying no to two ideas based on gut feeling for people who want to get started with experimentation, do test eyes, those ideas for wants, because if you hear a no from someone, when you try you, you put effort into it and really try to finally start experimenting as this converse specialist keeps telling you and you get a no for your test idea.</p><p>Yeah. We're not going to get people on board. Yeah. You're not going to motivate people. So from a social perspective, also look at yourself and be likable and be in authority and to help people and help her be humble. Yesterday's brainstorm was so good. I really liked step's idea of running </p><p>Guido: [00:20:35] that test on the call to action </p><p>Ruben: [00:20:36] buttons, making them orange will </p><p>Guido: [00:20:38] really make them stand out.</p><p>Don't you think? Yeah. Right. Do you want to design real AB test winners and achieve enormous conversion uplift, then stop, brainstorming and take a scientific approach. If you can read Dutch, follow the steps and online influence the best seller men, even book Delta now and ruling the authors course and become an expert in applying proven behavioral signs yourself, go to &nbsp;dot com for more information and free down notes.</p><p>Often when you start, especially with, designers or marketeers or, developers, you're not the, the usual environments we work in. It says hero specialist. when you start out it's to those people that feels like either you are taking their, their work, it feels, it feels very personal. or it feels like you're giving them extra work, like, okay, we've gone on design AB test.</p><p>So we need an hour, a couple of variants, for the, the thing you were already building. But now we want that times two, three, four. So it feels like that feels like a lot of extra work while actually, if you, if you frame it a bit differently, you say, okay, but. Instead of designing this or developing this whole new system, let's start with an MVP.</p><p>Let's, let's start with a smaller thing where we can, but still big enough to validate, whatever we want to, validate and, and, and take it from there. And then actually after a couple of months, they started realizing, well, actually it just saves a lot of time, especially for developers. I think it saves a lot of time.</p><p>If we start out with small things, Part of their demo. It's actually another walking. So let's not start this building, this whole mess of thing. That's going to take us three months while we can also just spend like three days validate it or it doesn't work or make it better or whatever, but whatever the path is, but it can save a lot of work too.</p><p>Ruben: [00:22:26] Yeah, exactly. So, so always, have people, give, give the feeling that people are still in control themselves, get some autonomy, because they don't like to be taught what to do. We don't like that. No one likes that. and make the change as small as possible. so don't be too harsh on them when their statistics aren't perfect.</p><p>Don't be too harsh on them when, when their test idea is not based on, on a, on a research or scientific research, and trained us people, those were antigenic trained and bring them together in a fun and engaging way. So. Make a change small and give them a sense of autonomy. Otherwise they're, they're just gonna, it's going backfire.</p><p>Guido: [00:23:02] Yeah. Are those people creating that content instead of, &nbsp;not attacking, but it feels like a taking their, whatever. They come up with it, you couldn't, you can ask them like, okay, what are your biggest unknowns about what you're making? What are the biggest doubts that you have about your audience or your, your, the content that you have?</p><p>Or the biggest audacious things that you would otherwise never do, but what, what would you like to do, but you don't want to, or can't because our brand guidelines or whatever, and help them, you know, bridge that gap of knowledge, with, with doing your experiments or use a test or whatever you use to validate, and help them in that.</p><p>So they, they start seeing, Hey, this actually helping me. </p><p>Ruben: [00:23:39] Yep, exactly. Exactly. </p><p>Guido: [00:23:41] So the third morning you're in your model is rewards. </p><p>Ruben: [00:23:45] Yes. Yes. I'm divorced. There were very mixed evidence, for death. if the parents were plan rewards, of course. what I really liked is, research by Steve Tonka, which you mentioned in his book explanation works.</p><p>they already actually did research on rewards and maybe this is more of a management thing, but if there are clear rewards, people start experimenting more. When I, there mine are mixed signals. So you do say like, Hey, experiment more in your, assessments about your work, your evaluation. You mentioned that the uplift is not high enough, that will backfire, but rewards being celery from motion, busted assessment complement, that sets people can help people to start experimenting.</p><p>and of course this is more on the management level. Those rewards. But it's a converse specialist. We can also have fun with different words. Like for instance, when someone, the best test idea gets a cake or, or, the one who wins the waste test one competition gets a, gets a bottle of wine. yeah.</p><p>Do see there is these rewards as trying to start building habits. </p><p>Guido: [00:24:48] Yeah, exactly. So then like, like Tom says in his book, it's more about rewarding the process. That actually rewarding the outcome because that's, that's more difficult or it will change over time or you'll have ups and downs. We all know that.</p><p>but it's a process that you want to, to motivate people to do it. </p><p>Ruben: [00:25:05] Yeah, definitely do focus and motivates the, the, the process. if you look at goals, the goals can be useful. but, in formula one, everyone is to call to win, but there's only one winner. Yeah. So it's the process that makes the difference.</p><p>Guido: [00:25:17] Yeah. And that makes people more motivated. I think if you give that gay or whatever, to the person, that's just sending one idea and that's by accident. I had had a nice effect. there's not a going to be motivating to the person that's sending 20 ideas, based on research, that happened through North panels, all of them, but, </p><p>Ruben: [00:25:36] yeah.</p><p>Yeah. Try to combine something people want with something people have to, which something people have to do. And if you think about advice fee, if you, for instance, give a cake, it's the reward. But if those colleagues are nice, they'll share it around with the, with their departments, which again is to tweak in a social environment.</p><p>Guido: [00:25:52] We already see companies doing this or rewarding people, actually rewarding people with, bonuses or, or, in salary or whatever they do to reward people in there. Quarterly reviews or yearly reviews. You see companies doing that. </p><p>Ruben: [00:26:06] well, other than, than the companies, we're all here about in, in, in the presentations and the blocks.</p><p>no, I don't see companies doing that yet, but I hope that hope companies will do that. But, but to realize that we do again, need to spend more time on organizational change and to motivate people, to start having this as a culture and a mindset. Yeah, </p><p>Guido: [00:26:25] exactly. anything else you want to add? on the model?</p><p>Ruben: [00:26:29] Yeah, I'm, I'm actually thinking about adding a fourth layer and it's, it's something, a fourth, besides the fiscal, the social and rewards, and is basically, the, the four environments. So a ruling, we, we see it now with, with the COVID-19 crisis. I mean, due to rules set up by the government, we are all of a sudden able to change our complete lifestyles.</p><p>Yup. and again, isn't, we're on a management level probably, but, if you said the ruling that, so that for every sprint you need, at least one experiment, of course, people starts, changing their, their behavior. but I think the model as it is now, I think it's, it's, it's a good umbrella to start a discussion within organizations to, to start wanting, to have more focus on organizational change and likes just the one assistant to.</p><p>It's a, it's an easy Malo for something that is extremely complex and extremely big. but it does give a great understanding and I think it works. Like I said, that's an umbrella to start generating ideas with your team. to come up with, with ways to, to motivate the organization, to the depth of version, rate optimization and experimentation.</p><p>Guido: [00:27:35] Yeah, no one, no one can ever say, Oh, but that's too big of a change. We can never do that. No one will ever adapt. Well, do you remember COVID-19 </p><p>Ruben: [00:27:43] exactly, exactly. Yeah. </p><p>Guido: [00:27:45] The whole world. </p><p>Ruben: [00:27:46] That is very interesting. it's very interesting time from a behavioral science perspective and, online dialogue. We have several psychologists.</p><p>Great fun. Having discussing, seeing what happens, and all of a sudden we can change </p><p>Guido: [00:27:59] all of a sudden, a lot of things change. Yeah, </p><p>Ruben: [00:28:01] exactly. Exactly. </p><p>Guido: [00:28:02] So, well, thanks for explaining the model, to us. so what, what are your working on the next couple of months? Any new courses or, </p><p>Ruben: [00:28:12] yeah, I'll, I'll keep making courses.</p><p>as you know, like I said, at the beginning, I love helping organizations and people. And with online dialogue, I can help a lot of organizations. and in my </p><p>Guido: [00:28:22] people that don't know, you have to two courses all new to me, right? </p><p>Ruben: [00:28:25] Yeah. Yeah. In my free time, I like to create, courses which help people to get started and Excel in conversion rate optimization, who don't have to huge budgets to pay for expensive business to business courses.</p><p>and I really liked it a lot. I liked doing that. I get a lot of positive, feedback from people all over the world. You, benefit a lot from, from my course reluctance, but that's what I like to, what I will focus on is, is, is in the coming months, is this our to summit to sum it up in three points?</p><p>I really think we should use our knowledge to, motivate organizations and we already have a lot of knowledge. I think we should spend more time besides experimenting on, on, on motivating organizations. And I think are actually, I know that besides having it, I think plan and a test roadmap, we should set up a roadmap for changing the organization, put it into calendar and evaluate with the theme, brainstorm with the team and experiment, what happens and, what works and what doesn't work.</p><p>And this will be my focus. I will focus more on this in the coming months, years, and then write more about it and, Yeah, explore more about it and help people, hopefully, and organizations with that </p><p>Guido: [00:29:37] sounds like a very good ambition for just a couple of months. </p><p>Ruben: [00:29:43] It's going to be years. I think it's, it's something we have to do to get her as well.</p><p>yeah, if more and more organizations start adapting this mindset and as culture, we do realize a big environmental change, which again helps audit organizations. To, to adopt it and, and to thrive in CRO and get more. Authorization at the majestic and to be successful in our line of work for everyone, we have to do this and you have to inspire each other and help each other doing stuff for </p><p>Guido: [00:30:11] over 10 years.</p><p>And now online dial-up advisors about evidence-based conversion optimization with a focus on data and psychology. We see that analyzing data and recognizing customer behavior results, online dialogue with your clients and a higher ROI that team of strategists, analysts, psychologist, specialists gathered valuable insights in online behavior stars.</p><p>And together with you, they optimize the different elements of your zero program through redesigned expert reviews, 80 desks. And behavioral analysis for more information about their services, go to Oman dialogue. I'm a firm believer that this is the core problem. Why most SEO programs fail? Why, why agencies feel or internal Ciro?</p><p>people feel is, is because of this. They, they weren't able to get their colleagues or management. buy into this. </p><p>Ruben: [00:31:05] Yeah, no, I agree. And, and we, we see it now as well. And, and this crisis, one of the, one of the teams they've got cut is in some companies is conversion optimization, which is weird because there's so much research that if you invest in growth in time of crisis, you'll do great after the crisis.</p><p>so there's still, we have so much knowledge. We know so much, but as we start off, there's still a problem there </p><p>Guido: [00:31:28] exactly answers. And now it's specifically, there's a lot of behavioral changes like we just spoke about. So th th we need to figure out as a company, I need to figure out what is changing exactly.</p><p>What are the changes, priorities for my customers? What are they. feel about this, how are they acting differently and is specifically the moment that you should invest in this? </p><p>Ruben: [00:31:47] Exactly. And we can help with that. We can do the research and see how behavior has changed, and we can help our colleagues with that.</p><p>We can help customer support if they get too many questions ready to go with weekend, we can make changes on the website. for people to get the right information so they don't have to call, we can help our colleagues. So again, yeah, help people, be humble and in that way, motivate them to start experimenting validating.</p><p>Guido: [00:32:09] Now, if you're listening to this and, are a bit inspired, hopefully, to, to learn more about this and there will be, a video from Rubin in the, in the show notes and also include, the books that he also added to his, There was an article on LinkedIn and there's five books. you already mentioned the, a couple of them, their switch, from chip and Dan Heath.</p><p>They're thinking fast and slow from Daniel Kahneman. our, our Shiro Bible. There's a dry from Daniel pink. There's nudge. From Tara and Sunstein and there's atomic habits. And before we started, you already said, okay, you want to remove one and add another? I don't have a limit of five, but sure. Let's go with that.</p><p>Why do you want to remove one? And which one? </p><p>Ruben: [00:32:50] No, no, no. To remove one, if I have to keep it to five, I'll remove one, but let's make it six for now. I recently finished a, the book, the science of organizational change. Okay. from Paul Gibbons and he looks more at a scientific. proven methods to change organizations.</p><p>it's a long reads and he does like to, showed up other writers and models are not working. so that makes the book a bit lengthy. But the theory that he explains that that work from a science based evidence based. Those give great insights in what you can use, for your organization. So if meant, if I can make six books, then definitely add that one as well.</p><p>Guido: [00:33:30] So, so when you say it's, it's, it's a long read. So how long is </p><p>Ruben: [00:33:33] it </p><p>Guido: [00:33:35] an enormous </p><p>Ruben: [00:33:36] yeah, 330 pages, I think, but </p><p>Guido: [00:33:39] that's fine. Let me, let me have a quick look. three 17 mine, according to Amazon. It should be fine, </p><p>Ruben: [00:33:46] right? It's not an easy read. I bought switch, which is my favorite book on this subject. And most of model is based on switch.</p><p>It's really easy and nice read. I'm thinking fast and slow, which a lot of people have read. And this one, the science of organizational change is a bit harder to read. So if I'd say choose one book to switch, start with that. </p><p>Guido: [00:34:04] Those books are usually include a bit more storytelling. Right. That makes them easy.</p><p>Yeah, </p><p>Ruben: [00:34:08] exactly. Exactly. The good thing about those books of based on science is that there are a lot of notes at the end. So basically it's not 300. 79 pages, but there's 20 pages of notes and references to scientific articles. So </p><p>Guido: [00:34:21] I also liked that, with, Steven experimentation works, right. There's a lot of science based things in there.</p><p>Although I think his book. I mean, he also works for ultimately, and that's quite obvious when you, when you read the book, there's, there's a lot of Optimizely examples in there, our clients in there, and also a lot of, and also booking is highly featured </p><p>Ruben: [00:34:40] the book chapter on booking. Indeed. Yeah. </p><p>Guido: [00:34:42] If you remove all the ultimately and booking things, I think you end up with half the book, but it's, it's, it's, it's a, it's a good rate.</p><p>It's a good rate. </p><p>Ruben: [00:34:48] Exactly. No, I agree. I like about a book and I think we should grow to that, as, as a, as a CRO community. Is his experimentation outside the website. Well, you also mentioned like tell efficient screens in waiting lines and such experimentation in Olympic gold winning seal teams in the really one team.</p><p>So I liked that about a book that he also mentioned his experimentation besides our websites. And I think that's something important as well for us. </p><p>Guido: [00:35:16] Yeah. I, I really love that. that was basically the study that I did, applied cognitive psychology is. That didn't do anything with the line was all about offline, a nudging and an experimentation, and it was really fun.</p><p>And it's also what I like when you go to a, for example, areas or, or buildings that are very well thought out or, are, airports, and casinos. </p><p>Ruben: [00:35:41] Yeah. </p><p>Guido: [00:35:42] Yeah, those are two examples of the rent, a lot of thought in the design and in, because there are a lot of people there that might not speak the language, so you can not do.</p><p>Basically anything with, with a language you need to have a proper symbols for things. the, we find in there is very important, Durham airport to find your Gates the fastest way to do that boards. And so, so ceilings and. floors are our aim to help you, do that. And, cause he knows actually, try to keep your insight as much as possible.</p><p>if you've ever been to. Cause he knows there's not a lot of windows there won't be, there won't be any clocks, </p><p>Ruben: [00:36:18] no things like that. If you want examples of great physical tweaks, go to an airport and try to spot the ball. </p><p>Guido: [00:36:27] That's a yeah. Try that. Will thanks so much. And we'll include the old books and the links that we mentioned, the insurance, and, I would say good luck, with, with trying to implement this, I hope to hear and read, read more from you about this topic.</p><p>And, we'll probably talk again soon. </p><p>Ruben: [00:36:44] Yes. Thank you for your time. Thank you for having me. </p><p>Guido: [00:36:46] Thank you. And this concludes season two, episode 29 of this Euro cafe, both guys with Ruben, the brewer from online dialogue. Although we started out as a ditch podcast, we are putting out more and more English content.</p><p>And if you want to skip all the Dutch gobbledygook, please go to &nbsp;faceless English to see an overview </p><p>Ruben: [00:37:05] of our </p><p>Guido: [00:37:05] English episodes and subscribe to get notified about new English episodes. If you're interested in promoting your products or services to the best hero specialists in the world, at least take a look at sera.com/partner to see how we can collaborate.</p><p>Next week. We'll have another English episode in which we are going to discuss experimentation statistics with Yogi, your gift. Owner of analytics, &nbsp;author of the book, statistical methods in online, AB testing, talk to you next episode, and always be optimizing.</p><p>‍</p>",
  "show_notes": "<ul><li><a href=\"https://www.linkedin.com/pulse/how-motivate-your-organization-adopt-cro-ruben-de-boer/\" target=\"_blank\">How to motivate your organization to adopt CRO</a></li><li><a href=\"https://vimeo.com/418472452\" target=\"_blank\">Opening talk Online Dialogue digital CRO meetup</a></li><li><a href=\"https://www.udemy.com/course/complete-conversion-optimization-course/\" target=\"_blank\">The complete Conversion Rate Optimization course on Udemy by Ruben</a></li></ul>",
  "guests": [
    {
      "id": "ruben-de-boer",
      "name": "ruben-de-boer",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/how-you-can-motivate-your-organization-to-adopt-cro.jpeg",
  "language": "en",
  "type": "podcast"
}