{
  "id": "lets-help-the-world-the-covid19-conversion-rate-aid-package",
  "title": "Let's help the world: The Covid19 Conversion Rate Aid Package",
  "description": "We’ll learn about what covidcrap is and how you as a cro specialist or as a business can join with the person that started it all: Raoul Warren Doraiswamy",
  "date": "2025-01-08T20:07:07.493Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/2a0248b4.mp3",
  "transcript_url": "<p>Guido X Jansen: [00:00:00] Welcome. And thanks for listening to another episode of this hero cafe. And this episode, I talk to the person that kicks out the COVID-19 conversion rates. Eight package also known as Covitz crap roll doors from me. And I'll be talking about what covert crap is and how you as a chiro specialist or as a business can join.</p><p>My name is Curry. Also welcome to Siracha Fe the podcast where I show you the behind the scenes. Of optimization themes and talk with their specialists about data and human driven optimization, and implementing a culture of experimentation and validation in case you missed it. In the previous episode, I spoke to Matt bashal from Carver's CRO about automating those pesky tedious recurring tasks.</p><p>So you can focus on the morphine bars of the job. You can find that episode on chiro dot cafes slash. Episodes or in the podcast app you're listening with right now, this episode of shearography is made possible by our partners, covert online dialogue SiteSpect and content square. Welcome to season two, episode 18.</p><p>So we're all welcome. And yeah, first of all, let's get to know you. what's your background and how are you involved with Shiro? </p><p>Raoul Doraiswamy: [00:01:25] I'm the founder and managing director of conversionary, we're a CRO and experimentation agency. And so we specialize in, yeah, so we specialize in accelerating conversion rates for, eCommerce companies and Omni channel retail companies and say, And so besides that though, like I'm a, my background is I've been in digital about 10 years.</p><p>and out of that five years, I'm an experimentation and yeah, I'm a, in a CRO breakfast of a hop, ad hoc and loved getting into the tools. Love seeing stuff in the data. but, in a conduit that, all the time at the moment, but, besides that, we have founded this new initiative called COBIT crap, which on are we going to chat about?</p><p>and, we'll talk more about that, </p><p>Guido X Jansen: [00:02:19] Yeah. Yeah, and your wife or girlfriend is now eight and a half months pregnant as I understood, right? </p><p>Raoul Doraiswamy: [00:02:25] Yeah, that's right. yeah, married to a lovely woman. and she's about. we are we're one month away now from our first one. </p><p>Guido X Jansen: [00:02:34] So </p><p>Raoul Doraiswamy: [00:02:36] yeah, this is great.</p><p>This is great timing with all the COVID-19 stuff happening. I can imagine </p><p>Guido X Jansen: [00:02:41] there's some additional stress there. </p><p>Raoul Doraiswamy: [00:02:43] yeah, it is a bit, yes and no, she didn't get to have a baby shower, which was a bit sad. so we turned it into, yeah, just something, just something virtual, And it, the positive has been, we've been able to spend more time at home. and I've been able to be around a bit more since she's on maternity leave. so yeah, </p><p>Guido X Jansen: [00:03:05] that's good. Maybe the postage side on this. I, when I was, when I became a father for first time, the little one was, is now one and a half years.</p><p>And I was able to stay at home for the first four months. And that was really great if you're able, if you're able to do that. Yeah. That's great. </p><p>Raoul Doraiswamy: [00:03:23] Yeah. that's, that's great insight because I don't know what I'm about to face. And, and so yeah, if I can spend more time at home then great. </p><p>Guido X Jansen: [00:03:32] That's great for a little while.</p><p>And your girlfriend, of course, usually it's the ladies that need to stay at home mom for this and a man need to go to work at the, in the Netherlands. They need to go to work out for five days already. Yeah. I think they extended it to 20 or something. Yeah. But what we're talking about today, let's let's let's assume that all goes fine.</p><p>Raoul Doraiswamy: [00:03:53] Yeah. Yeah. Hopefully fingers crossed. </p><p>Guido X Jansen: [00:03:55] So you already mentioned, coffee's crap. Totally different story. </p><p>Raoul Doraiswamy: [00:04:00] Yeah, </p><p>Guido X Jansen: [00:04:01] totally different. Okay. Can you tell us a bit, what is covert crap and why'd you start it. </p><p>Raoul Doraiswamy: [00:04:06] Okay. So Colbert craft stands for con COVID-19 conversion rate aid package, as in like first aid package.</p><p>yeah, basically it's they movement, but took off, unexpectedly. so it's a movement about so far about, , CRS all over the world now. yeah, we were all banded the CRO industry or the conversion rate optimization industry has banded together to give one, of your time each, to help a struggling business, improve their conversion rates.</p><p>and the idea is. Is that is practical, tangible, help that they can get for free all for free. Yeah. it's amazing how so many people are come together, to do this. and I guess you asked me why I started it. I the inspiration kind of came from, when I was in.</p><p>Just moving out, our team and I were just moving out about coworking center and there was a small company there. they, you like sports consulting, right? A small sports consulting firm. And then, ran the COVID-19 thing. He, we were moving out and I found out that they had to close their doors because suddenly there's no more sports clubs.</p><p>So there's no one to sell to no one to service anymore. And so that told me it was heartbreaking. And that's just one among so many, accomplished businesses now who are struggling, who have lived, laid off staff, who, whoever had to close their doors. So I thought to myself, I'm a, CRO, person, what can, and, we have an agency, obviously, where.</p><p>We were scrambling and doing our own, damage control, but what can I do to help? And I thought to myself, let me just put it out there. Let's say, if I give one hour of my time, let's try and feed that bites. And I contacted, another CRO friend in the U S and two other Sierra guys in Australia.</p><p>And I just said, Hey, I'm about to push this thing out. Really join me. And they said, yeah, let's do it. And I think from there, like a whole bunch of people saw that and, it just a bit while that's good. Yeah. Yeah. </p><p>Guido X Jansen: [00:06:12] So all these heroes are helping businesses by, by, offering one hour of their time.</p><p>how is it possible to contribute to a business in just one hour? What are they doing? </p><p>Raoul Doraiswamy: [00:06:22] Good question. so the idea is that. it's structured. and it's practical help that they can, that a CRO person can provide, to, who was reaching out. So say someone reaches out and they set up a phone call or a video call, whatever that might be.</p><p>And, prior to that, and the Seattle person might ask and a few questions, and to get a bit of background and then, and then they jump on the call, and it's very much like a triaging kind of, phone calls. okay, let's look at how we can improve your website, conversion rates.</p><p>and each person would do it differently. obviously we got 90 plus CRS in there, so all with varying levels of, experience and expertise, but they're all, pretty passionate and pretty good at what they do. and yeah, and we've had some amazing stories where, for example, one, one business I spoke to, and they were, they're an online eCommerce retailer.</p><p>And he said, look, we only help. for some reason our sales are tanking, online. And I said, okay, are you able to share, fill out the form first and they fill out a form. provide a bit of basic details. and then, I asked him for the Google analytics access, prior just read only, had a bit of a look.</p><p>And it's really like in that one hour, trying to ask them questions like, where are your traffic? Where's your traffic coming from? What are your different channels? and trying to stay a bit top level as well. Like how can we. Okay, how can I provide a really solid advice and tackle some big rocks, right?</p><p>yeah. As opposed to, small problems, because a lot of them are just either having zero leads or zero, sales, and we're talking mainly small businesses just to clarify so small businesses who really need help. And so I've go through, say those channels that go through their eCommerce funnel.</p><p>and then just trying to figure out, okay, it seems like you, you seem to have a massive drop off here in here. what have you done in the past? giving them advice on design, on language, on, on. Yeah on. Yeah. On basically bio-psychology elements so they can add, but.</p><p>But at the end of that, they get a Google doc with exactly what they need to change and fix. That makes sense. </p><p>Guido X Jansen: [00:08:41] Becca, on the front ends, I beta test and happy Oak lost from the beginning of flickering. AFL yachties did come through the key test that was not to be included and imposed test tells that no, Tyler, Sheila.</p><p>be a convert comes our beta testing software. The smart insert that'll heat about any flickering, a full combed fifth gear Snelder support fee, a 24 seven chats. The health would go up and dive at the last minute. It's 15 key carbon positive. You do this yourself. You have a knife and the fork and the &nbsp;during</p><p>Yeah. Are usually a CRO, the internal Shiro people that are, calling out for help or federal Shiro specialists, or are more the digital companies that don't have CRO right now or did, are looking for help with yeah. adjusting to this new world. </p><p>Raoul Doraiswamy: [00:09:34] Yeah. Good question. I think, it's funny because we have, we have all these experimentation, experts on board, right?</p><p>In this, in this initiative. and, but it's mainly been small businesses reaching out. </p><p>Guido X Jansen: [00:09:47] Oh, did they usually don't have a dedicated Euro person? </p><p>Raoul Doraiswamy: [00:09:49] no, not that I've heard of so far. we've had some e-commerce managers reach out. We've had some, heads of marketing reach out. maybe some digital marketing manages.</p><p>but I haven't been, we haven't really. I heard of, I haven't heard of it. I would ask the team, but not a CRO person yet, I </p><p>Guido X Jansen: [00:10:09] believe. Okay. Yeah. It's interesting to see because, some companies are actually laying off sheer old people, in this time while others. Are apparently just actively looking for these skills, looking for more data driven way, because they have no idea what's happening.</p><p>they look for more, a data driven way to tell them, Hey, what's happening and how can we adjust to this new situation? </p><p>Raoul Doraiswamy: [00:10:35] Yeah. absolutely. and I'd like to think that, in the, in a time where was. When a CRO is being considered as a, nice to have by some companies and perhaps, laying off staff or, or perhaps it's, Yeah.</p><p>It's perhaps not being seen tangibly. whereas other companies, I have heard of companies that are investing more into conversion, right? I'd like to think that us as a CRM community and, Greedo, you've jumped on board as well, Good on you. thanks so much for that.</p><p>and then we are all together. give a giving. to these struggling businesses, And we actually making a tangible impact. and the, got some, so many amazing stories, coming through, and NDA, although it's been mainly, it's been small businesses, these are the businesses that really need help.</p><p>And for them to access, one of, one of the experts in the team would, might cost them. normally, okay. Two grand, five grand. Yeah. Just for an hour. Or, even if it's $500 or $200, even that's true money that they don't have. yeah. One another cool story actually just came to mind.</p><p>It was, so Tim Stewart, who's. Who's a well known, conversion optimization expert. And he was helping a, someone, I believe it was a, yeah, it wasn't regeneration business, but, he was helping them with their, with their WordPress website. And even down to the, you need to get into these plugins and you need to, make sure that you have the right it support and.</p><p>and you need to get this website and replace it. really basic stuff. and your code is just all over the place. And so before you, you actually started improving the, the, actual website pages and adding more staff, let's fix this basic stuff, and then you gave them some advice as well.</p><p>and then they were super thankful, sent out, sent out a, a message on the team, put it up there saying, we really appreciate it. We'll be advice and it's made a big impact. that was super great to pin. </p><p>Guido X Jansen: [00:12:35] And so you all, there's also a Slack channel for coffee's crap. participants.</p><p>And I think I noticed a couple of people saying that, including Tim, I think thing that's not actually CRO work, that we're helping them with it's for some of those smaller companies, there's a lot of more, a little more basic things, that they need to fix first, that it will help them, much faster right now.</p><p>then, we'll setting up, an AB test for sure. </p><p>Raoul Doraiswamy: [00:13:03] Yeah. that's right. I spoke to, another company, they're a skin treatment clinic and they rely on usually on the clinic and they're the leads coming through the website, but that's, that becomes consultations in their clinic, but they don't have the clinic open anymore.</p><p>So what do they do? and for them, I was just saying, what can you sell online? I said, we can sell some, treatment products. let's start getting that happening. right now it's, this COVID-19 may last a few months and you can't afford to wait around. And you're also very experienced.</p><p>Can you, teach other clinicians your skill sets? And so there's a small business who like, Oh, wow. like that's really useful. Advice for you're. Like it's a lot of the stuff I know that the guys that actually, take cities is enough CRO stuff. but what I love about the CRO skillset and I'm sure you'd agree.</p><p>Agree though, is that because it spans the, the entire marketing stack, As opposed to say another digital discipline. we ended up, CRO professionals. It isn't a position to actually advise on. Okay. What do you need to tackle first? which is really cool. </p><p>Guido X Jansen: [00:14:19] Like I said, if it's impossible for you to actually perform the services that you did before, because it requires physical contact, think of things, how you can invest in your people or promote your brands in any other way.</p><p>And those are all also great things that you can do right now is to become a better company and a stronger business when this is all over, or at least less severe than it is right now. </p><p>Raoul Doraiswamy: [00:14:43] that's right. and, if someone's listening out there and, you need help, know whatever it is.</p><p>yeah. Yeah. And if you need help in improving your website, you couldn't be your conversion rate and, or increasing more leaves on your site increasing more sales, right? yeah. We w one of the CRO people within the group can, can definitely help you with the right thing, whether, like you said, Greedo it's, giving you advice on what to tackle first, is it, you need to tackle your marketing first, your advertising first, and maybe then, Implement the advice that they giving you.</p><p>Guido X Jansen: [00:15:16] So w do you see a certain type of business apply for help? </p><p>Raoul Doraiswamy: [00:15:20] Pretty varied. and it's mainly small businesses with saying, reaching out. we're really struggling. </p><p>Guido X Jansen: [00:15:26] do you see certain sectors or certain verticals that apply or </p><p>Raoul Doraiswamy: [00:15:30] so far what's coming through the, the support and the support request form is, businesses like, let me see missing sports clubs actually come through because obviously they struggling cause they don't have anyone to, anywhere here, they don't run out of opportunities.</p><p>We're seeing some bigger businesses as well. some bigger like design service, design consultants, let's see, say if they're doing service design for retail or for, there was one which was doing that for like universities, but obviously a lot of these big companies are, putting these million dollar jobs on hold.</p><p>They said that their leaves are completely dried up. So that's another example of bigger business. we think he called us a quality commerce come through. I'd say that's the biggest one, right? all from all over from Canada, from the UK, from, the Netherlands from Australia. </p><p>Guido X Jansen: [00:16:29] So you're based in a, in Australia.</p><p>This is a worldwide initiative. do you also see that the help requests that is different, in different countries? Or is it, </p><p>Raoul Doraiswamy: [00:16:38] yeah, cause it's. It's it really depends on, on the flavor of the CRO person who's assigned to you. but yeah, one thing I'd say is that the commitment and the, and the deliverable remains the same, anyone who asks for help, there will get genuine advice, no sales speech, no hidden agenda.</p><p>and it's actual, genuine, tangible advice, and it'll all be documented in a Google doc and that's something that they can take away and implement. Yeah. and, yeah, and I guess that, because it's something that kind of literally started all the night and it's just taken off from there.</p><p>we haven't really, Go on through okay. You know what the nuts and bolts of Too deep into how we're giving you advice. I like to leave that up to the CRO person who's providing that. </p><p>Guido X Jansen: [00:17:23] immense quite a tight and &nbsp;Zana specialist.</p><p>A team</p><p>and ultimately is here salmon Mecho &nbsp;hope, Hama, social websites, sales funnels, and customer journeys for me at info high now online dialogue. So how was that assignment done right now? It's just like ad hoc. A request comes in and I used to use available or. I'm on being local. Doesn't really matter right now, right?</p><p>Raoul Doraiswamy: [00:18:01] Yeah. Yeah. No good question. There's a website called, who would crap.org. I do have to applaud and thank Matt, blue shoe for putting in the time free of charge. just. His passion for the cause he's in the U S and he spent hours and hours building that. </p><p>Guido X Jansen: [00:18:17] We actually have him on the postscript podcast last week,</p><p>but he builds a website. </p><p>Raoul Doraiswamy: [00:18:24] Yeah. Yeah. He's a, he built a website, and he's still tweaking it. And, anyway, so it's just a one pager it's Kobe crap.org, cob ID, crep.org. And then if anyone listening needs help, or if someone who needs immediate help to, improve their website because they can, you can go there.</p><p>There's a button that says I need help. They can click on that and they can fill out a form. it comes through to, to a few admins, that we who volunteered. And then we assign. A CRO professional in your region. do you, so you can actually get someone in your time zone.</p><p>Guido X Jansen: [00:19:06] Don't need to be around the corner because it doesn't matter anymore, but yeah, same times on definitely helps. as I understood, so right now there are more Shiro specialists that applies. there was 98 then, so they spend an hour or, they are willing to spend an hour each week, to help companies.</p><p>but there's more, time available from them. Then there are companies applying right now. So what can we do about that? How can we get more companies? To apply for this because I think a lot of companies need the help, but don't know about the initiative yet. </p><p>Raoul Doraiswamy: [00:19:39] That's a great point. And that's like where we w what we want to work towards next.</p><p>Cause right now we've helped about 60 plus businesses. and it's all because of, all the guys that are taking, we're taking these calls for free and, really inspired by them. and that kind of, keeps my fire burning. Now the next step is, so we've done 60.</p><p>How can we get to a hundred? And then once we get to a hundred, how can we get to 200? so at the moment, it's the words spread organically through social media mainly, And, what I'm really looking, looking for. and if anyone would like to come forward is if you can pop this on your newsletter, if you can put this on COVID crap on your blog, someone's struggling see it, right?</p><p>Yep. So we want to get out to as many marketing channels we can right at the moment and. so reaching more newsletters, reaching more publications, if someone who, who writes for a news publication or an online marketing new site or whatever. get in touch with Grito myself. And, yeah, we'd love to, get the message out there and cause someone.</p><p>reading that might see it. And, and that'll give us more exposure and, and more that means we can help more people. So the capacity Quito, you said it was about 90, 90 plus people. but rare, yeah. We're probably only using about 20% of that and </p><p>Guido X Jansen: [00:21:10] ready to go, everyone listening to the podcast.</p><p>If you're a hero specialists, definitely apply a plaid short time, to do this, if you have that available. And if you're a business listening, apply for help do it. Of course, after the podcast, you'll be flooded with a request for this. </p><p>Raoul Doraiswamy: [00:21:30] Yeah, absolutely. Yeah. And like you said, if you, if someone's a CRO specialist or they're listening, yeah, definitely do get in touch even though there's a, there's always room for more, you, all you need to do is, support the initiative and, the few things that you can do around there and can join the Slack group.</p><p>There's a lot of knowledge sharing. A lot of, coming together of industry would love to have you, </p><p>Guido X Jansen: [00:21:54] and you can even help with the structure itself. Or I thought the process itself, it doesn't even have to be with, helping clients, if you can help, like Matt's with helping with the website or doing something.</p><p>Raoul Doraiswamy: [00:22:04] Absolutely. anything that, any help that you know, can be given, is very much welcomed. </p><p>Guido X Jansen: [00:22:08] Exactly. Errol, thank you so much for taking the time in your evening to talk about this and, share this with us. yeah, I would say good luck with becoming a parents, and, hope that all goes well.</p><p>Yeah, you will. I'm not going to spoil it for you. </p><p>Raoul Doraiswamy: [00:22:26] I'm sure there's no, no handbook for it. And, there are, yes, but, yeah, I'm certainly looking forward. It's exciting times for us. but we'll if we have many learnings ahead, I'm sure </p><p>Guido X Jansen: [00:22:36] exactly. so yeah. Good luck with that. Good luck with, all the information.</p><p>I feel listening, the links to, to grab site and, additional information will be in the show notes. and, we'll talk to you next week. Yeah. </p><p>Raoul Doraiswamy: [00:22:48] Amazing. Thanks Greta. we'll generally central. </p><p>Guido X Jansen: [00:22:53] This will season two episode 18 of zero cafe with a roll doors Swami from conversionary. As always the show notes can be found on our websites, zero adults cafe.</p><p>Although we started out as a ditch podcast, we are putting out more and more English content. If you want to skip all the Dutch gobbledygook, please go to ciro.cafe/english, to see an overview of our English episodes and to subscribe exclusively to the English episodes. If you're interested in promoting your products or services to the best zero podcast listeners in the world.</p><p>Please take a look at Ciro dot cafes slash partner, to see how we can collaborate folks you next week and always be optimizing.</p><p>‍</p>",
  "show_notes": "<ul><li>Want to help or need help? Visit <a href=\"https://covidcrap.org/\" target=\"_blank\">Covidcrap.org</a></li><li><a href=\"https://uk.linkedin.com/in/timstewart\" target=\"_blank\">Tim Steward</a></li></ul>",
  "guests": [
    {
      "id": "raoul-doraiswamy",
      "name": "raoul-doraiswamy",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/lets-help-the-world-the-covid19-conversion-rate-aid-package.png",
  "language": "en",
  "type": "podcast"
}