{
  "id": "main-pitfalls-for-cro-agencies-working-with-clients",
  "title": "Main pitfalls for CRO Agencies working with clients",
  "description": "Working with clients on CRO projects? Learn about the main pitfalls for CRO agencies and how to prevent these.",
  "date": "2025-01-08T20:07:07.493Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/14000aac.mp3",
  "transcript_url": "<p>Guido X Jansen: [00:00:00] Today, I'm joined by Ricardo to her left one on one, and he shares his experience. All the major pitfalls. He came across while running CRO projects at the, his, the Spanish web agency that he founded back in 2013. My name is Nikita. Yonson welcome to she. Rock fate. The award meaningful podcast, where I show you the behind the scenes of optimization teams and talk with their specialists about data and human driven optimization.</p><p>My goal with this &nbsp;spreading mindset of experimentation and validation and to improve quality standards in digital marketing, you can be an enormous reaching this goal by sharing this episode or any other episode with your colleagues. And if you're not subscribed yet, make sure you are by checking this in your podcast.</p><p>It really means a lot to me. So thank you for doing that. In case you missed a previous episode. Last week, I spoke with Lisa Mazatlan and DMT Deville. They're from debt agencies, and we learned about how you can still continue running online experiments without relying on browser sticks cookies. Besides that, I also host a session at digital lead day.</p><p>I spoke with &nbsp;and Craig Sullivan about how you can keep learning and developing as a zero professional. You can listen to both of these on the shearography our website or in the podcast app you're listening with right now, this episode of Ciroc Fe is again made possible by our partners comfort with content square.</p><p>All my influences did. SiteSpect an online dialogue. Welcome to season two, episode 40. Ricardo. Thanks so much for joining me on the show. And, yeah, like with all my guests, I'd love to start with getting to know you a bit more. So let's get started with how you got involved with zero. Oh, </p><p>Ricardo Tayar Lopez: [00:01:58] first of all, thank you so much for having me here.</p><p>And, how this thing has started. Let me think. I think it was. 2022 or 23 years ago while I was studying Los in the university. And I discovered the internet, in the late nineties. Yeah. so I really was involved in some artistic stuff like Darwin. Or playing with Photoshop, all this kind of stuff.</p><p>And I discover the, I can be one person that makes websites, So I started making websites for free at the reunion. And then I discovered that some people thought that was a good idea to pay me for it. so I move into the business and I started working, doing this kind of a stop in my first year.</p><p>My first reason God, I think I was with master, the guy that does everything around a website. So that's how I started. and I moved in my next movement. I moved through UX and analytics. I'm finally into business and that's how I have the. The whole, the whole thing, the analytics, the UX bar on the business part that makes, the CRO makes sense.</p><p>Guido X Jansen: [00:03:09] And so you currently own the car or the company flats? one-on-one </p><p>Ricardo Tayar Lopez: [00:03:13] yeah, that's my company. Yeah. </p><p>Guido X Jansen: [00:03:15] So what do you guys do? Not only is hero, right? </p><p>Ricardo Tayar Lopez: [00:03:19] No. I always say that we are a company with the, with seven years in the market, we were born in 2013. And I always say that we face two kind of different challenges.</p><p>The first one is when a company comes to us and wants to out the retail experience. So focused on commercial, e-commerce, user flows, lead generation on this kind of stuff we don't do. And we don't work for social media branding on this kind of stuff. This is the first challenge people that wants to be barely read a very good digital experience for combating and the yellow.</p><p>And the other kind of projects is when. Some companies comes with DHL or the consensus or the it's all products and they are not working the way they shop. So they say, Hey, I have here a problem. I don't know where is the problem? So please call me to fix all this stuff and let's make it work. sometimes it's only comas sometimes it's media.</p><p>Yeah. Italy. It doesn't matter, but they are not, achieving the goals they have for the needs of the business. And that's why they come to us. These are the two kind of products will work. </p><p>Guido X Jansen: [00:04:33] How has your business, or maybe even your client base, how was it impacted by, basically 20, 20?</p><p>Ricardo Tayar Lopez: [00:04:39] here we are in a Spain. So you know that the Spain has a very, hard situation, across the pandemic. Of course, I think we are lucky because. All of our clients are a Steeler clients. we, we don't have any laws, but the problem is that the conditions of your work have changed a lot, in terms, in negotiation, in all these parts of your relation with your clients.</p><p>But to me, to be honest, in this last month, just facing, 20, 21. We are receiving now lot of, RCPs, requesters, all this kind of stuff, because I think that here now, every company has a very clear mission that really needs to be in a detailed scenario. they really need not only need to be there, but also to be in a very good way, because if you want to be competitive right now, It's not enough.</p><p>Yes. Having any comas or there's not enough, that's having a website or an application. You really need to be really good at what you do. Because if we take a look at the other data we have about combustion rates, incomes, all this kind of stuff. People who really care two or three years ago of building very good digital products or very good digital services.</p><p>They are, they are achieving a very, a high increase in their business of yet it's in the data. So it's a little bit complicated. You have to be in a mindset that allows you to balance, because now I have some information, maybe in two days I have a completely different information, so I have to adapt.</p><p>But the best part of this situation is that almost every company, almost every individual. Now it's very focused on the internet and on the being the detail scenario in a very good way. So that's something in this theory. That's something good for us here in Spain is that we have almost a quarter of own companies.</p><p>Serious risk of disappearing or with city of risk of very hard financial injuries. </p><p>Guido X Jansen: [00:06:54] It's hard for those people that cannot move that fast, Or the companies that cannot move that fast towards digital. But yeah, it sounds very familiar. That's part of the businesses that are, those were already, in online.</p><p>they are flying now and they double or even triple or even more, times their revenue. There are also companies that struggle even when there were a online, but if there are in a business that was typically about doing face to face business, like meeting spaces or doing of course as a whole, The food sector or restaurants, it's a very difficult.</p><p>but there are in general, I think there are a lot of opportunities for our business being in digital commerce. The securize as a whole has grown a lot the last couple of years. </p><p>Ricardo Tayar Lopez: [00:07:38] Yeah, I think so. Our problem is that most of the economy of a sprain it's based on tourists. so that's very hard for a lot of companies here to handle, because it's a very hard situation because we don't have tourists right now.</p><p>Yeah, exactly. so almost 20% of our whole economy, it's a it's depended on tourists. So that's a big hit. That's not so nice right now. Yeah. </p><p>Guido X Jansen: [00:08:01] So do you also see then a, company's focusing more on doing business across the borders because they did want to get </p><p>Ricardo Tayar Lopez: [00:08:06] the business from somewhere else or?</p><p>Yes, but I think this is something that comes, for the last years maybe. a Spain is. Typically exporting professionals. a lot of people that is good here, finally, works abroad in other country in Europe or anywhere in America or in Asia. But now a lot of people is moving to digital and also, it's very focused on, partnerships with all the companies, eh, outside and announce something curious because in the last, in the last weeks, There have been, several companies outside of Spain that have bought companies from Spain.</p><p>The last one was a . I think it was a serious venture capital company that has out, they, the main. In terms of total, we have here about renting, I think, houses or selling houses that it's called the daily stuff. it was about two weeks ago by a Swedish venture capital a chain. So yes. Now it's it's now it's like everybody is trying to do different things in order to achieve different goals.</p><p>And I think that's a, that's weird part. Of course, the companies that has a very classical mindset, They are going to suffer a lot in this time, but not only in his fame. Yeah. white </p><p>Guido X Jansen: [00:09:24] SiteSpect offers a worldwide unique AB testing, personalization and product recommendation solution.</p><p>Sites paperworks and service sites without any tags or scripts, which guarantees an ultimate performance, the SiteSpect solution eliminates delays and the chance of any flickering effects. And this approach also ensures that the current and future browser structure rules like ITP and ETP don't make an impact </p><p>Ricardo Tayar Lopez: [00:09:47] on your AB testing and </p><p>Guido X Jansen: [00:09:48] personalization for more info visit.</p><p>That's cool. During this time you thought let's publish another book because it's your second book, right on Sierra that you, that you publish. So what are these about </p><p>Ricardo Tayar Lopez: [00:10:07] the. The story behind this the last week is the last time I was in Madrid before the lockdown, before the national outcome. The last time I was in my day, it was 4% in the book I need was a date.</p><p>And it was a day that things we're completely insane about the Coby down. so it was expected to be. A 200 people event. I'm finally we were, I think Phil to your or 40, that was my last three. And, and this is the second one. So please don't look at the cover. And this is the second one.</p><p>this is called in English. it's a professional CRO. That's strategic, some tactics to boost, you'll do your child product conversion. And this is the first one that was two years ago that it's just called, CRO, the sign up development of the child business. Okay. so now is the second one is just a.</p><p>Is that some book, but for writing an advanced Smoot, I need that the step before you don't understand before was two years ago when I published the first one is just a book about basics. And when you have a, it works really well much more than the than I expected. And also the company that &nbsp;expected.</p><p>And now, we focus on being just more professional. Yes. talking about to how to work with a SBA, with single pitch applications, how to, how to develop your own CLO Mitchell only knowing that which ones are working now in the market, how to work with the telematics in the quantitative and qualitative way, which are the main roles and functions.</p><p>So fussy, CRO lead, all this kind of stuff. Yeah. so there's one is much more advanced, it's in the market and it's working. Nice besides of a &nbsp;situation. </p><p>Guido X Jansen: [00:11:58] Exactly. and that's of course, why I wanted to talk to you because the, currently the books are in Spanish only. Are there any plans for publishing it in English?</p><p>Ricardo Tayar Lopez: [00:12:05] but I think by I that in English you have. Tons of things to read about CRO. Maybe there are not so much books about the specific CRO, because of course you can find years ago you have always be testing or all this kind of stuff. That it's very good. But the problem in my, not only my country, also in America and other countries, is that.</p><p>We don't have any kind of material in Spanish, So we always have to read in English. We always have to translate. That's why this company totally total with me. Hey, do you want to write a book about chiro in Spanish? But I think there are no plans to publish in English, but we as a company and me as an author, yes, we are polishing some things in English.</p><p>she may. We publish in our website, complete a study of almost 150 pages, maybe in English about how come it was changing the detail. So business here in Spain. Yeah. Completely full with data about commercial rates. What kind of revenue each company's having, depending on the kind of business that they are running, all this kind of stuff.</p><p>So we need a. Set off. I think it was 600 interviews with people just to identify how they behavior has, is changing in Spain. And you have it in Spanish and you have it also in English. </p><p>Guido X Jansen: [00:13:30] Yeah. I saw it on your website. So it's still available. So people can still download that. So we can link to that in the show notes.</p><p>But I still wanted to talk to you about the book because not everyone obviously speaks Spanish or this podcast is perfect for you to explain what your book is about. It's through an English audience does as a short summary, and, of course, as a motivation for people to start learning Spanish, </p><p>Ricardo Tayar Lopez: [00:13:54] Thank you.</p><p>Thank you. it's a good, it's a good idea to start speaking in Spanish reading this book. It's yeah. Yeah, but they won't teach you how to ask for a bill or for food, but you will know a lot of </p><p>Guido X Jansen: [00:14:08] Sierra that's of course it's a secondary through our Shiro work.</p><p>Ricardo Tayar Lopez: [00:14:15] it was a hard challenge because, when they say to me, Can you write this work? the first thing that comes to my mind was okay, who's the reader of this book. who's the people who's going to read this book. So the first one is completely oriented to people that really don't know so much about TRO is people that used us investigating.</p><p>They know. It exist, but they don't really know what it is or how it can be used in a company. And the second one is just focus on the professionals and people that is working. In my niche, our marketing, they really want to move to CRO or people that is just beginning with CRO. So I started what I think is the core thing in that it's methodology you cannot do that never cannot, leave the responsibility of a project to the talent of only one person.</p><p>So you really need a system. So you need a system and you really need to build your own system because not all business models work the same. So things that work for you, if you are in retailing or you are selling, I don't know, a full, short bets. They can work, but they, they will work if you are working for an insurance company or a bank.</p><p>so I'm moving to meta-level years as a key aspect of the CRO. So I started talking about them at all. Is that now we have, of course CXL has their metal knee also. Why wider? Fano all this kind of stuff. So I talk about them and then I talk about the mental. Literally I've been building in the last.</p><p>10 years. </p><p>Guido X Jansen: [00:15:52] So can you take us through that a bit? So for example, if you encounter a new client, with an average kind of, budget that you see out there, how do you approach it? How do you start building, that's on that methodology? </p><p>Ricardo Tayar Lopez: [00:16:05] I think a very important thing is just the, eh, Not only the budget, also the kind of digital maturity the organization has.</p><p>So this is something I specifically write and put into our framework. This is something for me. It's something critical. You really need to know if you are working with a client that has a high level of the term maturity or a low one. Because in the high one, of course we talk about tools like content square, or maybe what now it's content square, or Tealeaf, or this kind of stuff.</p><p>And you are working at unsure. You will work with them, data scientists, a lot of, probably seeking metals. That's right. Yeah. But if you are working with a low maturity, we are talking about detail. if you are working with. No, it's our maternity company. You have to do more simple things. you have to be like a teacher, so you have to start with simple things and let them understand that simple movements.</p><p>Can allow us to achieve important goals and then move across more difficult ones. You know what I mean? so I define three kinds of companies, the most mature one that has a specific teams. There's a lot of budget. A lot of tunes are very complex, a stack. No very complex, a stack of technology and people.</p><p>The intermediate one is that it's typically, it's a company that it's running business in detail for the last three or four years. Things are growing. Things are growing. Okay. And they want to do the next step. They want to be more professional. So they have some boundaries and you are the one that it's going to help them to break those rumblings, because they don't have enough knowledge.</p><p>They don't know what kind of technology they have to choose, or they don't know how to play with &nbsp;or with. All kind of stuff. And you have the basic ones, the companies that really don't have a resources in CRO, but they want to boost their results. So you have to start working in what I call the genic part.</p><p>you have to have all your basics very well done. So please don't focus on the. Chatbots or in artificial intelligence, don't focus on that. If your information architecture doesn't allow people to find a product. so we work in those three levels. It's same methodology, two alpha steps, but three kind of three types.</p><p>About three times, depending on the company, in order to be able to make your war thing. Each in each company </p><p>Guido X Jansen: [00:18:49] marketing budgets have suffered and the sheriff for AB testing has been impacted too. If you want to keep that thing to enterprise standards, but save 80% on your annual contract, you can consider comfort.</p><p>But are some summer release you can take advantage of full stack and hybrid features, strong privacy compliance, no blink and enterprise. Great </p><p>Ricardo Tayar Lopez: [00:19:11] security. </p><p>Guido X Jansen: [00:19:13] Feel good about </p><p>Ricardo Tayar Lopez: [00:19:14] your </p><p>Guido X Jansen: [00:19:14] smart business position in infest. What you save back in your CRO program. Check out www adults over slash 2020. Let's for example things a, the middle of wonder intermediate, one.</p><p>So how would you start there? How do you start implementing better zero practices there? </p><p>Ricardo Tayar Lopez: [00:19:33] Okay. We always do. the first step for us is it's an inception. So we really need to understand the business model of each company because alpha. Two companies seem to be very similar. They never are so similar.</p><p>so that's why you really need to understand the business mode. So to understand business model, you really need to know. Which is the, which is a client of that company, which is a client. And of course, please show me your data. I need to understand your reasons, but of course, I really need, to see and to understand your data, how implementation has been done.</p><p>Watch what kind of KPIs or metrics are you measuring and why, which is your historic as a detail business? How well are the results two years ago? Three years ago, whether we want to move, then it's you. And then please tell me about your technological stuff, which is OCMs, which you are sharing. Do you have any plans to move to all the CMS?</p><p>What other technologies are you using day by day? I don't know, like Salesforce or like mating, which is zero marketing automation on tunes. How you, how do you plan your detail analysis? What kind of factions do you do? this kind of stuff is for us is critical in the first part, </p><p>Guido X Jansen: [00:20:52] sorry to where to start.</p><p>those are a lot of things that you can, then you can start working on a assuming they don't give you a limited budget. you have to start, you have to start somewhere. </p><p>Ricardo Tayar Lopez: [00:21:05] We have the first step is we do an audit. So depending on the sector of the company, we have like a checklist.</p><p>so we always see if some things are running properly or not, it's like a check. So we check almost 150, 170 things, depending on the type of business you are working for. So we do this check and if we find a lot of pitfalls or a lot of problems, then we most to, Or they're in a backlog from the most important thing because it's surgeon and it's important.</p><p>I'm the least one. And then we moved into, let's propose what kind of things we can do to fix this. And then we build a backlog and then we start the conversation with our client, or you always say, That we don't work for our clients that we work with our clients. I think that CRO is not possible.</p><p>If you have the, you don't have the confidence. And if you don't have a very good relation with your client, because you really need to understand the business. I think that's </p><p>Guido X Jansen: [00:22:13] key part. We talk about Shiro obviously. but do you also, usually are the person that can implement those kind of things on your website?</p><p>Are you also the web developer for those? </p><p>Ricardo Tayar Lopez: [00:22:23] Yes, we, I know that a lot of people. Don't do that kind of stuff. But I think we decide maybe in the arena, seven years ago that we will be a full stack company. so we do both parts also. Yeah. Also implementation on the technical part. Yeah. So we are imbalanced with several companies, have tools like content square, or like a Google optimize or target or this kind of stuff.</p><p>And we do the strategic part. it's more conceptual and more related with UX UI, all this kind of things, but also the. The technical part. I think that's important because depending on their maturity, you cannot, some companies are not able to do things if you are not able to do that for them.</p><p>Guido X Jansen: [00:23:09] If you look across your, your client portfolio, what would you say for when you come to new clients? what were the most common problems that they have the most common challenges that they have, with, with zero </p><p>Ricardo Tayar Lopez: [00:23:20] or. </p><p>Guido X Jansen: [00:23:21] The growth in general? I think, </p><p>Ricardo Tayar Lopez: [00:23:24] a lot of stuff, a lot of them, but I think that there are very typical ones and this is worldwide.</p><p>the first one right now for me, it's how people try to adapt the digital experience to Mobike. here, there are still, there are a lot of pitfalls because mobile navigation is very complex. You can use an iPhone of course, but also you can use a very, Simple device that has not so much the couple of LEDs as an iPhone.</p><p>Yep. So the first pitfall is that it's how my wireless performing very poor performance in general, the reboot performance. And that's why, because companies don't make that seltzer, a question. Yeah, that is, Hey, this is my digital experience in desktop, but I also have to think that. How is my digital experience for my wife, because probably is the same guy as the same people, digital experiences, but it's not being the same context and know the same needs and not the same processes.</p><p>And of course, now I hearing that say, I have my credit card. I have my books. I have fabric theme by the fan. If I'm using my wife, probably my context is completely different. Of course I can be at home. </p><p>Guido X Jansen: [00:24:36] Exactly. And usually the people that work on the website, they use their desktop screen. Which makes sense if you work on the website, but then you completely miss the whole mobile app. </p><p>Ricardo Tayar Lopez: [00:24:45] Yeah. I think the companies has to start thinking not desktop or mobile, they have to start thinking in detail experiences. And that also means that you have to understand that your client, of course, is visiting your website or even using your applications, but also is going to your source.</p><p>And also just talking with people that it's inside the stores and also reading about you in the newspaper and also it's reading your own media or your own, arts. So now this is a very huge challenge because a lot of companies, each our marketing is something like a war apart, and it's not inside the whole business.</p><p>So people that it's achieving goals is there is the ones that are understanding that it's only one experience. So you have to focus on the kind of, if you want to build for your clients and all the typical one, it's about checkout. Everybody's focusing in today and take out this failing.</p><p>I have this medium souls about traffic that is not working properly in checkout. I have this kind of device and it's not working properly in checkout. and of course, checkout problems are very related with technology. And how you are monitoring it to work the right way in different devices or in different orangy prime channels.</p><p>And one thing that really, I think it's a nightmare. and I hate because I don't understand how can I see these things in 2020? It's about the search experience. When you are trying to find a product inside our retailer or any kind of eCommerce and you are using, the search box, there are a lot of very poor experiences about certain products or certain things using the phone.</p><p>For me, it's something very important because if I cannot find a product. How am I going to buy it? So products, the first section is the most important one. </p><p>Guido X Jansen: [00:26:36] Yeah. And often it's already poor on desktop that alone. </p><p>Ricardo Tayar Lopez: [00:26:40] That's I think typical mistake here. It's about tipo squatting. I'm misspelling. we've been working, last year in a lot of steam in fashion.</p><p>So it's very funny when you see that people is just trying to find products and they don't know the name, they guess they know the name, but they don't know how to write it. For example, if you are looking for something like the expression, high waist, hearing a Spain, a young people say, Hey, I want my trousers in high waist, but you know how to say high waist?</p><p>But you don't know how to write it. So when you are a Spanish guy and you are trying to look for highways, trousers, they really don't know how to write high waist. So every, a lot of misspellings, a lot of people squatting. So what the search engine does for them zero results and probably you have 100 or 200 trousers with high waist.</p><p>This is just an example, but it happens a lot of times, a lot of times. And if I cannot find a product I'm not going to for over </p><p>Guido X Jansen: [00:27:42] 10 years now, all my dial-up advisors about evidence-based conversion optimization with a focus on data and psychology. We see that analyzing data and recognizing customer behavior results in a better online dialogue with your clients.</p><p>In a higher ROI that team of strategists, analysts, psychologist, and UX specialists gathered valuable insights in your online behavior of your visitors. And together with you optimize the different elements of your zero program through redesigned expert reviews, AB test and behavioral analysis. For more information about their services, go to Oman dialogue.</p><p>Usually the. The search queries on your own website, that's usually a treasure trove for four seasons. </p><p>Ricardo Tayar Lopez: [00:28:25] Yes, but they are, but you have to track them. And of course you have to take a look on them because of you are tracking them and you never look for that data. But, I really love that field of work, about information architecture and navigation parts.</p><p>And of course, So it's acquaintance because in our experience, it's a very important point to work on. That's a mirror. if let's think of it, 100% of the people is see in the search box on a lot of people is very, it's very comfortable using that because we are very used to use Google or other kinds of search engines.</p><p>So it's our natural behavior right now. So please just leave them a very normal experience when they are searching for something, because if five is be fine looking for something, and you tell me that you have zero results, I will move to your company. Or, </p><p>Guido X Jansen: [00:29:19] yeah, I think when my, girlfriend is shopping on mobile for anything related to clothing for our little kids, I think that the first thing she looks for on any website is just the search box.</p><p>She doesn't even try the main menu or something. Just go through the search box. cause it's, it feels like that's the fastest way to figure out are they actually providing what I'm looking for </p><p>Ricardo Tayar Lopez: [00:29:41] and that's the first transaction. And if you are not able to solve the first transaction, what about the rest?</p><p>Probably they don't mean, so that's a very typical pitfall and it's very, very European to solve. And now we have a lot of technology. to make, to experience something really good. But the main problem is that a lot of companies implement the eCommerce CMS, like Magento, like up or newcomers, and they are using the changes that comes with our CNS.</p><p>They only work with, specific docs. Yep. So if you don't right, exactly. The right word, my result will be zero. so we have a big problem here, and that's something that you have to focus on solving because it's a very important part of any combustion process, </p><p>Guido X Jansen: [00:30:28] that people are used to using search.</p><p>Brookshire's so much these days with, with Google and Google always has a result. And, you always, will find at least something. so the assumption I think is also if there is no result, they probably don't have it, even if I misspell it. And I do that only eCommerce store. If I misspell something in Google, I still got reachable.</p><p>So I get suggestions, whatever there will be results, whatever I type in. And if you expect that same in an eCommerce store, just type in anything, and there was no results. People don't bother going through menu, going back, trying different, all kinds of different things if they don't believe anymore that you even have the </p><p>Ricardo Tayar Lopez: [00:31:04] yeah.</p><p>Completely. That's a that's, but it's something very important. And sometimes in some syrup or yes, people is focusing on checkout. Yeah. A please. Yes. take a custom back because your problem is not in your checkout, your problem. I'm looking for something and I cannot find it. So that's a real problem.</p><p>I always try to too, to be clear with my clients. And I always say the same as Tori is this is like you find going inside a store. And I ask, to some people that is working there, I please, where can I find this product? And they don't say anything to me. That's what they are doing. Exactly.</p><p>I'm not saying here is not the place. Please go out. No, you are saying nothing </p><p>very rude, but it's true. It's other what they are doing. </p><p>Guido X Jansen: [00:31:53] Yeah, exactly. Hey, you just, choral mints, you got your side. Okay. people, at the intermediate or the lower level, they. Maybe they know the tools, they play around with it, but I don't exactly know to do.</p><p>Or the example you just mentioned that people focus too much on one part of the customer journey, like checkout and don't look at the other things. So how do you approach this when you encounter this at a, at those companies, how do you. How do you train those people, and embed that zero mindset that the company, </p><p>Ricardo Tayar Lopez: [00:32:22] I always have to face the question that it's very typical.</p><p>It's very hard because they always ask what kind of, what amount. Of money or what kind of performance am I going to win? Or am I going to aim? </p><p>Guido X Jansen: [00:32:38] Sounds very familiar. Yeah. </p><p>Ricardo Tayar Lopez: [00:32:39] Yeah. and I always say, yeah, I cannot promise you anything because I really don't know. So what I can promise you is that we are going to use a mixology in order to teach some goals.</p><p>But I don't know what measure, I don't know if we will perform. So 2% better, 5%, 80%. I really don't know. We always, eh, we always start losing weight. So if we have an, a previous approach in the section and we have our previous analysis, we always find 15, 20, 25 peoples something that has to be solved.</p><p>Some of them because we found some interesting pitfalls talking about UX or usability. And sometimes because we find some pitfalls, just taking a look, a deeper look into each one analytics. So we always propose a roadmap and a first roadmap. So this is the things that we are going to do. And this is the order.</p><p>Being that we are going to do. So please let us know if you agree with us or not, because maybe the, what I think is the most important thing for you. You can say, Hey, you are putting this in the first place. And for me, it's the fourth or the fif, because in business, I need all the things before. So we always start with this of 20, 25 things that we have.</p><p>We find we have to fix most of the comes from UX. Eristics. Or, or not general best practices, but best practices specific to business, best practices, So this is how we start. Sometimes we move into testing sometimes. Now, if this is something that is a risk taker, this that you expect for this related to UI, eh, we move directly into a fix.</p><p>Guido X Jansen: [00:34:31] That's how you work, but how do you. And get your clients on the level that they can do to work themselves, or at least get a better understanding of what you are doing. how do you train your clients? </p><p>Ricardo Tayar Lopez: [00:34:42] No, I don't know your experience with, for us sec, because we don't have to train because people come with the idea of, I want to improve my performance.</p><p>Yeah. and some people. Have told me about you. so we really don't have to train people so much because they really have a very good expectation about what they can expect. and also, and I have to be very honest here, and also we sometimes, you don't want to work. With some kind of clients, if you are expecting results in two or three months, we are not the company you need to work with.</p><p>if you are always with the word urgent or with a word tomorrow in your mouth, maybe we are not the best company for you. Because business results don't come in 24 hours. </p><p>Guido X Jansen: [00:35:33] Now, if you want the results in 24 hours, you just need to spend a lot of put all your money on AdWords and traffic and then, just fingers crossed hope for the best.</p><p>Ricardo Tayar Lopez: [00:35:42] Yes. I'm sure you have a listen about this a lot of times, but I. Muster combustion problems wants to be solved with topic. Yeah. and that's not the way. Nope. If you want to sell more, of course the first thing you can do is just to spend more. Yeah. </p><p>Guido X Jansen: [00:35:57] But that's what a lot of companies do, right?</p><p>Ricardo Tayar Lopez: [00:35:59] Yeah. That's why I love them. And now this is something that is about, improving your. Performance. so you have to have a look on the strategic part of it and also in the tactics. One of course, but, I really don't have to train so much my clients right now because, I think we started when we started.</p><p>Yes, we have to do that. But now it's not the case because most of the people comes because they have some references about our work or they know people that has been working with us in the last years. And, they come with a very good expectation for our side and. As I told you when we hear some clues that this is a very toxic client for us.</p><p>We don't want to go into the project </p><p>Guido X Jansen: [00:36:47] if you need to train people. Of course. That's easy. Go read that first. </p><p>Ricardo Tayar Lopez: [00:36:51] Yeah, I think that it's a very, I want to be so honest, so it's a very, nice commercial action to write a book. You don't do it for money? No, because you are not going to our money. there are people who are writing books are the people who's writing novels, </p><p>Guido X Jansen: [00:37:10] you write 20 novels, then you start making money.</p><p>I guess </p><p>Ricardo Tayar Lopez: [00:37:13] I'm just wanting to, but with this kind of a staff, You're really come to be someone confidence for a lot of people. And of course they read your book and some of them, not all, but some of them, of course also we'll have some haters, but about sure. Some of them will call you. You can say, Hey, I have read your book.</p><p>And I think this is very useful for my company. So that's why I tell you that we don't have to train people because they come train it, And also that was very important. Yeah. In the books from the beginning, I'm only writing about poets. I've been working. I'm not writing about the NASA or not writing about Apple or I'm not writing about Amazon because I've never worked before for any of those three, maybe one day, but not today.</p><p>So I'm only writing about poets that we've been working for in the last year. And I think that's very useful because this is not. About, Hey, take a look about what Amazon did. Amen. You've never been working in Amazon. How do you know that? Because you've been reading a lot of blog posts. It's the same thing that anyone can do.</p><p>so we are only talking from experience and I think that's the most important thing we can </p><p>Guido X Jansen: [00:38:25] do. </p><p>Ricardo Tayar Lopez: [00:38:26] Yesterday's brainstorm was so good. I really liked step's idea of running that test on the call to action buttons, making them orange will really make them stand out. Don't you think? </p><p>Guido X Jansen: [00:38:37] Yeah. Do you want to design real AB test winners and achieve enormous conversion uplifts, then stop, brainstorming and take a scientific approach. If you can read Dutch, follow the steps, then online influence many even book Delta now and ruling in the authors course and become an expert in applying proven behavioral signs yourself, go to &nbsp;dot com for more information and free donuts.</p><p>speaking of that experience, I would love to know. So you have the business now for seven years. Yes. And you've done, digital for longer than that. What were your biggest fuck-ups or your biggest assumptions that you have maybe about the clients? Where did he say shit? If I had known that seven or 10 years ago that he might have life much easier, what is it?</p><p>What are the things that went wrong? </p><p>Ricardo Tayar Lopez: [00:39:24] I think that something that is very hard to learn and as fast as you learn it, as Whistler for you is in what kind of clients you never have to work. You never have to work because it's one of us. Sure. It's very good doing somethings and some clients and some people it's really, to pay for it and they will be happy with your services.</p><p>But you really need to know as soon as possible. Who is your real target? Not everyone, because I think one of my main mistakes as anyone that starts running a business is a, I need clients. So I need clients now. So anyone? Yeah, anyone is good for me. You have money. You are going to pay me. You're a very good client for me and that's not true.</p><p>Guido X Jansen: [00:40:10] What made you, what make you a better selector of clients? </p><p>Ricardo Tayar Lopez: [00:40:13] I started reading a book. One of my partners to me, and it's called the undisciplined purchase of less, the alpha is of my count. And it's a book about saying, no, it's a book, it's a book about, Hey, you don't have to say yes to everything.</p><p>so you also have to learn how to say no to your clients. And it was very useful for me because in the beginning we'd have some problems. Because we were working with people that was very happy with our services and with people that was very hungry and to say, Hey, this is not what's going wrong for you.</p><p>yeah. So in across the years I identify several things that for me, it's like an alarm ringing, So you don't want the first one. It's about lack. Of briefing, So your only briefing is that somebody is writing to you and say, Hey, I want to improve my performance. That's all you briefing.</p><p>Yeah. Hey, if you don't have the time nine to look inside your business, to know you're around business, to know what it's going wrong and you don't take a, you don't want to take the time to explain me the right way. But what do you expect from me? That's a very bad side note. You're the one it's about time, so want to improve, but I want to improve next month or I want to improve tomorrow or I want to improve in two weeks.</p><p>that's not real. The other one is budget. So some people are saying, Hey, I want to sell. 1 million euros next year, this year I'm selling 100,000, but I have the same resources on the same budget for everything. So this is a little difficult, and this is something more subjective, but it's also about feeling.</p><p>This is our work based on relations. So you really need to have a good relation with your client. And if you don't have that feeling or is not other, would I be at work together and the other one it's, it's cool. Who is writing you or proposing you some kind of partnership. they say, Hey, if you improve my business this way, I will leave you 20% of my business.</p><p>So I always say, Hey, I will never give you. Part of my business if I believe in it never. so So I think this things are typical hours. Are we, that we always, taken the first steps, but it's very important to learn how to fix them, as soon as you can. </p><p>Guido X Jansen: [00:42:41] So the red flags are a short, shorter, no briefing, a short time span or expectancy of, of results.</p><p>The budget itself. And if they offer a partnership just run. </p><p>Ricardo Tayar Lopez: [00:42:55] yes. I'm also the kind of, the kind of relationship you have to the first conversation, and this is, I think that. Those are the main red flags for me. Yeah. I always say that I'm not your best option. Sure. In the market, you have options that fits your needs and the sandbox.</p><p>In my case, I, for me, it's really hard to understand that you don't take five single minutes to explain to me how is your business and how it goes. That's the line, Yes. Exactly. So for me, that's a very hardcore </p><p>Guido X Jansen: [00:43:27] and, even outside of your , even outside of these, these, points, do you already have a feeling about the business, whether it's a good client or not based on the vertical they're in the business that they're in?</p><p>if it maybe. B2B obesity is very generic, but do you already see, okay, this is B2B. They are doing a dishwashers. they're doing it this way. Day of during a service company. what are red flags or, maybe even positive signs. just based on the business model for four years, zero work.</p><p>Ricardo Tayar Lopez: [00:43:57] here we have a very ethical part of the company, so we don't work for some kind of business. So we don't work for the sexual industry. Yeah. For example, we don't like to work or we don't work in gambling or we don't work in what I call in a Spanish. I don't know the word in English, the pyramid, all this tractor pyramid game.</p><p>Yeah. Yeah, so we don't, but this is something about the company called the co the company culture. So we don't feel comfortable with, for four years, the way we thought or are ethical about B2B or B to C or this Wasser's iOS say that maybe we are now working with a company that design build opens on.</p><p>They sell it worldwide. it's a </p><p>Guido X Jansen: [00:44:50] business for, for pizza. </p><p>Ricardo Tayar Lopez: [00:44:53] It's like a, it's like the kind of old ones that they use in the hospitals, jails schools, all these kinds of very big opens. And you can, that you can manage to make food for. 500 people or 2000, and they are selling it on the, and they are selling it across the internet.</p><p>I think there are no real boundaries. The problem is that it's much more about the expectations you have. If you have never been selling an open online, you cannot be in the point that say in the next year I will sell 1 million over. Yes. Okay. What amount of falling South you sold this year?</p><p>Zero. So you want to move from zero to 1 million? Just like a miracle, so something that's not going to happen, but I really like to be in both in industries where I've never been before. So this is the thing that I really love about my job that I, have had the chance of learning about a lot of business models, business to business, to consumer administration, to administration, a lot of them, but I think that now.</p><p>We have the chance to improve any kind I'm completely Truett, any kind of business in India. Absolutely. Any kind, there are no boundaries right now. And I think that people are, it's a building, some technical stuff, some technical, some of the strengths in their regards can sell it across the world if things are done the proper way.</p><p>And with the time I think the problem was the same. It's about time. And resources and part of the resources she's time. Things are not going to happen fast. Because we want it to happen fast. </p><p>Guido X Jansen: [00:46:35] Exactly. </p><p>Ricardo Tayar Lopez: [00:46:36] everything it's time, your baby needs nine months. It's not going to be born in five months out.</p><p>So you want it, But it's a balance. This is very typical mindset that some companies have. </p><p>Guido X Jansen: [00:46:47] Yeah. He, you cannot always move things faster just to throw more by throwing more money or more people </p><p>Ricardo Tayar Lopez: [00:46:52] are doing. Of course. So you have all the money in the world. Probably you can boost everything.</p><p>but </p><p>Guido X Jansen: [00:46:58] it's still going to take nine months to build a base,</p><p>however much money you have. that's a great mindsets, to, to end our talk with, we can ultimize anything. ethics, aside that we can have our, restrictions there of course. and we should, as an industry, I think, but, we can improve it. </p><p>Ricardo Tayar Lopez: [00:47:17] Yes. Also, we always have to think that there is a.</p><p>The economy called classical? No, that was, that was developed. Bye . I don't know how to say in English, but it's a</p><p>that you input a lot of resources in something you are not going to achieve. Same proportion of outputs. So that's a classical. Economical low from the, I think exiting century, I think. And that's completely true. you cannot improve everything to a 100% success rate that's not possible. so you always have to be clear about that.</p><p>Amount of performance, that a company can have, because it's not real to say that you are going to sell at 100% level. So time resources, and also this kind of a staff </p><p>Guido X Jansen: [00:48:14] sharing us, your experience with, you and, Yeah, good luck with, the promotion and the sales of the second book.</p><p>Of course, we will definitely link to those in the industry show notes, we will link to those books for those that can read Spanish for those that don't, maybe just do a course on Spanish and then. Transitioning through this, this book, that will be a great start. already, you already know all the terms is zero, so there's a lot of English terms.</p><p>I, in the book, I assume. </p><p>Ricardo Tayar Lopez: [00:48:41] Yeah. that's all I feel in English. You only have to make the relation in one word for awhile, although yes. In the Spanish. Exactly. But by the main terms are in English. Of course. </p><p>Guido X Jansen: [00:48:49] Thank you so much. </p><p>Ricardo Tayar Lopez: [00:48:51] Thank you so much. Should be in a great production </p><p>Guido X Jansen: [00:48:53] luck to you and, talk to you soon.</p><p>Thanks so much. </p><p>Ricardo Tayar Lopez: [00:48:56] Thank you so much. Bye bye. </p><p>Guido X Jansen: [00:48:58] And this concludes season two episode 40 of this year, or both with Ricardo Tahara from flood one Oh one. And again, make sure to share this with your colleagues. If you like the content, especially when you work at an agency next Monday. In another episode, we switch to the client side.</p><p>When I talked with eCommerce conversion manager, Dave power, and we're going to learn a, how they quickly switched gears when the pandemic hits, basically almost people simply. Talk to you then, and always be optimizing.</p>",
  "show_notes": "<ul><li><a href=\"https://www.flat101.com/landings/covid19trends/\" target=\"_blank\">Flat101 COVID-19 Research</a></li></ul>",
  "guests": [
    {
      "id": "ricardo-tayar-lopez",
      "name": "ricardo-tayar-lopez",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/main-pitfalls-for-cro-agencies-working-with-clients.jpeg",
  "language": "en",
  "type": "podcast"
}