{
  "id": "online-influence-book-launch",
  "title": "Online Influence Book Launch",
  "description": "Together with the author we’ll explore what makes this book different from the books and content you already know from Cialdini, BJ Fogg and Kahneman.",
  "date": "2025-01-08T20:07:07.493Z",
  "duration": 0,
  "audio_url": "https://cdn.transistor.fm/file/transistor/m/shows/5036/918195e71945448f60e06144edd7bd8c.mp3",
  "transcript_url": "<p>Guido Jansen: [00:00:00] Today I'm talking with Bas Wouters. Last April, he and Joris launched at Dutch book about online influence. And this was such a big head that they're now launching the English version of that book. Together with nobody less than Robert Cialdini himself. In this episode, we looked to poor. What makes us different from the books and content that you already know from</p><p>and how you can join the launch webinars and both things about the Netflix series, the social dilemma. My name is Peter Nelson. And welcome to this hero podcast. You weren't winning podcast, where I show you the behind the scenes of optimization teams and talk with their specialists about data and human driven optimization my goal with this hero Cape with guys, it's a straight, a mindset of experimentation validation and improve quality standards and digital marketing, and hopefully make our lives much better in the process.</p><p>You can be an enormous help reaching this goal by sharing this or any other episode with your colleagues. And if you're not subscribed yet, make sure you are by checking this in your podcast app. It really means a lot. So thank you for doing that in case you missed the previous episodes. Last week, I spoke with eMoney Oliver, user experience and experimentation manager at the music magpie and declutter in UK.</p><p>And we spoke about optimization. For Zuma to Cozumel marketplaces, you can listen to the episodes &nbsp;website or in your podcast app that you're listening with right now, this episode, after your OIC phase, again, Maples will buy our lovely part-time online dialogue. SiteSpect online influence Institute.</p><p>Content square and comforted.com. Welcome to season two, episode 42 boss. Welcome back to the show and what a numb that she's amongst those that don't know who you are yet. Why are you the person writing this book? </p><p>Bas Wouters: [00:01:58] Why am I the person that writing this book? my career started off, in the online influence business.</p><p>I had a company and it wasn't a kitchen industry and this grew. Two very successful business, which I could saw good self, in 2016. And afterwards I get in touch with dr. Cialdini and I became one of his, 19 certified trainers in the world. And actually last week they said goodbye to a few trainers.</p><p>So now the only 14 certified trainers from him in the world. Which one, I am one of them. I'm also afterwards trained by BJ folk, the man who invented the term behavioral design. So I think a combination of knowledge and practical proven applicability makes me the guy </p><p>Guido Jansen: [00:02:50] you're the guy. but to be fair, You have a co you have a co-writer for this book, it's all lonely.</p><p>yours couldn't be here today, but, can you give us a short introduction of your sister background? </p><p>Bas Wouters: [00:03:02] Yes yours, of course, just as important. I am. Yours is a psychologist and he has a 20 year experience in applying proven behavioral science for better online results. And he did this for big brands like KLM Coca-Cola ING bank, and many more.</p><p>So he has a great track record and he has an amazing of knowledge and skills. </p><p>Guido Jansen: [00:03:25] So it's great combination, if I may, life as it. So you were more to the theory and yours is more to the practical side of the practical experience, or </p><p>Bas Wouters: [00:03:34] we both get the call and also have a theoretical foundation only from a different perspective, your work a lot for the bigger brands and set up campaigns.</p><p>And I was more like an entrepreneur. Made it happen in my own companies. </p><p>Guido Jansen: [00:03:48] And now you're writing a book about online influence. I think you already had a nice quote for that, but, as many people might think, okay, but don't, we already have books on online influence. why would we need another book?</p><p>And, maybe let's start off with the quote you got, as a result of the previous podcasts that we did. Someone being skeptical about this. </p><p>Bas Wouters: [00:04:09] That's a great story. I got a LinkedIn message a week ago from a CRO specialist from Allianz. And, he sent me a really cool case data.</p><p>So I, I reached out to him and we spoke on the phone and he told me I listened to your podcast. It's a hundred percent fair. You won this amazing award. So again, my, congratulations, but he reached out with a really cool, cool. A B test and, So we started talking and he told me he listened to your podcast.</p><p>And then he, was quite skeptical. I thought, there are so many books. And I read books from Ghana mom, and I read the book from Cialdini. what is more out there, but because he's such a fan of the field of work, he just ordered the book. And when he starts reading, he told me, he said I was done completely in one rush.</p><p>I read through the book because it read really easy and it was. New stuff. And, the pool, his part was when he came back to Alianza, they had, a challenge to upgrade the number of reviews. So he directly applied our suggestions and the first AB test there was directly successful in the, had an increase in reviews from 28 point 45%.</p><p>So that's a nice story because I can get the skeptical side and. What we wanted to do. We want not to prove the science again. There's a lot of books out there who approved the science behind how behavior. So we come from a perspective. Yeah, we know there's science out there for people who never heard of the science.</p><p>We shortly explain it. And then we make the statement, okay, assume this is the truth, because this is not our good ideas. It's not the good ideas of people who wrote books about is this is built on more than a hundred years of research around the globe. Only we want to make it practical. And I think that's the big difference from our book.</p><p>It's a complete practical guide. How you can upgrade your online results based on the BJ fault model. And I think we are the first one in the world who use this model in a book. And translate it to online and give the reader design principles for each of the actions of the beat access of the BJ fault model.</p><p>Guido Jansen: [00:06:30] So it contains,</p><p>contains a bit of a , but you also try to apply this to a practical standpoint. So the intended audience seems to be a bit different than maybe those books are, as, children, he wrote his first book, was 1980. Two or three, a long time ago. there was no online, I assume a lot of those, examples in the books that you have, in English version are still also applied to online.</p><p>I haven't read the English version yet. </p><p>Bas Wouters: [00:07:00] Yeah. Yeah. Like you would have the Dutch version and it's the translation with a minor change in some examples, because in the Dutch version, we of course use some Dutch companies, which we changed to more international companies or the theory. And our advisor stays the same, </p><p>Guido Jansen: [00:07:18] but the intended audience for this it's very practical.</p><p>Is it like, is it, digital marketeers? That's the audience? Is that the, </p><p>Bas Wouters: [00:07:24] everybody. Who wants to increase their online results is our audience. And that could be from an online marketeer. Who's really doing the work or copywriter or a UX design, also a manager or even a. Chief marketing officer could be the audience of all forms perspective to guide their people or to be creative designing campaigns.</p><p>So I would argue our book is fateful. Anybody who wants to increase the online, </p><p>Guido Jansen: [00:07:58] it is mainly for online, users. would you say it's also. Does it mean it's not applicable to offline all the examples or would it also be just as well? It's just happens to be very, being applied to online. </p><p>Bas Wouters: [00:08:13] Really good question.</p><p>Actually, I would say everybody could benefit from reading our book. of course we translate the theory to all line, but if with a slight imagination you could translate it to. A sales conversation to talking with your friends who you want to, persuade of believing something or doing something.</p><p>So it's a pluggable all out your life. I would say only we translate the theory into online examples, but behavior design, behavioral science, and it's based on how. Our decisions and behaviors comes to life. So this. Does not only is applicable for online. This is just everywhere in our daily life </p><p>Guido Jansen: [00:09:03] for over 10 years.</p><p>Now, all my dial-up advisors about evidence-based conversion optimization with a focus on data and psychology. We see that analyzing data and recognizing customer behavior results in a better online dialogue with your clients and a higher ROI that team of strategists, analysts, psychologists, and UX specialists.</p><p>Gathering valuable insights in online behavior of your visitors and together with you, they optimize the different elements of your Ciro program through redesign expert reviews, AB test and behavioral analysis. For more information about their services, go to Oman dialogue. Let's go. It's funny how we now say okay.</p><p>yeah, what happens online? It's still. human behaviors. So we can also apply it offline while at the beginning of my career, I had to explain the opposite. I'm sorry. Okay. Yeah, we do. The oldest Alzheimer's also works online. Really. It's still human behavior </p><p>Bas Wouters: [00:09:57] change really quickly. </p><p>Guido Jansen: [00:09:58] Exactly.</p><p>Exactly. yeah, the comment that, that stood out, you just said, For Molly also, I read through it, in one go, I read a couple of reviews of the ditch version of the book. I think that was a common review that at this stood out for, for me, because usually. those books are more like a manual and say, okay, I'll currently, I'm struggling with our XYZ campaign.</p><p>Let's go into the book, a page 300. Oh, that's about, I don't know, email campaigns. Let's go through the practical steps and apply it. It doesn't necessarily. Those books, usually, don't just, you don't start reading at the front. And, one day later you're at the back, finished the book. That's usually not what happens.</p><p>So that's I think, really stands out already. Can you tell us a bit more, how did the first batch go in, afforded that version? </p><p>Bas Wouters: [00:10:44] Yeah. In the Netherlands, we were super pleased with, winter launch. We were sold out with the first batch on pre-orders. the demand for the topic, was quite high and it was of course a great for us.</p><p>And, after our launch, we were 30 days, the number one best seller on the management book bestseller list. So that was really successful launch. We were, of course, really pleased with. and what I even more pleased was, of course you want to sell the book, but what you want really want</p><p>Guido Jansen: [00:11:21] reviews behaviors. So we can also apply at the beginning of my </p><p>Bas Wouters: [00:11:25] career, explain your success. They could make their clients happier. They could let the business grow. So we got great comments and that's really. Made us really </p><p>Guido Jansen: [00:11:36] happy. Do you think, the whole pandemic situation, that it's, does it help your book or did you see more people have time to read or something or?</p><p>Bas Wouters: [00:11:45] I won't argue I'm pro COVID, but our topic. Yeah. I think it definitely helped us because suddenly everybody was doing things or wine. I corporates who weren't used to working from distance, suddenly had to. So the topic online influence. Once I think it couldn't be off then in another timeframe than now.</p><p>Guido Jansen: [00:12:08] Exactly. And now in English version. So w why are you making an English version? Is it wasn't always the intention to do an English version or? </p><p>Bas Wouters: [00:12:15] Yeah. Yes. It was always our intention. And, because my connection with, over Cialdini, we spoke about it. during we were writing the book in touch. We all.</p><p>Already translated to English show Cialdini, look what we are writing. And we collaborate on the book. So it was always the attention to it in English. but of course, because of the success and the time period where we live now, we speed it up the launch. So actually we launched in April and all the ones.</p><p>So now six months later, we already have a plead translation with. New examples and, ready to launch English version internationally. </p><p>Guido Jansen: [00:12:59] Yeah. And as I understood, it's not going to be acquired launch. </p><p>Bas Wouters: [00:13:01] I hope so. We'll be quiet. No, we're going to do everything we can to make this a big celebration for us, but also for everybody who will join us at the webinar for the launch, because we invited, Over Cialdini.</p><p>And he was actually pleased to join us for the full one and a half hour. people get free access to Cialdini, which is quite unusual. </p><p>Guido Jansen: [00:13:26] of course </p><p>Bas Wouters: [00:13:28] he is open for questions from the audiences. He will tell a really cool story about himself, but most people don't know before he. Describes his six principles.</p><p>I laid her on the seven principles of persuasion. He was undercover actually for more than three years and he will set up this undercover story, how we did it and what happened during this time. So that thing, that's a great story to listen to. Also, he will share his favorite online influence example, and he will share what his, in his opinion is the best.</p><p>Principal from his seven principles to use online. That's the Cialdini part. So he is fully on board, which is great. We will set out to highlight from a book and a minimum of 15 case study to inspire all the participants for day, their next marketing campaign. And we want to be out there. So we will be, we will be live at the New York times.</p><p>We will be in the economist. We will do a lot of, big campaigns. I just was talking to you. And I said, we will aim in our social targeting for over 40 million views. So we hope that a lot of people will join us for this celebration of </p><p>Guido Jansen: [00:14:43] mobile. And, children and joining that's a, that's already unique.</p><p>You don't see him online, that much, for, especially not only in a free webinar. Do you actually know how much, children he works for, online companies, </p><p>Bas Wouters: [00:14:56] how much time he's been asked to train them or? </p><p>Guido Jansen: [00:15:00] Yeah, usually his books and, he's in a cover story. th those are mostly based on offline, offline, persuasive tactics.</p><p>So has he been working lately with a lot of online stuff? Do you know? </p><p>Bas Wouters: [00:15:10] Yes. I know actually, Cialdini is revising his, book on influence and, It's asked by his publisher to do a last version and youth more online influence samples. And actually we returned the favor reciprocity work examples.</p><p>Yeah. Yeah. Also Danny asked our advice to get as much as examples as possible to use in history. First revised version of </p><p>Guido Jansen: [00:15:38] influence. I would like to know a bit more about the content of the bookers itself. what w what can readers expect to learn from it? assuming for example, that they already know about that already to read the children's book, they already know about the BJ folks, a model.</p><p>what does the was x-ray in the book besides the practicality, but what are the things that we are going to learn? </p><p>Bas Wouters: [00:15:59] Yes. happy to discuss. I'm also happy you brought up this topic because my connection with Cialdini is sometimes people think, Oh, they write a book and they put Cialdini's principle in an online code.</p><p>That's not what we've done. Of course. It's principles are named in the book, but not the full seven, only four. So let me explain what's inside the book as a foundation, the BJ Fogg behavioral model. I don't know if all listeners are familiar with the model, so I will quickly explain it. The model of BJ fork.</p><p>Explains how behavior comes to life. So he said, as behavior comes to life, when people are in the same time, motivated enough to do it, they have the ability. It's easy enough to do it. And there's a prompt at that same moment for the desired behavior of all these things. Three factors, aren't the right balance.</p><p>People will do a certain behavior. </p><p>Guido Jansen: [00:16:58] Marketing Reggie's have suffers. And the sheriff for AB testing has been impacted too. If you want to keep that thing to enterprise standards, but save 80% on your annual contract, you can consider comfort, but there's summer release. You can take advantage of full stack and hybrid features, strong privacy compliance, no blink.</p><p>And enterprise grade security feel good about your smart business decision in Fest? What you save back in your CRO program, check out www &nbsp;slash 2020 BJ folk has a behavioral formula for this. Saying these three things need to be in place, or at least, in a high enough volume they need to be, available before behavior occurs.</p><p>And, w we'll show we'll get a, at a link to the show notes. if you want to quickly look at, the graph, for that. </p><p>Bas Wouters: [00:17:52] Yeah. Yeah. that will be great. So that's our basic foundation and then. We make decisions. So we explained that based on current amounts research is the one system too.</p><p>I won't deep dive too much because I think the most of your listeners are familiar with his work. I also, </p><p>Guido Jansen: [00:18:09] yeah, if not, again, no shame there. we'll have links in the show notes explaining those, those things. </p><p>Bas Wouters: [00:18:16] Yes. So some show notes and what we've done. We make choices based on what they call psychology eristics and biases.</p><p>and we have Hondas of your risks and biases, which we often see. on webpages, then they say, Oh, we have this juristics and these biases, this is how you can use it online, blocks, fully written, but it has no structure. So our structure is the four behavioral model and we took the 37 principles that we know from our own practice are highly successful to upgrade your results.</p><p>And we put them on this access. I think the most unique and I never saw any broad about it is that we also described. Cool techniques. We described several techniques to make the most efficient phones. So the thing that asks for the behavior, first of all, it needs to get attention. If people don't see your prompt, they will never build a behavior.</p><p>You are, </p><p>Guido Jansen: [00:19:11] your website itself, it can be very user-friendly, it can be, persuasive as hell, but. If no one knows about your website, if they're not prompted to go there, no, one's going to buy it from you. </p><p>Bas Wouters: [00:19:23] Simple examples of that go to your website. You will never get any covert version. Of course.</p><p>And then you have the other side, if you overpromise people. </p><p>Guido Jansen: [00:19:32] Yeah. Usually it's the other way around, right? when I started, doing conversion optimization for a lot of companies, Usually the traffic is not the issue. they're buying a lot of the traffic, but then people get stuck on their websites either.</p><p>There's a lack of ability or like lack of motivation. They are prompted they're on the website and then they're like, okay, now what? </p><p>Bas Wouters: [00:19:49] Yeah, exactly. Exactly. Yeah. So we have a married one, one case that you will hear about in the webinar they join is for example, with a small, simple change, how say up the comment factory upgraded conversion with 2000% just.</p><p>By thinking on a different prom strategy and, another, lovely case about forms, which I can explain. It's in Holland too, we have open calm. That's basically our Amazon and, this campaign, yours did, and he won the first CRO award in the Holland, in the Netherlands, the conversion rate optimization award by changing their forms.</p><p>How to get, how to ask for a review and the number four reviews doubled. So also this case, we will explain how we did, but I think this, the really unique thing in our book, because I didn't see blocks somewhere before, when we did some research that describes prompts strategies. So that's I think an outstanding part from our book.</p><p>Then the next one I think is outstanding. Get, we learn people to do problem solving. If people don't do what we want them to do, whether it's offline or online, we always think they are not motivated enough to do what we want to do, but actually according to BJ folk and according to our own research, that's the thing, the other way around.</p><p>So fortunate. Formula is B is map motivation, ability, prompt. But if you do problem solving, you go from front ability to motivation, probably just stop. But the ability is something really interesting because actually you make your desired behavior easier to do, or because it's easier often your visitors will be much happier with your website.</p><p>So it works two ways. So that's interesting. And, of course we know how to boost motivation in the moment, just in the moment before making a decision only this is the hardest part. And also there are not, there's also not too much really content in an online way that people say, okay, motivation is the hardest part because research motivational ways I could wake up and it could be very motivated.</p><p>To work out. And when I see myself in the mirror, I think boss, you need to work out more, but the same day I could sit on a terrorist in the sunshine and think, I like a beer and a steak it's conflicting, but this is how motivation works. So motivation is never on the same level to do something. If something is easy, it always takes.</p><p>Guido Jansen: [00:22:33] Yeah. and motivation. Doesn't always. the domain, the term motivation, often seems to mean Oh, I want to do something, but it doesn't necessarily in this context, doesn't necessarily have to mean that way. The exact same thing. The example I usually give is, filling in your tax papers.</p><p>Almost no one is motivated to do this properly. but you are in terms of this formula, you are motivated to do it there. to do it on the website of your local tax, institution, because that's the only way. And it also works with, if you want to buy a product, maybe you're not necessarily motivated to do it at someplace, but if that's the only place you can get this product that you want, you are very motivated in that sense to buy it there because that's the only option you have.</p><p>Bas Wouters: [00:23:15] Absolutely. And then the last example is a great example of the scarcity principle, which definitely is in the motivational acts. I like to say this. Because this is really great stuff, but you're talking about Hito and also with taxpayers, you're not pretty motivated to do but if you don't do it, you can get some penalties or pay more interest and that's the motivator to start leaving it.</p><p>Guido Jansen: [00:23:42] Yeah. it's the motivation here is not the carrot, but it's a stick. So we're talking about online persuasion and, persuading people to change their behavior. you may have heard of, the social dilemma on Netflix. so what's your stand in this? I don't know if you've seen it, but you probably know, at least what it's about that there is not.</p><p>Necessarily a lot of people that like to be influenced whether it's online or offline. so what's your stance on it? Stand on this. </p><p>Bas Wouters: [00:24:11] We going to talk here about ethics. We also described the check the about ethical use of this, principles in our book and my stance. If I answer, before I answer your question, I will put a general stent point of view.</p><p>You cannot argue in my opinion, whether this. Principals are ethical or not, because it's just scientific research that shows how we make choices. I think the outcome and what you do with it is if it's ethical or not, we did five, six things in our book, way, in our opinion, it's a minimal checklist, that you need to can answer with.</p><p>Yes. To say it's ethical. And one of that discretion is a basic question, for example, is it true? What I say? Would I tell this to my father model brothers or sisters? </p><p>Guido Jansen: [00:24:59] it depends a bit on your relationship with your family. Maybe you have a good relationship.</p><p>Bas Wouters: [00:25:08] That was the starting point. But otherwise you can say your best friend or, but then you get again &nbsp;yes. </p><p>Guido Jansen: [00:25:18] And any person you, you have in a high regard, and we'd like to be honest with </p><p>Bas Wouters: [00:25:22] yeah. That's the best Raven. I know, of course. Is it wise? It's for example, and why should we mean if this person now does what I asked him to do?</p><p>Would he want to do something for me the next time? The answer is no, probably you shouldn't do this request. Now back to your question about the social dilemma. Of course, it's a complicated thing. I think as these companies, we know they really base their strategies on behavioral science. And if the outcome is you get paid, make people addictive.</p><p>And even that goes so further on the people commit suicide. I think you have to take a responsibility and do something about it because this could never be the ID behind the first launch of this app. The first idea was always to do something good for people. And when it from something good, because. It becomes something bad.</p><p>I think you have to redesign your ID, </p><p>Guido Jansen: [00:26:28] but you, but just say, okay, these principles, that just based on science, the principles itself are not necessarily good or bad. but you could also say, okay, but we don't necessarily know how human behavior works perfectly. the things we do know those are, maybe we know 5% of it.</p><p>I don't know. maybe it's. 80%. I don't know. I don't know what depends on the range, in the measurement you do, but we don't have a complete picture. I think we can agree on that. We don't have a complete picture on how human behavior works. so isn't it unethical to start with, if you want to try to change it, if we don't have the full picture.</p><p>Bas Wouters: [00:27:05] Yeah. Good question. And I think I, yeah, I agree with you, especially we. Come to understand more and more of this material, especially with neuroscience. Now, of course they really see what parts of the brain light up and which parts doesn't. So we see more and more interesting. Research, but yeah, I agree with you that's that, but the ethical part is always some gray area.</p><p>I think for some things is this is still ethical and a lot of person could argue, this is totally unethical already. &nbsp;</p><p>Guido Jansen: [00:27:42] worldwide unique, AB testing, personalization and product recommendation solution SiteSpect works service sites without any tags or scripts, which guarantees an optimal performance, the SiteSpect solution eliminates delays and the chance of any flickering effects.</p><p>And this approach also ensures that the current and future browser stretcher rules like ITP and ETP don't make an impact on your AB testing and personalization for more info visit &nbsp;dot com. Interesting one. And it depends on your perspective if already, if you think if that's a goal ethical alarm, so that's already making, it's a very difficult to discretion.</p><p>And another thing to add. I always say people, when people tell me how, but it's not, nice to be, to do to apply a persuasion or something, but it's impossible not to do, to apply persuasion. You always try to persuade something. The person telling me this, it's trying to persuade me to change my behavior.</p><p>So in the way you clothe yourself, the way you look, the way you dress. the way you communicate anything, it's all persuasive. </p><p>Bas Wouters: [00:28:48] I completely agree. I often argue indeed that almost any conversation we have, there is some goal about this conference </p><p>Guido Jansen: [00:28:57] with trying to get people, to buy a book now, to go to your webinars.</p><p>Bas Wouters: [00:29:04] We don't want to pay them money yet. </p><p>Guido Jansen: [00:29:06] It's just a free webinar. But that's the whole point, right? It's not necessarily, there's no non persuasive communication. I mean that's going to be a really hard not to include any persuasion in there. Especially doing this research online and your book is a good example of that in trying to understand the, those impacts that we do, I think is way more important, than just trying to ignore it and then just do whatever I think that's way more riskier, right?</p><p>And then you try to influence behavior and you don't base it base basically on any research that can have way more, bigger adverse effects. then if you don't take those into account </p><p>Bas Wouters: [00:29:46] completely, I agree. And even I dare to argue that also the person that we want to persuade, if you tell almost information, the receiver of this information will be happy with this information.</p><p>When I book a hotel and the number of reviews and the reviews are true, I'm happy that I can read them because I can make a better choice. if I want to go to a super nice restaurant and I know this is the last table that I can reserve for this time and this date. And I notice, I really happy that I know it's often scarcity is often used in a false way.</p><p>Only, but when it's true scarcity, I want to notice because I can make a better choice myself as well. </p><p>Guido Jansen: [00:30:31] Exactly. Yeah. Can I still buy this if you are not? I don't want to know if it's truly the last one I really want. </p><p>Bas Wouters: [00:30:36] So I, it also helps people to make better choices and that's the ethical part.</p><p>And then it's what, like we said, it's a gray area, but we, in our book, we. Describe this, and we give six questions as a guideline to the reader. I think these six basic guidelines should help people to get win-win situations. And as long as that's your goal, your client is happy and you can make money or you have a better reputation or what's the outcome for the company or for the other person is when, as long as it stays, win-win these principles.</p><p>Work </p><p>Guido Jansen: [00:31:13] for everybody. Exactly. I think that the biggest issue, that people have with it is maybe even when it's win-win the win for the other party might be much bigger. And, and if that's clear, that's fine. But if that's, if that's not obvious, if people are kept in the dark about what the actual.</p><p>The motivations of the other party are if that's obscured, maybe intentionally. So then that's where people find themselves. </p><p>Bas Wouters: [00:31:37] Exactly. And then again, we go back to this question already mentioned if this wise to present it like this, because you're intentionally, setting up a deal when somebody finds out later that he starts hating you.</p><p>What really? The answer, the question is it wise to do should be no. And then we advise people go back and redesign your </p><p>Guido Jansen: [00:31:58] office. Yeah, probably if you, want to figure out that I was reading this article about how to handle this, with, with kids when they're persuaded in, into, showing these repeat behavior, Hanging on Dick, talk for hours talking about case, but my girlfriends do it doing the same.</p><p>but it helps to take a person out of that conversation, out of that behavior at an ask them. Okay. What are your, what do you want to achieve this year or with school? Do you want to succeed in school? Yes, I want to succeed. Okay. But then. Then you need to do your homework or you need to study for something.</p><p>Yeah. I need to study. Does it help, achieving that goal if you're on tick-tock for hours? no it doesn't. So then you see, and you can do this, of course, also with, the clients that you have to figure out, are we actually helping them or not? if they, if you take them out of this behavior and will they still actively choose to do do you think that it helps them in that way?</p><p>And, I think that's. Probably has a way bigger effect on the long-term for your long-term success as a company, if you actually provide that long-term value than when it's only short-term, effects. But I think that the, a big problem there with lots of competition, I think with Facebook and tick-tock and.</p><p>of course those are the favorable, and, but I think that's almost at any company that the incentives that we all see as employees at a company, those are often short term incentives. </p><p>Bas Wouters: [00:33:17] Completely agreed. that's also human behavior again. only I know from a true fact, if you have a longer run and a long it's already, if you take something for a year and not only tomorrow, A year is pretty sure you can do outstand.</p><p>You can bring outstanding more success for your company. Then your only think what will happen tomorrow. That's argue. And then a year is quite short. I want to add something either because it's just pops up in my mind. You mentioned these big companies, Facebook take talk. we know the Netflix, Amazon.</p><p>And often people think, ah, this material is only for them. They have the budgets, they can hire all these smart people and they have these big teams. And actually, I want to say to all the listeners, that's not true because in our book we describe such simple changes that is from buying even costly. And otherwise it's at a really small budget.</p><p>With huge outcome from Cialdini. They know he knows the names, it a small, big, so a small change, big outcome. And actually, I want to, there's a lot. I like to share with the listeners, everybody who understands this material can. Great to success, whether you have a big budget or a small, </p><p>Guido Jansen: [00:34:40] there are a lot of practical examples right?</p><p>in the book. So you can apply this. And this is also Mendez as like a guidebook. we already discussed people are just reading through the whole book. Can I also just, is also meant for, to be on my desk the whole time. and I, Oh, Hey, I'm currently designing this.</p><p>Let's go to the book. Is it? </p><p>Bas Wouters: [00:34:58] Yeah. Thanks for asking it because the answer is clearly yes. We want to re write a book, that you can have on your desk. And this is how it builds. We go from these excess, just like we talked about, then we have a chapter about choice architecture and I'm probably the last.</p><p>30% of the book is only practical application. You can go to a chapter, how to design email for tide and how to design a display ad, or how to design a landing page or checkout page. And you'll get an advice and completely at the end of the book, we have a checklist that I checked all these questions, and we have a list with ideation problems.</p><p>So ask yourself these questions to inspire yourself. To make your next campaign better. So definitely yes, a book. what we would like that you put on your desk and use it on a daily basis? </p><p>Guido Jansen: [00:35:51] My final question, on the book itself, I assume there's no sexual. Buying behavior during pandemics.</p><p>But if you would add a chapter, sir, on that specific, topic for businesses preparing, maybe for the upcoming holiday season, during this, this, dynamic, what would you write for them? What would you advise them during a </p><p>Bas Wouters: [00:36:10] pandemic? It's a good question. What would I find? Of course, it's little bit, different advice to the industry you are, because at the moment, if you are a restaurant or a travel agency, I will give you a different advice than, probably the industry where I came from the kitchen industry, because this industry is growing rapidly actually, because everybody is at home.</p><p>different advice, I would, certainly. Advise them away of frustration to have the right communication with the employees and the clients, and maybe ability also focused on the ability, maybe ability to stay in touch and to let your clients approach you and let your people approach your clients, design this, and also an ability what I think, but I think most companies already done.</p><p>Make sure your employees who work now from home, have a good ability to do their work from home. That's probably the best advice I can give at the moment to, through a lot of companies. </p><p>Guido Jansen: [00:37:16] Yeah. And especially now that things, seem to take on a bit longer than, than we may have expected in the beginning.</p><p>You can say, okay, for three months we can all make it work. But if it takes a long time, then, frustrations might, might rise. and things gets, Yeah, you got frustrated with, things faster maybe now that you're, working from a distance, maybe it can be described description itself can also be the chair you're sitting on.</p><p>Bas Wouters: [00:37:41] Yeah, exactly. That's things that increase the ability because in the beginning you can boost yourself. So you are motivated to always set a home office, but now it's running for months. And I think still, I hear people talking, I doubt. Where are people working as hard from home, and then again, they go back to the motivational impact.</p><p>Make it, the ability for your employees to work from home really high and they will see better results. There will be a behavior design at five that I will give them during this pandemic. </p><p>Guido Jansen: [00:38:17] the webinar will be an, on the 28th, right? October 20th. where do people go to subscribe? </p><p>Bas Wouters: [00:38:23] October 28, 7:00 PM.</p><p>Amsterdam time? that means 1:00 PM. New York time. they go to online influence.com/webinar. </p><p>Guido Jansen: [00:38:35] And again, it's free, right? </p><p>Bas Wouters: [00:38:36] It's free home percent free, no strings attached, and you get full access, to a lot of business cases to Robert Cialdini, we will do an online influence quiz. If you win this quiz, you get to answer your personal question.</p><p>To dr. Cialdini himself. So it will be a lot of celebration moments if it's </p><p>Guido Jansen: [00:38:55] my suggestion for the question will be a what's preservation principle, number eight. </p><p>Bas Wouters: [00:39:00] Wow.</p><p>Guido Jansen: [00:39:05] Thank you so much. If people already think, Hey, maybe this book is something for me and I already want to buy the book. where did they </p><p>Bas Wouters: [00:39:11] go also to online influence.com? Yeah. Slash book, or just go to online influence.com and see in the navigation, the book will have the link. </p><p>Guido Jansen: [00:39:21] Perfect. And we'll also have the add these links of course, to the show notes of, of this podcast.</p><p>one of my final questions for you, boss, w what is an insight, maybe, also created, during the process of writing this book? What's the insight that you think, you may have that you, think others. In our outside Ciro, may not have, </p><p>Bas Wouters: [00:39:39] I already told at one time a journey in this podcast, but I think a big insight, should be people don't do what you want them to do.</p><p>Don't first start to boost motivation. First, check your prompts, then check. Can we make it easier for the visitor to do and as last thing or motivation? </p><p>Guido Jansen: [00:39:59] Yeah. So first you need to figure out where the actually getting stuck. Yes. Not necessarily where, but also why. Whereas </p><p>Bas Wouters: [00:40:07] in the moment that we want to want a person to do a certain behavior, is there a prompt that asks for his behavior?</p><p>Yeah. And often if you ask that basic question and then the second question is this the best prom strategy? If you ask those two questions, you go already often increase conversions and quite easily and costly. Oh, of course effectively. </p><p>Guido Jansen: [00:40:34] and, thank you. thank you for that. Boston, my final question for you.</p><p>I have a feeling you're going to suggest, but, who should I invite for the upcoming an, an upcoming Ciroc Fe episodes? And, what should I ask them? </p><p>Bas Wouters: [00:40:46] I that's an easy one. Of course, he though, that will be global Cialdini. And you have to ask him about his eight principles. </p><p>Guido Jansen: [00:40:53] exactly.</p><p>Yeah. actually both. I've heard you are a very well trained in persuasive principles, so I assume you will be able to persuade him to come on the podcast. </p><p>Bas Wouters: [00:41:03] I'm going to definitely ask it for you. Thank you. </p><p>Guido Jansen: [00:41:07] Thank you so much for, for joining me on the podcast. we'll definitely check it out.</p><p>we'll subscribe to the webinar. I hope to see you there and maybe we'll figure out what the eighth principles </p><p>Bas Wouters: [00:41:18] that will be. Great. Thank you for being here. He though it was lovely. Again, speaking with you, </p><p>Guido Jansen: [00:41:24] talk to you soon. Bye-bye. And this concludes season two, episode 42 of the zero podcast with balsa Baltar's from the online influence Institute.</p><p>Make sure to subscribe to their free webinar for Online Influence. And please share this episode with your colleagues. If you like the content, especially when you think your website can use a bit more perspiration. Next Monday, I talked with two months &nbsp;who works as a senior conversion rate optimization manager at the Milton national cyber security and enterovirus provider.</p><p>‍</p>",
  "show_notes": "<ul><li><a href=\"https://onlineinfluence.com/\"><em>onlineinfluence.com</em></a></li><li>Subscribe to the free online Webinar (October 28th) with Robert Cialdini and both authors through <a href=\"https://www.onlineinfluence.com/webinar\" target=\"_blank\">onlineinfluence.com/webinar</a></li></ul>",
  "guests": [
    {
      "id": "bas-wouters",
      "name": "bas-wouters",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "https://youtu.be/ZpUU4E1xXd0",
  "main_image": "src/assets/images/episodes/online-influence-book-launch.jpeg",
  "language": "en",
  "type": "podcast"
}