{
  "id": "optimizing-for-friction-with-roger-dooley-and-bart-schutz-online-dialogue",
  "title": "Optimizing for Friction",
  "description": "We learn to remove friction from the customer experience, what the possibilities and limitations are and what the must underutilized persuasive principles are",
  "date": "2025-01-09T14:36:18.242Z",
  "duration": 2066,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/cf0bce51.mp3",
  "transcript_url": "<p>Guido: So for, Roger, for those who haven't seen anything from, from Roger yet, author, keynote speaker, both guest hosts also. So this should feel familiar. And, author of books to persuasion slides Brainfluence and, lays the one, friction, the untapped for that can be your most powerful advantages</p><p>Guido: [00:01:15] Very good. And, so I assume you brought your, friction goggles, right? </p><p>Roger Dooley: [00:01:19] Yes. I didn't bring the physical ones with me, but I do actually have a demo pair that sometimes I carry around, but all my friction goggles are always present in my mind. </p><p>Guido: [00:01:28] It's good. so I would definitely read the book then you'll know about the goggles </p><p>Roger Dooley: [00:01:32] and that long string subtitle took weeks of negotiation between me and McGraw Hill to arrive at.</p><p>And finally it was like, whatever, this is good </p><p>Guido: [00:01:42] enough. It was an AB test. What the title? </p><p>Roger Dooley: [00:01:44] no, they aren't into a testing. </p><p>Guido: [00:01:48] So I saw some, improvements to be made with, </p><p>Roger Dooley: [00:01:50] although I did do some actual testing on the cover and the cover design, using eye-tracking some other tools. So there was a testing component involved.</p><p>Guido: [00:02:00] Nice. </p><p>Audience: [00:02:01] And, </p><p>Guido: [00:02:01] we have, Bart squirts, chief psychology officer at online dialog. Keynote speaker at every CRO conference around the world, and an active consumer psychologist. And I'm also active as a nip. what's your executor, the name of the committee again, </p><p>Bart Schutz: [00:02:19] it's the sections for economic and consumer psychologists.</p><p>What do you guys do there? And I'm chairing the board. It was just easy. Cause I found that the section, it was very easy to become. </p><p>Guido: [00:02:30] That helps that's the trick. </p><p>Audience: [00:02:33] first, so </p><p>Guido: [00:02:34] we're talking about psychology and friction. I think that's a, an easy win. So Roger, so the friction is always bad. Let's start with that one.</p><p>Roger Dooley: [00:02:46] Actually, friction isn't always bad. It is bad most of the time. And generally it slows down progress. In most fields. It makes customer experience worse. It makes employee experience worse, which reduces employee engagement, which there's a huge crisis in today. At least in the United States with employees not being actively engaged with our company.</p><p>It determines a which region succeed and fail and this sort of, but it can be used in a positive way to steer behavior. if you have two paths, adding friction to an undesirable path, assuming it's in the interest of the consumer or the employee can be a good thing. Yeah. </p><p>Guido: [00:03:23] And the Barts I hurt you. </p><p>Bart Schutz: [00:03:25] I do not agree.</p><p>That's </p><p>Guido: [00:03:28] why I didn't prepare any questions because </p><p>Bart Schutz: [00:03:31] I think it's a, it totally depends on whether a consumer is better off or it's more persuaded with our, without friction. We have a lot of examples where adding friction actually, helps sales, and desire popups in front of your screen, which has to click away, which actually increases conversion rates are.</p><p>yeah, it totally depends. And I think that's the nightmare of psychology. That it's human behavior. It's very complex. It's dependent on internal brain processes on external situational factors. And in that complexity, we are very not good in predicting what's going to work or not. And that also applies for friction in an analyst.</p><p>We have a seeing &nbsp;and I think that like an offer of the cases without the </p><p>Guido: [00:04:18] friction, there's no shine. </p><p>Bart Schutz: [00:04:19] There's no shine without friction. And so it can be a very good thing. For the consumer, right? Elsa. friction for me is also making products comparable. So people are more following their intuition.</p><p>When they choose and it's a less rational tourist, but at least they, So if you're presenting, for example, hotels, I think it's adding friction that you emphasize different aspects of the different hotels. So one hotel will have a very good restaurant. The other one will have a perfect view. And the last one is very easy to reach.</p><p>Whereas all three of them have a good restaurant are easy to reach in there. I have a perfect view, but by. Emphasizing these aspects, people are more easily choosing spend less of their time of their lives, considering which hotel. And actually they're more happy with our chores afterwards. So is it a bad thing?</p><p>I don't think it's a, it totally depends. </p><p>Roger Dooley: [00:05:10] No, it does depend. And I think, for example, the popup example is great. I hate to say it, but on my websites I have a popup to subscribe and it does convert. but at the same time, if you're looking for longterm, longterm customer relationship, you will never go to Amazon and see a popup.</p><p>they're very focused on a very smooth customer experience. So it just depends on your objective. </p><p>Bart Schutz: [00:05:34] Yeah, it </p><p>Guido: [00:05:34] does. It's also a longterm versus short term thing. Like the popup works right now. I would be the longterm. </p><p>Bart Schutz: [00:05:41] I think, a consumer decision with friction will. On average leads to more loyalty than very easy choice, right?</p><p>if you're at tonight, persuading each other, it's better to play hard to get then to be very easy to get, right. In terms of loyalty in the long run, animate says strange metaphor, but I think if consumers are more interacting with your platform, Because she didn't make it too easy. It might turn out that they see themselves as interacted with the platform on a longer term.</p><p>So strategically it might lead to longterm or loyalty. If you make it a slightly more difficult. </p><p>Roger Dooley: [00:06:23] Okay. That'd be a great test. Yeah. It's and I would predict, but in different circumstances that you might get different results. Sure. The, in fact, some brands are famous for adding friction to their process, try and buy a Lamborghini.</p><p>For example, you're not going to. Unnecessarily necessarily just pop down your dealer and drive away in one. You may have to preorder it. You may have to go to some distant place to pick it up and so on. And that's true, </p><p>Bart Schutz: [00:06:48] but you'd send a Tarion easy daily products. You shouldn't add friction. </p><p>Roger Dooley: [00:06:52] Right?</p><p>Lamborghini was real easy to buy back every one after that's been difficult. </p><p>Guido: [00:06:57] Yeah. It's so annoying. do we already have questions about how to play hard to get or friction or psychology? Who wants to go first? It's the best one. We all remember that first question. </p><p>Roger Dooley: [00:07:10] Hi, my </p><p>Audience: [00:07:11] name is Corrine. cultural differences.</p><p>that's U S Europe. Let's put it that way. Is there in psychology, grading friction, thus cultural differences. Make a different, </p><p>Roger Dooley: [00:07:24] yes, I think, I didn't get into that a lot, but I think different cultures do certainly have different expectations of how easy a transaction might be, in China, in the.</p><p>In my stores, which are not the same. I found on this trip as the Dutch eMAR stores, the Chinese in my stores, everything takes place via their mobile app. You check out with your face, you pay with your face and it's a totally different experience. And we would find that very strange and difficult, but they find it very easy.</p><p>it's almost frictionless for them. </p><p>Bart Schutz: [00:07:59] Yeah. But I do like to emphasize the fact that, Homosapiens is in essence, very similar. Every one of us is a human and our brains don't work very different, no matter what culture you're from or what skin color you have. So the baseline is where similar, and then there are slight differences, which I'm </p><p>Guido: [00:08:19] citrus similar and nurtures different.</p><p>Bart Schutz: [00:08:22] yeah. Not sure about the nature by the nature different cause like the biggest difference between the individualistic. Countries. And we're not that different from the state, even here in Europe and the more, like the Asian, how do you call that? The groups group sense, community oriented that's that is a big cultural difference.</p><p>And what I tend to do nowadays, thanks to the Sierra world is if people ask questions like this, I look at the bigger data driven platforms like Facebook or Amazon and see whether they are presenting different. Interfaces to different countries. And they hardly ever do the differences are too small to start segmenting for those groups.</p><p>But China is exactly the one exception, right? So booking.com Facebook, they look different. So they're testing found out. that they need different UIs over there. But on the other hand, there are no differences between booking.com in the U S or here in Europe. and segment testing as a segment, again, has a difficult effect for your testing, right?</p><p>Reduces power makes testing more complex. So weird. Tend to prevent that. That's why we're in the CRO business. We're not a big fan of personalization. I know you all want to learn about personalization, but you should test where the personalization works in a very proper high powered AB test because we haven't seen a lot of powerful personalization solutions yet.</p><p>so then when it comes to individual or cultural differences, be very careful because the differences are small, right? The big goal, the big thing is we're all very similar. </p><p>Audience: [00:10:01] Yeah. </p><p>Bart Schutz: [00:10:02] So I would say, I would ever say the other thing you should test first are more situational factors where people are, they can decide for one product or another very differently.</p><p>If they're in a different situation, that's going to be like a counter effective effect, not a slightly more or less. It's 180 degrees different. So I would more look into those differences. </p><p>Guido: [00:10:26] Next question. </p><p>Bart Schutz: [00:10:30] His name is . Yes. </p><p>Audience 3: [00:10:31] And where do your work? </p><p>Bart Schutz: [00:10:33] I work </p><p>Audience 3: [00:10:33] for online dialogue, CRO manager. the topic of this talk was consumer psychology in CRO.</p><p>I was actually just talking to Roger that we asked converse specialist or anyone working this market knows so much more. We get so much more data and we can do learn so much more Fs, psychology, dentists, academics, and. No, that's just </p><p>Bart Schutz: [00:10:52] the economics part. </p><p>Audience 3: [00:10:54] Bart's you were at a bunch of lawyers, I think two months ago.</p><p>And you told them about our data, which you have, </p><p>Audience 2: [00:11:00] so </p><p>Audience 3: [00:11:00] consumer psychology in CRO, </p><p>Bart Schutz: [00:11:02] what, </p><p>Audience 3: [00:11:02] but the people working at it, </p><p>Bart Schutz: [00:11:04] what position should we </p><p>Audience 3: [00:11:04] take? How should we help these people ethical wise, however, </p><p>Bart Schutz: [00:11:09] should we grow, </p><p>Roger Dooley: [00:11:09] help the academics? You mean? Yeah, I think that's a very valid point because when you read some of these studies, they get.</p><p>Tremendous traction. And we read the details and it was 50 undergraduate students at a particular university, which it's great, but it may not really represent anything beyond, that this is why there's been a replication crisis and some, actually well-known. Authors and psychologists have been somewhat disgraced and have left their universities because, the data that they were using was weak.</p><p>They were using some techniques to find stuff, find significance where there really wasn't and. Ah, as a result, nobody else could replicate the data where I think that, the data that many CRO agencies collect, if it's done in a very large sample that is reproducible, now, things can change over time or they could change in a different situation, but by and large, you can't really assail the, quality of that data.</p><p>Bart Schutz: [00:12:11] What was the question? Is that the question, like how should psychologists within companies take their role or more of the CRO specialist? Yeah. </p><p>Audience 3: [00:12:19] I actually had the people working a CRO, ethical ice, Cedar position within other lines of work. How should we help the lawyers? How should it should be help academics?</p><p>Should we, </p><p>Bart Schutz: [00:12:27] yeah, so I think it's a data over psychology and it's exactly what, Russia is emphasizing. The, the whole behavioral science world is based on low powered samples of, usually Western females in the age, in between 18 and 22. And the external validity is very low. And the replication crisis is also because they have a false discovery rates.</p><p>That's not different from ours. And we nowadays know that at least 50% of our winning tests are false winners, which is also always the bad news. If we enter a new company that was working with an immature of agency, but. if I look at the current scientific that the big scientific institutions, and we go to code conference in Boston, MIT, half of the talks are by Oxford and Hartford.</p><p>Half of the talks are by Facebook and Amazon. And because they have that data and it's so in your role as CRO expert, You, your fight is against all your opinions and all the knowledge exists in the company, which is bullshit knowledge and psychologists don't have an answer. They only say it's very complex.</p><p>You don't know you should test that, but that's exactly the role you have. So the cultural shifts is a very big thing. And I think CRO experts are the wants to take up that role, but then we need different skillset, right? We have to be cultural change managers instead of very nerdy data driven, we think is very sexy experimentation and data driven this, but it's not very much.</p><p>Yeah. So we need to develop those persuasive skills, not only on the interface of our website, but especially within the company be more persuasive and, you learn how influenceable people are. So let's save a place for a year and Mark, </p><p>Guido: [00:14:19] before you go to Richard. And so for those that didn't study psychology, why are all almost all psychology studies, have participants that are 18 to 24 year old and are female.</p><p>Bart Schutz: [00:14:29] Oh, because we need a respondent. So is that what you call it? Participants in the study. So it just, yeah, so we just force psychology students to participate. You're not graduating without participating in at least 40 experiments. So there've been tested over and over again, but, and that's where the whole Bavel science is built upon.</p><p>Yeah. So we also subjects that are probably aware of the fact that they're being tested, which makes the external validity completely nonsense. </p><p>Roger Dooley: [00:14:59] Jeez students too. So they're not necessarily unaware of the type of tests they might be undergoing. </p><p>Guido: [00:15:04] I very vividly remember, doing a one study at the university.</p><p>It's a very similar study and Indeed's, 80%, as women, that's a, it's a psychology study. </p><p>Audience 2: [00:15:14] The study </p><p>Bart Schutz: [00:15:14] was one of the reasons to study it for me. It was, yeah. </p><p>I studied physics before that wasn't. That was, it was different. </p><p>Roger Dooley: [00:15:23] We didn't have that preponderance of women at my university, but I would say that just to echo what Bart was saying about real world experimentation platforms like Uber now are also publishing studies, not necessarily in CRO, but I just.</p><p>Heard an interesting study about tipping, where they can conduct these massive at-scale studies effects of tipping, where they've got really great statistics where, 10 years ago, an academic environment, it would be, some tiny sample and the other area. That's also afflicted by small sample sizes.</p><p>I've been writing about neuro marketing for years, and I'd probably some of you are familiar with that. Some of those studies, especially those using FMRI, which is a very. A powerful but expensive way to measure what brain activity while people are consuming content or viewing things. there, the sample size might be as low as 10 or 15 or 20 subjects.</p><p>And that's, it's interesting, but it's not really all that convincing. </p><p>Guido: [00:16:16] Yeah. And like I said, there can be big buyers in there. And, the study I remember is that we did a study on, you had to rate the taste of a piece of chocolate, and the, just to give you a piece of chocolates and you had to rate them on a scale of one to 10 or something.</p><p>and they, they gave you piece of paper with the chocolate and the brand name was written on it. So this is a piece of fact data. This is a piece of Milka, but I, so I got this piece of . And on the chocolate, that sad Milka so you're pretty sh you pretty sure you're in an experiment then. I didn't really </p><p>Bart Schutz: [00:16:49] all those experiences.</p><p>Everyone's always looking what's the trick, right? If someone is dropping his pen, Oh, I probably am supposed to pick it up. </p><p>Audience 2: [00:16:55] So </p><p>Guido: [00:16:56] that's how a lot of those studies go into, any audience </p><p>Audience 2: [00:17:00] questions, </p><p>Bart Schutz: [00:17:00] maybe this is also a nice extra answer for Houben. You have the power to publish in scientific papers.</p><p>How convincing is that in your company? That what you're doing is very valid, right? even science is asking for it for that information. Then your board members should listen as well. Yup. </p><p>Guido: [00:17:21] Anyone who wants to walk up</p><p>given wants to go again? </p><p>Bart Schutz: [00:17:28] I have a question for the audience. You're running way more experiments than any bagel scientific professor will ever do in his life. You've tested with more participants, then he will even encounter in his life. do you have, do you try to learn from these experiments are framed other way around, like who does not try to learn from his experiments?</p><p>Because I don't.</p><p>cause I don't think we're learning anything. Because I see a lot of learnings. </p><p>Roger Dooley: [00:18:01] So it was a murder </p><p>Bart Schutz: [00:18:04] one too. Are you </p><p>Roger Dooley: [00:18:06] saying that we aren't trying to draw more generalized knowledge from the results of the experiment. In other words, we find a result. Okay. this has this particular effect. So we'll go with option B instead of option a, but we're not drawing any longer term knowledge from it.</p><p>Bart Schutz: [00:18:23] Yes, I do. I see reports of AB tests where there's a learning included. And I think that the learning never holds and that's something we learned in behavioral science that when you have a hypothesis, An experiment. We'll never prove the hypothesis. If you read a scientific article, there's never one experiment.</p><p>There always a hell of a lot of experiments, because there are alternative explanations possible for the effect that you found, which might not be your hypothesis. So in science, you have to counter all the. Other possible explanations. And I see no one doing that. And as long as she don't do that, you're not learning.</p><p>And then who cares? Your boss doesn't care. He just wants you to grow the company. So stop learning, stop growing the com start growing the company. Right? Learning. Sorry. Fake our bullshit. it's not true if you want it to be true, which I would love to, because I love the fact that we were finally able to learn from human behavior, but it involves at least 10 experiments for one hypothesis, because you have to prove all the, I can go, come up with a lot of, yeah, give me a.</p><p>And they'd be winning AB tests. And I'll tell you a lot of explanations, why that might've happened and you'll have to find out which one is the true one. Knowing that 50%, at least of your winners will be a false positive. it's difficult to learn from human behavior. It's very hard to prove a hypothesis.</p><p>So either just stopped doing it, which I think is a very healthy thing to do or do it properly. But that involves. A lot of effort. And that's why we also have a reputation crisis in psychology because we also didn't have the fence to do it properly powered properly. </p><p>Roger Dooley: [00:20:05] I think you're fighting human nature there.</p><p>Bart, because people want an explanation. If one thing worked better than another thing, we immediately want to explain why for </p><p>Bart Schutz: [00:20:15] meaning it's messaging our brain. You always want to know why. By the age of six, she asked the why question 300 times a day, stop doing that because we just don't know it's a nightmare.</p><p>Test me as a dead. Cause I always get the answer. I don't know. I didn't test it.</p><p>Guido: [00:20:35] I'll give that a try. Yeah. Any audience questions </p><p>Audience 2: [00:20:42] I'm Bulger from Alabama or whatever, but it feels like I'm in a crisis now because if all kinds of consumer psychology, which is based on four studies, and we think we have learning from SIRA, which is from false tests. Can we be better than not stop and start drinking?</p><p>Guido: [00:21:05] I think 15 minutes. </p><p>Audience 2: [00:21:06] Yes. </p><p>Bart Schutz: [00:21:07] 15 minutes thing that the positive side of you're asking for. Is there anything positive in a, in applying psychology within CRO is in the ideation phase because if you're not. Into psychology. Then you will test too much rational IDs, I'd say it's it's especially, I love Roger Dooley's blog just to get ideas.</p><p>And that's also why I'm not against neuro marketing. I know the studies are bullshit, but it just gives you another twist in your ideation phase. And the problem with Aramark is also the statistics behind the data analysis. There's a huge bias in there as well. Anyhow, so you have different ideas, right?</p><p>And. The smallest change is going to have the biggest effects. We all see that on a daily basis, we're unable to predict the outcomes, but the better IDs are always based from the psychology background. We did a meta analysis within KPN, which is one of our bigger clients. So there were hundreds of experiments and we tracked the source of the hypothesis.</p><p>So we had three, three types of sources. There was the, like the opinions from the company, right? One third of their IDs is just people that saw something happening at Vodafone Zika, for example, or just tested that, that is, that has a winner chance ratio. That's a lower than a random. So we have a threshold and we find less winners than you'd expect randomly.</p><p>So that's very bad IDs, right? So that's why we tag them because we want our false discovery rate to be as low as possible. And we know that these IDs are bringing the fastest, so we, that's why we track them. So that's not the way to go. That's what a lot of companies do. Then we have the data driven.</p><p>CRO team, but not behavioral expert tests. Good thing is when a ratio is above the random threshold that you would expect. So they're actually bringing value and. And I think they're false discovery rate is somewhere around 70%. So one third of the test is it's a true winner. So there that's, it's bringing value, but then we have the central effects, steam where I'd be able scientists from our company are involved and they have four times higher real winner.</p><p>So we're at the data driven team has an average value per test of 30,000 euros. Our team has over a hundred thousand euros, average weight. Sorry. Is there value in psychology in CRO? </p><p>Audience 2: [00:23:46] He says there is, </p><p>Bart Schutz: [00:23:47] but what is it? It's not. it's the ideation phase. They have different ideas that the other people will think of are they would discuss the ID.</p><p>And then with our rational conscious brain, we will counter the ID. That's bad. </p><p>Guido: [00:24:01] The bar does it mean that you guys are also testing as zero teams with, and without psychologists and put them against each other? </p><p>Bart Schutz: [00:24:09] They were scaling up and having multiple teams and that the other teams didn't involve psychologist.</p><p>Yeah. </p><p>Roger Dooley: [00:24:13] yeah. And I think wrong to conclude from the replication issues that all psychology is bullshit. And in fact, there are many principles out there that have been proven many times both in lab experiments in universities, but also in commercial tests, I look at Cialdini's principles. For example, those are commonly used in.</p><p>Tests of all kinds and various other things you just have to be. I think the ones that studies have to be more careful of are the one off studies where a professor found some really startling thing. And of course that's what gets the press says. If it's a strange finding, like if you're on the second floor of the mall, you were more generous in your donations than you're on the first floor.</p><p>that's, it's really fascinating and certainly gets press coverage. But, you really want to be sure that's been replicated by other researchers and other locations. And a lot of that it's called embodied cognition. A lot of that now is looking very shaky. And but the basic principles are certainly valid.</p><p>Some, there are certain experiments things like, the ultimatum game, the, but you are free thing that had been tested in dozens of labs around the world. And I have pretty good basis for them. </p><p>It </p><p>Guido: [00:25:19] could also be an SRM. On the second floor, right? Simple rice ratio. Ms. Mismatch there. </p><p>Roger Dooley: [00:25:25] Oh yeah, exactly.</p><p>Bart Schutz: [00:25:27] Like a simple science are too low to be able to measure simple ratio mismatch. </p><p>Audience: [00:25:31] Yeah. Yeah. </p><p>Guido: [00:25:32] That's another issue. Yeah. </p><p>Roger Dooley: [00:25:34] I definitely, you have to look at why were those people on the second floor, maybe the people on the first floor were in a hurry to get to the second floor and they weren't going to stop.</p><p>And don't, who knows, there are many other alternate explanations for that, which is why as Bart says, you really need to test alternatives and make sure he got robust data. </p><p>Bart Schutz: [00:25:50] Yeah. there's a lot of courses out there that you can at least have an introduction into psychology, which I think is already very good.</p><p>But it's also very good to hire a trained psychologist who studied behavior human behavior for four years full time. You're never going to catch up with someone who was so studied. So intensely </p><p>Guido: [00:26:11] you, your psychology study. It was full time. </p><p>Bart Schutz: [00:26:15] I studied some psychology nine years, even </p><p>Guido: [00:26:20] twice as good. </p><p>Audience 2: [00:26:21] At least </p><p>Audience: [00:26:23] we have time for </p><p>Guido: [00:26:24] one final audience question.</p><p>So this is your chance who wants to go? Yes. </p><p>Audience: [00:26:31] Yeah. My name is Josh from &nbsp;and I would like to know what is, in your opinion, the most underrated psychological principle in CRO.</p><p>Guido: [00:26:44] The most underrated, psychological principle in Sera or the most effective then, or that's not being used</p><p>Bart Schutz: [00:26:53] yeah, but could be very, I would say the most overrated one is social proof. That's so counter effective very often. Social proof, always test social programming. It has an impact, It's very impactful, but. The direction is very questionable. we did, let's see if she's applying social proof when you're trying to sell loans.</p><p>I they've always been counter effective. We don't want to be reminded of others when we're doing something that those others dislike. So it has a huge impact, but in the wrong direction, So I think that's </p><p>Guido: [00:27:27] that's absolutely. I was give the other example that they found watching a boring video.</p><p>I don't want to know how, which of my friends</p><p>same time. Yes. </p><p>Roger Dooley: [00:27:40] Okay. I'll </p><p>Bart Schutz: [00:27:41] test that. That would be </p><p>Roger Dooley: [00:27:44] out. That is probably less utilized simply because it's the less known of Cialdini's principles. Moses his six have been out for 35 years or something. Now, just a couple of years ago in his book, Pre-Suasion produced a unity, that is like a very powerful form of liking it's shared identity, familial identity, and it's all it goes beyond simply having something in common with somebody else.</p><p>It's like being part of the same tribe, to really put it in a very simple way. And, when you can do that, you can be more persuasive, although sometimes the opportunities to show that you're a part of the same tribe as somebody else are pretty limited in a large business setting one business that I think because tried to leverage that is Tito's vodka from Austin, Texas.</p><p>They're now a well known national brand in the U S I don't know how well known they are over here, but. Oh, not too long ago. They adopted a slogan vodka for dog people, which is a very unusual thing. Obviously dogs in vodka have nothing to do with each other. but they did a couple of things. First of all, he tapped into a very large group of people who were.</p><p>Favorable to pets and dogs. Secondly, they didn't say for dog owners or dog lovers, I said dog people. So they're trying to bring in this identity that we share this identity and then actually a very golfing, they did nothing to do with principles, but they also created a hashtag, a vodka for dog people.</p><p>So the people who would not normally share a picture of their vodka bottle on their Instagram feed, I would, in fact, show their pet, wearing a sweater with the vodka, with a Tito's logo on it. they would have a Tito's dog food bowl or water bowl, or in some cases they would even pose their pet with a bottle of Tito's vodka and use that hashtag.</p><p>So not only did they create this, liking or maybe even unity effect with the slogan, they turned into a, something that could be shared on social media. </p><p>Guido: [00:29:44] Thank you. Roger. </p><p>Audience 2: [00:29:45] Can I also </p><p>Bart Schutz: [00:29:46] give a one tip? I think a very underrated persuasion tactic is variable rewards. Our brain is looking forward to rewards, right?</p><p>It's not the reward in moment itself. It's the anticipation of a reward that is driving a lot of our motivation. And if you want it to be very persuasive in the longterm, you have two variations, the, both the intensity of the reward and the timing of the reward. And I see no one experimenting with very well rewarding your returning customers to, in order to create loyalty.</p><p>Guido: [00:30:24] So I'd say I heard you guys tonight. When you order a drink, you'll either get a shot of water. You get a beer, you get a wine, </p><p>Bart Schutz: [00:30:32] but it's going to be buried. Yeah. Also, since you're going to feed it to your dog, I just heard. </p><p>Roger Dooley: [00:30:39] Yeah, I actually did see a one, like a Starbucks rewards tend to be very predictable.</p><p>You accumulate points. When you have enough points, then you get a free thing. but a competitor Panera. I was actually doing that random thing for a while where, there may have been some kind of algorithm driving it. But as a consumer, you weren't really aware of suddenly you saw an email or something on your app, pop up, Hey, you get a free cup of coffee or you get a free pastry.</p><p>So I assumed that's what they were doing. Although whether they were doing it consciously or not at </p><p>Bart Schutz: [00:31:08] all, no. Yeah. And reward is not only financial, right? It's especially, it's not financial. It's just telling people, Hey, you're doing a good job. You're almost there. All these green check marks that we play with small sentences.</p><p>Those are always, those are also rewards for people that they're doing the right thing. So if you're going to vary eight more with it, it's going to be more sticky and more create loyalty creating. And so I think that's. Like a very basic principle from psychology. If even if you're teaching your kids new behavior, you're going to reward them.</p><p>Do it very rule dude, unexpected. They cannot, you shouldn't. They should not be able to predict whether they're going to get a reward and how high the reward will be. But, and usually a reward is just a compliment from you and it's a big compliment, small compliment. So it's a very basic principle in psychology, which I think is very underrated in Sierra.</p><p>Roger Dooley: [00:31:56] Yeah, a great reference is hooked by NIR Eyal who shows how these companies that have us all addicted to our devices, use of variable rewards. It's a good effect. If people, if every time you posted it on Instagram, the same 20 likes it, wouldn't be interesting, but the fact that you get five one time and 200, the next time, that makes it exciting to you.</p><p>Bart Schutz: [00:32:18] Near who also spoke at Culverson hotel. </p><p>Guido: [00:32:21] Yeah.</p><p>thank you for all the questions. it, wasn't a final session and thanks for to a fortune hotel organization to have us here this year. Make sure to subscribe, see road cafes. I should subscribe then a </p><p>Bart Schutz: [00:32:42] reward </p><p>Guido: [00:32:42] with variable rewards. Yes, bye bye.</p><p>‍</p>",
  "show_notes": "<ul><li><a href=\"https://www.rogerdooley.com/books/friction/\" target=\"_blank\">Friction, the book</a></li></ul>",
  "guests": [
    {
      "id": "roger-dooley",
      "name": "roger-dooley",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    },
    {
      "id": "bart-schutz",
      "name": "bart-schutz",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/optimizing-for-friction.jpeg",
  "language": "en",
  "type": "podcast"
}