{
  "id": "optimizing-consumer-to-consumer-marketplaces",
  "title": "Optimizing Consumer-to-Consumer marketplaces",
  "description": "We learn how to approach optimization for a consumer-to-consumer marketplace and Emily is able to share some recent experiment results with us.",
  "date": "2025-01-08T20:07:07.493Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/65bcd962.mp3",
  "transcript_url": "<p>Emily Oliver: [00:00:00] So my background, I actually did, a biomedical science degree. and I've listened to some of your previous guests, and they've also said this, that they just. Like they fell into it and I definitely fell into it as well. so my first job out of uni was a marketing assistant, purely just did it thinking, I need to stop working now. I've gotta be serious now thinking about what I wanted to do. And so just how did they got this role? As a marketing assistant, I was still debate. And if I should go and do science, and I was just working and yeah, came across this CRO function and it was just one person at the time and they were doing things like experiments on site.</p><p>And I thought that sounds pretty good, actually. so obviously science background that really I just did that degree because I really love science. it's like understanding how things work, like looking at data and seeing what you draw from that. And you might see where I'm going with this.</p><p>cause it started to really draw parallels with CRO. it's definitely looking at. Onsite data, looking at behavior and kind of making theories from it and then going away and putting that into test, which is really related to me. And then the kind of final thing you do obviously, is into kind of starts and make sure you've got something of significance to show and not just really was relatable to my degree.</p><p>So I fell into it, but it really. That was something that I knew I was going to enjoy. </p><p>Guido X Jansen: [00:02:57] Probably one of the few people working in Sirota actually had zero as the first joke. I'm wondering, what's your view on combining qualitative and quantitative data in customer centered research </p><p>Emily Oliver: [00:03:09] when you look at data?</p><p>obviously you'll see maybe why the dropoff is or why the problem area is, or, What's that yeah. The stage of the journey it's causing people to leave or abandon the most. but just because you can see that in the days, that doesn't mean that you'll know what the right solution is for them or what they're after, or what's putting them off maybe.</p><p>And I think, On the flip side of that. Also, you want to be creating new things all the time. You want to be appealing to, new audiences and growing, and making sure you can think outside the box to tackle issues, that uses a haven't, but, also create new things for them.</p><p>So I think it's really good to be creative, to think of a few different solutions, a few different ideas and keep developing new websites in that way. </p><p>Guido X Jansen: [00:03:55] Yeah. Can you give us a couple of examples that, came from this, the D like new features or new things that came from such a process?</p><p>Emily Oliver: [00:04:04] yeah, Recently, we did one experiment at the moment. We're very much trying to drive, listening to customers, putting them at the heart of everything that we do. at the moment, my kind of favorite thing to do, is to ask them what's the one thing that nearly stopped you purchasing at the end of a purchase?</p><p>I really liked that because it's kind of users who have taken the time to. Go through your website on purchase of you or trade with you. you have two sides of the business. I really love our business. it's about 13 years old now, in the UK and slightly less than the U S it's called the lazy Monsey Bay.</p><p>because basically the idea is there's two sides as the trade side and there's a store side, so users can sell to us and we have a legacy category, And CDs, DVDs and games and box, but we're actually now 70% consumer tax. So phones, MacBooks, tablets, and consoles. So basically I'm a user would go to the site.</p><p>We'd provide them evaluation for any of those items and they choose the logistics. So whether they're going to go drop off at the post office or get Korea to come collect it for them. and then basically as soon as it arrives in our warehouse, we'll quickly check through it all and then we'll basically pay them as soon as we've got it.</p><p>I really look that's one side of it. really, that's the idea of the LEAs Munsey be they just put it all in one box and we do all the hard work for them. They just send it to us and then they get paid. and then basically once arrives, we refer a bit basically. So we changed the case on the CDs and DVDs and Polish them up, for the.</p><p>Kind of tech, check the battery, replaced the screen, began Polish or try and make it look like new, put it in a new box and it's the customer. and we're really pushing a mantra at the moment. That's smart for you, smart for the planet. it allows for the user to get, like new.</p><p>Product, but for a fraction of the price. And it's also given them a second life and protecting plastic, any waste. Yeah. So I'm really loving the direction that we're going in. so massive kind of sustainability message. It's massively beneficial for the customer. so yeah. We've got a lot of customers to talk to them, which is great.</p><p>So like I was saying, we, the ones that kind of do trade in with those and it's yeah. Their items and the one that do, purchase with us. I like to ask them. Yeah. w was the one thing that nearly stopped you. and what was it? The kind of the people that have taken time to overcome that, and they've still gone with us anyway, so they tell us things.</p><p>So what we do see is on us, we saw it on our store side. We have a lot of people buy CDs, DVDs, games, and books. And we also see in the data that a lot of them buy them as like bundle office, because do multi-buyers and things like that. Okay. A few, in the basket. And basically a lot of them were telling us that it's, it was difficult to add to basket.</p><p>They were felt like when they ordered one item, they were having to go all the way back through search and get all the way back through the journey. so that was something that was staring us in the face. it was pretty awkward to do that. So again, we laid out the issue of ourselves and the designers, and we said what are some options we can do?</p><p>Because we can look at other people and see what they are doing to combat this issue, but you never know what might work for your users and whether we've interrupted them that data correctly. So we've experimented with a few solutions. but we managed top of like quiet and easy winner in the end.</p><p>just, I think that was a really nice process ends when it's ask you customers. Think of a few solutions experiment got, and basically </p><p>Guido X Jansen: [00:07:26] go into a, you just mentioned the system sustainability, a part that I had a whole discussion this week with a group about that with a company, that tries to become more sustainable and, try to figure out ways to do that.</p><p>So how do you figure out how important that is for customers and how do you, how can you accommodate for that? </p><p>Emily Oliver: [00:07:47] Yeah, so that kind of a lot of listening during covert, especially because that was a scary time for everybody. So we kept asking them and trying to be reactive to that. and we actually have spun up a kind of special project team to look into sustainability.</p><p>So that kind of going through everything from the kind of operations side. So the packaging that we send things out in is now fully, sustainable and recyclable. No waste in packaging, and just listening out and actually we've done a few kind of. Surveys recently about what people think about refurbish tech, because we understand there potentially is a bit of concern for refurbished.</p><p>I could think if you can't go into a shop and physically see the item, you're going to get a, you might think, what conditions are going to turn off? And, is it going to work? Is it fine as somebody just left it in a terrible state and then you just send it out and that's not the case we do.</p><p>Go through a full refurbishment process, but actually something that really came through in the service was everybody really liked the sustainability message. They really liked the idea of protecting that e-waste and plastic waste and things like that. And they had no problems with it being a secondhand item.</p><p>And naturally they had full confidence that we were offering a 12 month warranty on SAC items. actually it's doing something that's good for the planet on the kind of covered and to make sure it's good and definitely be a like new product, basically. </p><p>Guido X Jansen: [00:09:07] Th w would you say that's, is it already the number one reason people buy from you guys that like sustainability or is it more like a cheap or </p><p>Emily Oliver: [00:09:17] easy to, yeah, I think.</p><p>In the past, we've definitely gone for kind of a price and a trust message. I think it is making things affordable, because it's a secondhand good. but it is no, but yeah, recently we really feel like the sustainability message has been. Really strong up against the kind of price, interest message and move on forward as well, really resonates with people.</p><p>It's a really important issue in the world at the moment, and it definitely should be. And I think people are really responding to it, which is really nice for us as a business. It's a marketplace. </p><p>Guido X Jansen: [00:09:51] So you app. Before offering their goods and, people, buying that. do you also do a lot of research for people freeing their stuff?</p><p>Emily Oliver: [00:09:59] This is a really important point as well. And something we want to look at. In the near future. So with that journey, when people come and get evaluation on site and they want to trade in and send to us, we're also really conscious of the journey that they have to do offline, and looking at how we can help them there because.</p><p>There are some kind of issues about got through the concept. You gotta find a big enough box and they've got to get themselves. Yeah. Post this. They maybe got a print, a label, or they were at the moment when are there QR codes? they just have to take the QR code and they get the label printed for them, but actually just assisted them.</p><p>They've made that kind of transaction on our trade side when they sell it in. I just want to make sure we can help them the best way we can actually get it to our warehouse to get paid. Cause we know that there are like physical factors they've got overcome with like getting some where to send it off or get in a courier to come to them, et cetera.</p><p>So we're definitely trying to make more effort in talking to them as well in the offline part of that journey. </p><p>Guido X Jansen: [00:10:58] Yeah. I can imagine that, especially for that part of the customer is that's the offline part is well more daunting to them, especially when they just start out. They're deaf. No idea. Yeah. I can imagine that the online part is just a really small part of that.</p><p>Emily Oliver: [00:11:10] Yeah. That's probably the exciting part because they got evaluate another thing. Cool. I'm going to get paid like branch pounds and then the other thing, Okay. Now I've actually got to try the first half. </p><p>Guido X Jansen: [00:11:18] Exactly. Do we know, is there a large drop off between people, doing the evaluation and then, actually, sending over and stuff?</p><p>Emily Oliver: [00:11:26] No, it's not too bad, actually. we call it the kind of trade to receive. So obviously when they've traded and then we receive it, and we're actually. Again, have a bit of a kind of project team looking at that at the moment. Yeah. Looking at the kind of most helpful way. And again, it was something we really closely watched drone COVID because we were maybe asking people in some scenarios to go to a post office and that kind of wasn't recommended for a certain amount of time when it was strict, essential travel only.</p><p>we opened up careers completely safe and concept free on the inbound way. Korea was definitely a message we try to push and then we're trying to. See if there was anything we could do with drop off points and supermarkets, because obviously that would have been part of economist essential, journey.</p><p>Guido X Jansen: [00:12:53] In the last couple of months, </p><p>Emily Oliver: [00:12:54] demand definitely went up for our service. People were at home, more bored. So they were looking around the house or what they could sell. So that was great. And then also, obviously people again were bored and they wanted entertainment. So we definitely actually saw our kind of legacy category of CDs DVDs.</p><p>cause we have had, physical media on the decline. Everybody streams, everybody downloads now, but actually Jaren. COVID-19 that definitely was not the case. Everybody, wanted to be entertained and like they would get the bundles they'd get DVDs, especially for the kids.</p><p>That was definitely something we saw the Disney category, was Booman, which was really interested in really great to see because, don't, I know there's a lot of people that don't want physical media to die. They don't want everything to be streamed. </p><p>Guido X Jansen: [00:13:37] It seems like you were in a good space overall, with the business rights, not too bad.</p><p>Emily Oliver: [00:13:43] We were, we did, we almost felt bad about it, certain points because we just had a kind of business model that really lended itself to, the kind of whole lockdown being at home, wanting it to be wanting to make some money when it's clear out, cause and all that stuff. So we did, a really great initiative.</p><p>for every tack item sold to us and every tech item bought from us, we donated one pound to our national health service. The NHS, I think by the end, we'd raised about 182,000 pounds. And I think we rounded that up to 200,000 pounds, which was incredible really to be part of. And I'm so pleased, but it would just, We're a business that did well in that time.</p><p>naturally things like call just went up. So we were really happy to be able to give back to the NHS, which kind of where the heroes of the moment for that for us, I would say as a business, we're always busy. It's just the way we are. we like to spend a lot of places at once. so I think what I do really love about music McBrian declutter is, We like to keep optimizing what we've got and keep improving that.</p><p>And always speaking to customers about how we can do better that, but we're really big into like kind of new products, innovation. so we've been working on a few things which are, I'd love to come back and tell you about, but that's been really exciting as well. We've done quite a few things. recently the Academy on the horizon for us.</p><p>Guido X Jansen: [00:15:06] Final question about the customer itself. What is the biggest or hurdle, that you experienced people having or concerns that people are having? when buying a secondhand goods, </p><p>Emily Oliver: [00:15:17] it is around the quality, and not being able to see it. But what we often find is we didn't don't have a high return rate.</p><p>people get it and there, and we see in our kind of Trustpilot reviews, which we love to watch because that's like roll feedback back from people. is that there really pleasantly surprised with the quality. They really, they say it's like new, like there's no scratches on it.</p><p>It's the battery's fine. it's really great. nobody would tell that I got this. Secondhand for a kind of discounted price. And, but I do understand that I do understand that they can't physically go into a shop and see this. so we try and do our best to give them all the information and the pictures and the understanding that, what kind of product they're going to get.</p><p>But it's a slight challenge, online to do that. </p><p>Guido X Jansen: [00:16:03] Okay. I'd imagine. But you, as I understand, so you. At least partly partially you check all the products, yourself, right? So it doesn't go from, the shallow to the buyer, immediate, it goes through your channels. So you can check that and even you guys even give a 12 month guarantee on </p><p>Emily Oliver: [00:16:21] tech.</p><p>Yeah. I want to quote this number, right? I think it's like an 88 point check or something like that. </p><p>Guido X Jansen: [00:16:28] It's taking a while, </p><p>Emily Oliver: [00:16:30] very extensive check with all about graders. They're all, highly skilled and looking out at the device, checking it over, doing any kind of repairs that we need to do. refitting the screen, if it needs to be done, Yeah.</p><p>I've seen them. they look really great. </p><p>Guido X Jansen: [00:16:45] How have you done any experience? have you checked on which maybe specific elements make the biggest impact? Like you said, you already mentioned trust pilots. you guys give the guarantees, have you checked? Which elements are the most important for those buyers?</p><p>Emily Oliver: [00:16:59] we definitely see that people use Trustpilot Fishel see what other people are saying. I think, I think you should never underestimate and like word of mouth and what other people are saying about your brand and, how you, how other people see you. So we definitely use Trustpilot in the U S they've got BBB.</p><p>so yeah, that's another kind of tourist spots froze. And then I don't know, other kind of. Key elements versus we also have, partnered with Klarna. So they do the pay in three. So that means you can split the cost over three months, which also helps. Cause you know, obviously we're saying the reason for doing refurbished is to try and bring that initial cost down for you.</p><p>So again, that's nice way to spread the cost and make it more affordable. </p><p>Guido X Jansen: [00:17:43] and are there any other experiments, that you'd like to share with us or experiments that you're excited about to run in </p><p>Emily Oliver: [00:17:49] the near future? We're actually going for quite a few kind of a bit of an overhaul of this site.</p><p>I think. There's a lot of important areas. Like I've been saying about the kind of the product information is important to people. So thinking about, revamping the product page quite a lot, we'll go in for some quite big experiments, I think is obviously important to know what you're tasked and to make sure you can stand what learnings you can.</p><p>we've got. But we basically have got kind of hypotheses coming out of Arias. So we're going to get a move on with some of them. and it did go for these page redesigns, with thinking about, we've done a redesign of our checkout, trying to bring that kind of up to industry standard, help people out there, make it as easy as possible.</p><p>We've basically just gone for the approach. Everybody just wants like a kind of easy, quick experience. Everybody works hard at work when they want something in free time. They just want it to be quick. And yeah, I don't want to think about it too much. So just really trying to think about the site and make sure yeah.</p><p>as easy as possible. </p><p>Guido X Jansen: [00:18:53] And do you see yourself, using that the background's in biomedical science again in the near future, maybe combined with Shiro or how do you see that working? </p><p>Emily Oliver: [00:19:03] I've got no idea,</p><p>but I don't know. It does have a lot of parallels. It is really interesting to look at what people say and look at data. Maybe something do the sustainability could come in that now biomedical CRMs law.</p><p>Guido X Jansen: [00:19:54] I noticed that you're a recently followed, a content score squares certification program. I think I noticed that on your LinkedIn profile, and then you're using the tool on a, on the music magpie, How are you using that tool? What are you using it for? </p><p>Emily Oliver: [00:20:10] Yeah. So contents, where is a really great tool.</p><p>I'm hope they'll be really happy that I'm going to give them a glowing report cause I love it. so it's how I discussed earlier with the, you've got your raw numbers from Google analytics and then you got a design at the end. They really help, the kind of middle area about, understanding.</p><p>Basically. How people consume your webpages and interact with your web pages and the journey through site. they've got honestly is a really great tool. So there's like journey analysis stuff. So you can look at the highest kind of session, heavy journeys that have been taken and actually where.</p><p>There you've got good journeys and bad journeys. So which journeys are leading to purchases, which journeys are leading to site exits. And there's a lot around, key page metrics and then zoning. So looking at the elements on the page that people are clicking with, engaging with hovering over things like that, and then it right at the end, just to tie it all together.</p><p>They've obviously got session record. And so you can just piece it all together and watch somebody do that journey and interact with the page. That is a really helpful tool. To look up key elements on your page and which ones you need to bring out in a test. So it's really great.</p><p>Yeah. Feed in that hypothesis kind of backlogs looking at, okay. There's something that's really far down on the page that's being really heavily instructed with. we can see it's actually, when people do see it's really valuable to them. So that's just task quickly moving that up the page. and that's a super quick task and actually, usually period's quite fruitful.</p><p>Guido X Jansen: [00:21:46] square as a sponsor of this podcast, but they didn't necessarily ask you to do this. This is not a sponsored section and the other tools, what are the tools that you're using, for example, your user research. </p><p>Emily Oliver: [00:21:57] at the moment we also use user Bella who I know are also partnered with content squad.</p><p>so they're really useful as well. I think we've been with them about six months. I really enjoy using them. They have the kind of feedback, element. So that just sits on the site. And if people encounter a problem, they can just click that show is the element that having the problem with, give us the feedback.</p><p>And then obviously they do the campaigns said I do that as surveys and the polls, and they are like infinitely useful and actually crazy task we've done recently, which wasn't really meant to be a task. Was. We basically wanted to put a survey up on a kind of the evaluation page on trade.</p><p>So where people will say, like my phone is on lock to any network and it's a good condition and you're going to pay me 400 pounds. We wanted to just put a survey on that page. Just saying, is this kind of all the information you need? Are you planning to trade with us? are there any concerns, talking about that offline journey, like what are their concerns about actually getting that valuation and getting it to us?</p><p>but we know that page is quite important, so we didn't want to just stick a massive obtrusive survey in the way. Cause like popups are annoying. Yeah. So we run it actually as an AB to ask so to control, they just had the normal page, naturally the barrier, they had the survey and.</p><p>And honestly, the way this turn of events, when we showed the survey, it was actually performed better. I just said if it wins, so we're going to just show a survey all the time. Swap. Honestly, I just, we thought maybe people. Like when they asked their opinion, makes them trust us.</p><p>Mom makes us think that we actually, we say like the service is gonna help them deliver a better experience from other people's field. What about that? And think, actually, like these guys do on, a better experience for me. Yeah. Why they're asking these questions, not doing it to be annoying.</p><p>that was. Oh, it was very strange task, but I was glad we did it. </p><p>Guido X Jansen: [00:23:50] The numbers improved for both people that actually participated in the survey and also for people that just saw it and clicked it. </p><p>Emily Oliver: [00:23:59] Yeah. </p><p>Guido X Jansen: [00:23:59] Yeah. They were just happy about you trying to get better at what you do. And that's just that notion that you tried to get better is enough for her now.</p><p>Emily Oliver: [00:24:09] Yeah, apparently that was really nice. </p><p>Guido X Jansen: [00:24:12] We can just all put a fake surveys on the website and then, okay. Garlic don't read them. Don't use them. There's just, </p><p>no, that's actually, you start doing something with it, but yeah. Surveys are, very useful of course. And, that's so that's what you use usability for those, the user surveys and, insights.</p><p>Emily Oliver: [00:24:30] Yeah, </p><p>Guido X Jansen: [00:24:31] usable and square. We'll be very happy with your endorsements, Emily. Thank you. thank you so much. Any final thoughts you want to share with our listeners? </p><p>Emily Oliver: [00:24:42] Everybody in the industry just keeps sharing their experiences. Cause I just think that's the best way to learn. You never know what people are going to do.</p><p>So if someone's got something they can let you know and give you a heads up on that. It's great. </p><p>Guido X Jansen: [00:24:53] Yeah, exactly. And thank you for sharing your experiment results on LinkedIn. That's indeed. I think a very, very, nice thing to do for all of us in the industry, share our wins and share our failures, </p><p>Emily Oliver: [00:25:04] same way, </p><p>Guido X Jansen: [00:25:05] share the things that surprised you, Emily again.</p><p>Emily Oliver: [00:25:09] thank you very much for having me. That was great.</p><p>‍</p>",
  "show_notes": "<ul><li><a href=\"https://www.musicmagpie.co.uk/\" target=\"_blank\">musicmagpie.co.uk</a></li><li><a href=\"https://www.decluttr.com/\" target=\"_blank\">decluttr.com</a></li><li><a href=\"https://contentsquare.com/\">ContentSquare</a></li><li><a href=\"https://usabilla.com/\" target=\"_blank\">Usabilla</a></li></ul>",
  "guests": [
    {
      "id": "emily-oliver",
      "name": "emily-oliver",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/optimizing-consumer-to-consumer-marketplaces.jpeg",
  "language": "en",
  "type": "podcast"
}