{
  "id": "optimizing-for-reach-and-performance-with-marta-florentyna-saratowicz-pandora",
  "title": "Optimizing for reach and performance",
  "description": "We start learning about how to cope with Intelligent Tracking Protection and end our discussion on optimizing for reach and performance.",
  "date": "2025-01-09T14:36:18.242Z",
  "duration": 2905,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/840fdeea.mp3",
  "transcript_url": "<p>Guido X Jansen: [00:00:00] Welcome. And thanks for listening to another episode of CRO cafe. Today, I speak with a Marta Florentina , which a web analytics manager at the resolution and media. And one of the things we'll be talking about is intelligent tracking protection. My name is Eduardo Yeltsin and welcome to Shira buffet.</p><p>The book does where I show you the behind the scenes of optimization teams and talk with their specialists about data and human driven optimization, and implementing a culture of experimentation and validation. This episode of Ciroc pay is made possible by our partners all in dialogue. And &nbsp;welcome to season two, episode nine.</p><p>So Martha, welcome and great talking to you again. Could you start off by giving us a quick intro to your background and how you started out with optimization </p><p>Marta Florentyna Saratowicz: [00:00:58] a little bit about myself? I'm in a Polish expert. I'm living in Copenhagen. I've been here for last nine years. beforehand I had been traveling around Europe and spent some time in middle East.</p><p>I'm doing everything from that. That was contained previously in the term digital marketing. I'm trying to get some experience as a student first in severe pain. I don't have this posted for half a year in Poland. I would like to think about myself as an analyst with international experience. So on a daily basis, I'm working as, digital analyst and, data activation, manager, it's, it's Omnicom media group in Copenhagen, a recent hiring here because it's been nine months since I joined, beforehand, I was based in strictly, analytics agency that was based on data.</p><p>from the start. So there to an end, basically all the machine learning and data analytics departments were supporting, conversion rate optimization, PPC, and, SEO departments. So that was a core of the business. While now I'm working mostly with media agencies, and supporting them with data in order to optimize their media buying.</p><p>Guido X Jansen: [00:02:23] Okay. And, was it the rest of the company do for what kind of services do you provide? </p><p>Marta Florentyna Saratowicz: [00:02:29] that's everything in terms of media. So we start with our traditional media, of the actually, Book, advert time and radio and TV, but that's only the traditional part that's being scaled down now is obviously, most of the clients would like to advertise in line.</p><p>so there is a department that doing media buying on social media and driving a lot of traffic into the sites. there is also a couple of departments that you, A pool media strategies to pull marketing strategies, meaning that they would do, optimization of, search results as well as, some, paid search ads in order to pull users into the websites.</p><p>There is what's actually twisting is that, conversion rate optimization department does not exist as a department in here, but. Each of the media agency has a conversion rate specialist working and dedicated for that specific department. So for example, what we do in web analytics department is that, we work with, implementation of the KPI strategies and then tracking and a focus on, qualitative, No, obviously quantitative data, in order to provide some optimization insights.</p><p>very recently I teamed up, we've with a qualitative, person said you speak from one of the media agencies and, we work together on aligning our approach. So combining data, with a hypothesis, making a story. Bolus, bullying quite a lot of web analytics into analyzing AB tests. so that's what we are actually planning now.</p><p>And, we've done a couple of features together where, where the clients were super interested in this combined approach, because what we would normally see is that the conversion rate optimization specialists, or rather wandering. softer side of the spectrum. they know it's specifically data driven.</p><p>Some of the decisions might be actually, taken based on gut feeling or just the perception of what actually looks good and should be, and should be done in a certain way, in order to optimize user clicking on specific button and click for rates or a final conversion, if it's commerce, total, it will be a transaction.</p><p>so we try to combine those two approaches, and actually use, Mostly e-commerce data, and visualizing this e-commerce data to be able to find what might be wrong, in an online store. And then, and based on the data that I would prepare, she would then use it, into their hypothesis, building.</p><p>Guido X Jansen: [00:05:20] Yeah. Those challenges sounds very familiar. </p><p>Marta Florentyna Saratowicz: [00:05:24] Yeah, you're right. I would say that's the most optimal result is actually tuning up across different departments and, building conversion rates, optimization teams from, from employees that present, to present different approach to the same problem.</p><p>that's what I find more useful. then just, yeah, and just building hypothesis based on gut feeling. yeah, we need to remember that not all users are, are asked basically. we might have completely different perception, especially as digital specialists. Yeah. then, people who've never been on a specific side, they don't know what it's for.</p><p>They are not sure of what is the purpose of it. so yeah, so we need to remember about the user at the very end. That's how we actually teamed up, there. so this, conversion rate optimization specialist, her focus is on the user and obviously mean being, data analyst. My focus is also on the user.</p><p>Guido X Jansen: [00:06:24] There was a specific reason that you moved to Denmark. Was it the a, is the industry different there? </p><p>Marta Florentyna Saratowicz: [00:06:30] so before I actually moved to Denmark, I'm here to do the study it's because, what you say, maybe the education system in Poland, that's based on learning things by heart. It's not the best if you really like to understand stuff.</p><p>the practical approach, which of, of education, to education in Denmark was something that caught my attention. so yeah, I packed my suitcase and then the competence on the boards of a plane. And then I arrived in Denmark and, I'm here almost ever since I had couple of periods when I was traveling around Europe and, gaining some experience in here and also in Dubai during this, during, in standard and here, but ultimately it was just the way that people learn stuff in here that, that caught my attention and made me move.</p><p>Guido X Jansen: [00:07:21] yeah. And I think cultural wise, it's very similar, to the Netherlands. how people, buy online and regarding regulations, I think, you said, before we started recording, he sat there Derek white, some differences still between Denmark and the Netherlands. Right then in terms of Sierra.</p><p>Marta Florentyna Saratowicz: [00:07:37] Yeah. what I can say is that every talk during the analytics, and digital analytics Congress last week had some elements in conversion of conversion rate optimization is if a Dutch way would be a focus on the first party data and whatever we can gather on the website. And then try to gain regain control over our own channel or our own platforms in order to make them, get most, optimize towards the users while, as I see to the recent trends in Denmark are rather combining different sources of data in order to.</p><p>provides better usability across the whole journey. There is a big focus on combining offline and online data or, conversions in store. So those offline conversions with online behavior. there is a different approach to what data is actually being used. And as I see it impacts how we do compression rate optimization.</p><p>Guido X Jansen: [00:08:44] Yeah. You just mentioned you were a speaker there, and you did a session on how to cope with intelligent tracking prevention. and that seems to be quite a hot topic nowadays. It is very important. can you explain for those. that haven't encountered ITP yet, what it is and why it's important.</p><p>Marta Florentyna Saratowicz: [00:09:06] that's a wealth of new information. as I like to think about it's all started with, a standard war. So a standard war would be a competition for market dominance or survival between. the two companies that produce a particular type of technology and, that's one thing.</p><p>And another thing is that it's targeted because in my opinion, at least Apple, so drawn into designing and manufacturing devices. That, they slept through this whole phase where, where Amazon or Google or Facebook started to actually capitalize on providing platforms for advertising and using data for that.</p><p>So there's two factors. it shaped how the interest returned with Apple. just, wanting to basically end the dominance of Google and Facebook and Amazon saying, if a year ago is built your whole empires on, advertising cookies and analytics cookies, then we will make sure that one third of the market that's using our browser.</p><p>that you can always capitalize on those people who are using our browsers. So from one point it is standard Warren for, from another point of view, it's just, those four digital giants trying to outmaneuver each others. So that was something that, that shaped. recent, yeah, a recent landscape </p><p>Guido X Jansen: [00:10:41] and those giant, those four giants being, Google, Apple, Firefox or slash Mozilla.</p><p>Marta Florentyna Saratowicz: [00:10:50] Yeah, that's, that's, it could be sick within the browsers. the whole Bible is about the browsers, but I believe that the motivation towards, limiting, tracking and data sharing opportunities, it extends far beyond his, who's who's has, who has the biggest market share, within browsers?</p><p>Because I'm ultimately, what I think happened is that, Apple was, as I said, so drawn into building devices, that physical devices that they disregarded the importance of data, and now they will come up and, got to know about they, they are getting out maneuvered. so the way that they would like to put us train into, Oh, okay.</p><p>Go on Facebook, capitalizing on them, providing the devices would be just to put an end to where the revenue streams are being driven from, which means from online advertising and use of data. </p><p>Guido X Jansen: [00:11:47] Yeah. And by the way, looking at the browser market share, I just pulled up some numbers from StatCounter counter.</p><p>And those numbers are very stable. If I look at it, it's those numbers are from September last year until September, this year as basically around 55% Chrome, 26% Safari three, and then actually a Samsung, browsers. so mobile, I would assume it, and 5% Firefox and then for an opposite edge and, around 3%, internet Explorer.</p><p>Does mainly Chrome and Safari as a part of the dominant players here, the Netherlands. </p><p>Marta Florentyna Saratowicz: [00:12:23] Yeah. And we have over 25% of market share of Safari, which is an Apple browser. So what they've actually done is that they removed one fourth of the markets from, from, being able to be advertised to by Google and Facebook.</p><p>so what, actually Apple has done is that safe. At the beginning, they limited to advertising cookies. and then they removed them completely. So right now, what, when you're not, nobody's being able to target you on a Safari browser. if you are on, let's say, can you go.com or if you, Are reading the news, nobody who's advertising, through Google's channels from Google's platforms is able to target you because your browser does not allow any advertising cookies to be said.</p><p>And me working in a mediation, see that produces some kind of a challenge where, we have a smaller reach, of our campaigns just because those users are denying cookies by default. but obviously there are ways to circumvent that, but on the other hand, being an unlist and getting to know that the first party cookies are also kept within 24 hours, instead of the cookie will expire after 24 hours since the date, it's been said.</p><p>So that would mean if you would come back to my website more than 24 hours, within more than two. 24 hours. I will not be able to recognize that you're the same user. And, I don't really care about the advertising cookies. I can rip out the first party cookies that are screwing up my traffic, because ultimately then, I'm not even able to report on the channel's plate because a single user might have one conversion, but suddenly we'd have two sessions and it will be two users.</p><p>And I'm just kind of person that really likes order in data and really cares about data quality. So this kind of ruins my whole world. </p><p>Guido X Jansen: [00:14:27] Yeah. I think many Ciro specialists will relate to that statement. We'd like to have order in our data. </p><p>Marta Florentyna Saratowicz: [00:14:35] In May, 2019, this capping of first party cookies being introduced by Safari.</p><p>And what happened next in September is that, Firefox actually followed through and they, kept all first party cookies by default. So you're not even able to advertise to those people who are using Safari now. There were some temporary solutions people. many specialists actually were recommending to hide solution it's to hide it.</p><p>I think he's from this. Oh, great. And that was, eradicating cookies. the easiest solution was just a piece of the code, that appends your cookies to a local story, but then, at the end of September, what Safari is done, they actually, disabled this function of being able to store anything in the local storage.</p><p>I'm not sure that's what they actually done, but you're not able to store your cookies there because they can be accessed in their bite, the cookie scraping algorithm. Yeah. yeah. we've got a problem. I need to say that. </p><p>Guido X Jansen: [00:15:34] Yeah. So as a CRO specialist, working for an, a for an agency or on the, if you're on the working on the merchant side, how can you figure out how big this problem is for you?</p><p>How much data you're missing? </p><p>Marta Florentyna Saratowicz: [00:15:46] I would actually recommend it to couple of analysis. First of all, Apple products are really popular in Denmark. if you're based in another European country, that might be a completely different, but what we see in Denmark, that's, 40 to 60% of, all the browsers are based in Apple devices.</p><p>You can have happy, fair traffic, consistent Chrome, and probably opera and some singer internet Explorer while the other half is Safari. So we'd need to look at this plate of different browsers. You have. And second of all, I would actually look into if the Safari and, and Firefox browsers, what type of buyers, what versions are those?</p><p>Because if your users are, still using the very old versions of Safari at, then your traffic should not be impacted. But, with, version 12.1, this actually has been rolled out and we've seen. From mid may a free quarters of all Safari traffic being actually from the impacted browsers, from the impact is version.</p><p>Yup. what you could do is you could see a trend line of how big of a percentage of your. Of all your sessions are the new sessions. And then if you draw a linear trend line on the percentage of new sessions, what it normally would show for the clients in Denmark that in January, maybe 30 to 40% of all sessions, from the impacted browsers, that was about 30% of new users right now in September, what we say it's about 50%.</p><p>And I'm not really sure that this is because there is more new users being targeted by our campaigns. How would rather say that it's because they come from this impacted versions of this impact with browsers and they're just growing up my data. then what you could also do is, you could look into, the split of the transactions, first of all, you did two segments, one segment of impacted browsers, and then another segment of those browsers that were not impacted.</p><p>And then, go to your eCommerce report, see how this performs for new and existing users. And then we, your two segments supply to be able to actually see, What's the difference in between, new visitors coming from these impacted browsers and not impacted because that's a, that would actually tell you that the, that you can really trust your transactions.</p><p>Dan, there will be just one transaction that occurred. But, your conversion rate would not. </p><p>Guido X Jansen: [00:18:26] Yeah. And I guess that's also quite dependent on your type of business, right? If you're selling something that most people buy it within 24 hours, then you should be relatively okay. just people take a week or longer.</p><p>if they take it as long as a day, then you have a problem. and then people start, your data starts to be screwed up. </p><p>Marta Florentyna Saratowicz: [00:18:44] Yeah. if it's just grocery shopping or then. You are able to make a decisions if which cucumber to buy within 24 hours, but any business that's, selling cars or selling apartments or generating leads for the more expensive type of services, I would assume that those.</p><p>the stations take longer to make in buying a cucumber. So those businesses will naturally be more impacted. And once we are on this point that maybe it's time to stop. calling conversion rate optimization. This is, we know the rate is actually based on a session that now we basically cannot trust.</p><p>So maybe we should call it's just conversion optimization. </p><p>Guido X Jansen: [00:19:31] Yeah. Or that there are a lot of proposed terms I think that are, trying to improve on this service is such a well known term by now. And it's really hard to change, Yeah. a lot of people suggested that we should change the name of the podcast.</p><p>Yeah. But yeah, I also usually try to explain to people that it's not about. It's not about a single KPI that we're going for. And it's more about the mindset of company, of running experiments, validating the changes that you make and looking at the whole customer journey. And I'll just the conversion rate of people buying something online and then ignoring everything else.</p><p>But yeah, there's definitely. There's definitely a branding slash marketing challenge that we have. Isn't it? Yeah. You also spoke about, okay. Now we know what the problem is. now, and somehow to figure out how big the problem is for your own shop, specifically, so what can you do with it?</p><p>I think, during your session, you spoke about, two types of optimizations, right? Optimization, optimizing reach and optimizing performance. so let's talk about optimizing reach first, </p><p>Marta Florentyna Saratowicz: [00:20:31] right? So what do we come to? and it can be, if everybody coughing to do is that if we don't want to drain our marketing budgets and trying to reach people that we cannot reach anymore, let's just exclude them.</p><p>If we're running any type of a campaigning people or, a DB free 60 at forum. Oh, we should just exclude Safari and Firefox browsers from targeting. I know that it might be painful. And if getting the wider reach, the widest week possible is on top of your marketing strategy, then it might be painful.</p><p>Maybe it's time to rethink. </p><p>Guido X Jansen: [00:21:10] Yeah. and if all our block browsers full of suits, then you might have a big problem in the near future. All follow them, </p><p>Marta Florentyna Saratowicz: [00:21:16] not assume that this is actually going to happen until we have another solution in place. obviously what we should be doing for a number of years now, it's starting to be, it's got ring user IDs, bill, because.</p><p>we can, we could not, we will not be able to optimize any business in the future. So to speak, if we are not able to identify our users, if our business, we want to make business online. But if I were a business that does not provide value or which customer would like to pay, being able to register and log in, then we, in the future, won't be able to it'll recognize those users anymore.</p><p>And we won't be able to target them. it means that we need to adapt them, the marketing strategies. And sometimes we need to also adapt the way that we actually are running business. aside of, user IDs, it might be worth looking into building it up. because the SDKs are not based on cookies, they are based on device ID because ultimately, what do you do when you download an app?</p><p>You use your own account on Google or Apple and your own device in order to download this app. And then, the data is actually being tied to your device and you cannot change the device ID as far as I'm concerned. Being able to, for a device ID. So if our users will also bring us some opportunities to target the them based upon those device IDs, obviously that's a big, technical change and sometimes it just doesn't make sense to have an app, but maybe it's time to reconsider.</p><p>and then, start tracking user IDs and device IDs. what do you could also, it would have killed also do if this data is that, there is couple of solutions, technical solutions that are based on stitching device IDs and user IDs. And let's take a scenario that, the same user I, with my login credential to an online store and I'm using, my account on three different devices.</p><p>I usually log in on my desktop. I log in on my phone and I'm locking on my tablet. And then I also might have another phone that we use for work. But sometimes I actually look at the online store on my work phone as well. And that will give us the four, four different devices, but because I'm lumped in with the same account that will give me just one user ID, employing this data in any type of database would then, And give you an opportunity to stitch those four devices to a single user that will give you some insights about my behavior.</p><p>Maybe I'm using the phone in the morning and maybe using desktop in the afternoon, and also based on which device I'm using at what time that will give you some targeting, ideas. Maybe it will be better to, push ads, display banner to me, based on a device ID on my phone, when you'd know that I added stuff to the carpet did not convert.</p><p>And maybe at five o'clock in the afternoon, I'm actually on doing my daily community back to home. So maybe it's a great time to actually they make a purchase. So rethinking our marketing strategies with those device IDs and user IDs. would actually be needed to find a suitable solution for the future.</p><p>Yeah. Obviously, if we are talking about the technical, solutions and not necessarily adapting our whole business, the only viable solution for now, especially if we have multiple domains is, storing cocoa cookies, server side. And I know that there are many concerns, about if it's a GDPR compliant, but I would assume that as long as we don't have a lawsuit against a company, who's actually storing cookies server side, then we would not know if this is actually a legitimate interest of the company to preserve the cookies.</p><p>Or if it's actually, impacting, the rights of the, of the day just have, </p><p>Guido X Jansen: [00:25:32] okay. And, but the F for, the sending of those cross domain tracking orders, user ID RDS, it does require clients to either log login or DCF need to have some continuous flow of data. </p><p>Marta Florentyna Saratowicz: [00:25:46] Val does have always been a fan of actually just hitting single Google analytics property that would aggregate all the traffic.</p><p>Yeah, I know that's maybe a fresh hole is a bit too low. If you're running an online business across many, for example, European countries that is the fresh hold and the headquarter might be too low to actually be able to, send the data to one place. But it's ultimately what it does is that it says the same cookie ID because it's two based on cookies, but it says the same cookie ID.</p><p>Across different domains and across different devices. So that's a, that was always my preferred way. now if we consider, Google's environment and the way that they've handled, merging app and web data, this is actually being done with the new type of properties it's been live since August in beta.</p><p>And over there, you can actually, Target's your Firebase project to send data to this property, as well as from Google check managers, send your data, your website data at the same property and the stitching. I need to emphasize that it's still embedded in beader, but this teaching that's being done in there is being done basically on device IDs and user IDs.</p><p>there is another solution provided by Tealium. in audience stream, you're able, to determine what is the user identifier, and then being able to teach different sessions, containing different cookies together based on this, identifier and. That's called profiles teaching within all the industry.</p><p>And this solution has been in place for quite some time. Obviously they are also able to gather information from the app. So if you're sending device ID, that can also form on one of the institutions </p><p>Guido X Jansen: [00:27:40] and do we know how well that works? Are there any downsides or any drawbacks of that? </p><p>Marta Florentyna Saratowicz: [00:27:44] again, any drawback I can actually see because, the Google's solution is to, in pizza, they advise, the users, especially in the end users companies to actually start.</p><p>people being on this feature and, they've really been working on developing the Firebase tracking for quite some time now. So that's been on a timeline, but I would say that if it's still in beta, it's not red yet. I assume that they need to gain some, critical mass of users, before.</p><p>There are algorithms that are actually stationed out, are able to certify that this is a percent foolproof, while BD Tillium solution it's been in place for a couple of years now. And, I've actually set it up once seen it's working. It's pretty awesome. ultimately they also pretty agnostic.</p><p>Civic could point also your Google analytics data. I'll put there and collect data through Firebase, into audience stream &nbsp;stream and work on the same principle. so it depends on the marketing landscape because on the marketing stack as well, because it depends what preferred vendor, if God, so you might be a patchwork of different systems.</p><p>and then you'd like a vendor that's doing this teaching to be as agnostic as possible while if you're a hundred percent, Google stock is best to just stay within Google. Start. Start stitching, your device IDs and user ID is now and then leverage it later. </p><p>Guido X Jansen: [00:29:21] Yeah. Yeah. And I guess most of us are stuck in the Google stack because that's what most of us are using.</p><p>And most of the clients at least are using. yeah. So that's about optimizing reach and then the second part optimizing performance. </p><p>Marta Florentyna Saratowicz: [00:29:36] So given that we have 24 hours to make people convert. let's find out what prevents them from conferring of it's eliminate that friction as fast as possible.</p><p>And, yeah, later on let's hope for the best maybe, People usually like conversion rate optimization. They also always focused on success. We need to talk to myself, our conversion rate. We need to, decrease the bounce rate, increase the engagement, but at the very end, maybe it's very small, annoying detail.</p><p>That's preventing users from actually converting. back on, measure camp in may, in Rome, one of, one of the conversion rates slash web analytics specialists, from Finland was present. his name is Mikko and he actually outlined this couple of metrics that you can use. To measure how annoyed or irritated your users are.</p><p>So for example, he suggested measuring, number of clicks per page view and. I know it's from my own experience, when I'm super annoyed, I would just try to make the website response and I would click around many times repeatedly and be super angry. And I'm then using this metric together with the, that the page views, the page reports in Google analytics, but can actually see.</p><p>That may be some page is simply not responsive, or maybe the user just cannot click on proceed to checkout because there are features like responsive. There is no link on there. It might be a very simple thing that's super long, and it might have a tremendous effect on just fixing this pinpointing those really annoying thing.</p><p>And then fixing this specific thing. I remember I downloaded an app when I was visiting my parents in Warsaw. We were supposed to go on, on the trip on the bikes and city bikes. but the way that, the app was scaled did not fit my. A crappy Chinese phone. So I was not able to actually fill out my details and we spent around two hours then wait, then waiting for me, like my whole family on bikes that can we go now?</p><p>And me not being able to actually, I wanted to be able to shake the city bike up. so just measuring this number of frustrated, annoyed clicks. on a screen view or a page view, could give us a lot of insights. then what Mika also suggested is that, we can also track the confusion of our users.</p><p>just dividing the amount of, page views by unique page views would give us the confusion rate. It will show us if our users are. within a single session going back and forth again, or maybe a specific page does not provide them with the information that they need, or, they just simply are not able to find a specific information they want.</p><p>a good example for a commercial client would be, That's crawling through a page where you're supposed to fill out something, actually it's close your, what do you call it? Crawl is close your form as well. So that you just cannot catch it because it just moving around, just crawl, so to speak.</p><p>And it's also super cool, annoying. And then this user would be able to find a form to fill out, for example, the address, and we'll be walking back and forth within the checkout funnel and not being able to provide a dress. Yeah, that's obviously a very, and large case of what can be wrong, but, if, a thing like that exist that will have tremendous effects on the conversion rate with the variant.</p><p>Guido X Jansen: [00:33:15] I think those are great tips, And I know some of the analytics tools, Yeah, they also, try to, to measure, noise and confusion. I think those are particularly, fun, fun, useful things to be tracking and, the way you set them up. I think those are very useful and easy to eat, easy to set up.</p><p>And, very useful to, to detect pages, or user that are, getting frustrated easily. </p><p>Marta Florentyna Saratowicz: [00:33:37] There is also another thing because, sometimes we know that there's something wrong with our checkout, but maybe if we work on the client side, you're not able to get resources. We would be normally called off saying, the sales are flowing in, so you ain't fixing something that's not broken.</p><p>Or maybe we're not going to give you our precious developer's time to figure out what is broken. So what I would normally suggest is to, track what we call a missed revenue. So normally with the e-commerce tracking, we have our revenue, but maybe if we also, track the full price of products in checkout across the whole checkout flow, and then substructure that.</p><p>From the total revenue or the other way around. And we would know how much revenue we actually missed. And on the next meeting where we had to fight for resources with another department, and we are a conversion rate optimization specialist, we can just present this one number per month or per week saying that we are losing.</p><p>Thousands of euros, just because you're not willing to give us assistance of developers to find out what's wrong. So we could actually use this list revenue metric as a form of, internal buy in. And I like this idea very much. I think it's tremendous because it actually would show everyone that hour conception preconception of knowing that something is wrong.</p><p>Can actually be quantified in a way that speaks out to top management very well, because we are just talking about money desk and another are going to be able to </p><p>Guido X Jansen: [00:35:24] exactly another thing. That's a great thing that we can do in general with conversion optimization rights. if we were an experiments and we see the difference that it makes, but then it's maybe not implemented, we can just present to the board or whoever's in charge.</p><p>Say, okay. We losing this amount of money every month because you cannot implement it or you won't implement it. It's up to you. That's fine. It's fine. It's your choice, but, </p><p>Marta Florentyna Saratowicz: [00:35:49] yeah. Yeah. As you said for missing implementation, yep. I know that sometimes, development projects, they got store like it's taught along the way and takes for ages to actually have something implemented or new websites rolled out and, tracking of missed revenue also provides the sense of urgency setting that we have to fix it as fast as possible because that's a big drain on our budget.</p><p>Guido X Jansen: [00:36:18] Yeah. </p><p>Marta Florentyna Saratowicz: [00:36:20] Especially if you're buying a lot of traffic, that's not being able to go through. so if you're combining this region performance, strategies together, And, you buy buying crazy amounts of traffic. It's super expensive. You send them for this checkout funnel, but they are talking, along the way, then just being able to recalculate that, to a missed revenue would be, a pretty, a pretty big things.</p><p>Yeah. </p><p>Guido X Jansen: [00:36:46] so would it be like a standard dashboard that you usually set up to show miss </p><p>Marta Florentyna Saratowicz: [00:36:50] revenue or. Yeah, what I would normally do start, I'm a big fan of dashboards, especially if we want to achieve something. and, what I would normally do is out fire a goal per a checkout step or her, her e-commerce action in separate Google analytics view.</p><p>Jen, I would send this data from this specific, Events tracking slash goal slash e-commerce tracking view in state of studio. And I would recalculate, then swap of rates in between, different steps. Oh, the checkout funnel or just the whole e-commerce flow. And doing cuts in data studio and based on the goal.</p><p>So I was for, segmenting that data with more dimensions and we can obviously send our, missed revenue on with each of the steps. and that's, I find it's, it sends a pretty powerful message because then we'll be able to allocate on which step are we actually losing the most of revenue and, Kind of pinpoint, maybe there is a specific device that's responsible for that, or, maybe they're a specific channel, responsible for that.</p><p>And then we can use all of our custom diamond insurance as well. </p><p>Guido X Jansen: [00:38:06] and, but for those, those dashboards, for missed revenue, usually you need to do some assumptions for that, right? like external factors staying the same. and when you implemented it might not actually bring the revenue that you, that you predicted.</p><p>so how do you handle that internally? and yeah, managing expectations on that front. </p><p>Marta Florentyna Saratowicz: [00:38:23] and then that's the problem, because then we need to start hypothesizing because we might know that something is wrong, but we might not be sure what exactly is wrong. And that's where, more humane people would actually step in like my conversion rate optimization colleague.</p><p>and we would look into data together and then we would also debug the checkout flow probably, or the whole e-commerce setup, on the side. and what's the most interesting is, you could also support this data in a way that. You sit with someone who never been on a page, and then you just ask Jim to make a purchase of a product, and then you are set up a screen recording on that and, When you're sitting next to the person, you might actually experience what it's like to do it for the first time.</p><p>Because if you would just set up screen recording, eh, with Hotjar, then you don't know if these people are first time there, did they maybe browse from different device? Are they acquainted to the brands were not so doing this, peer to peer reviews, it's actually very valuable and that can support your analysis along the way.</p><p>Guido X Jansen: [00:39:37] I think that's a great note to, to end our recording. thanks so much. Marta, I think that's a lot of, yeah, food for thought for us. So to think about an a in this hero industry, and maybe, maybe in a couple of, mal maybe months, but probably years, we can figure out a better way to, to call our industry besides us Euro.</p><p>Marta Florentyna Saratowicz: [00:39:58] So be interesting. Very welcome. And thank you. Thank you for the invitation as well. </p><p>Guido X Jansen: [00:40:02] Welcome and talk to you soon. </p><p>Marta Florentyna Saratowicz: [00:40:05] Thanks. Bye. Bye </p><p>Guido X Jansen: [00:40:08] Martha. Thank you so much for the interview and talk to you soon. This was episode nine, season two of Shiro cafe with Marta or Florentina Serato beach from resolution media.</p><p>And as always, this show notes can be found on our websites, hero.cafe. This podcast is still mainly in Dutch, but if you're interested in our English episodes, These go to zero.cafe/english to see an overview of our English episodes and to subscribe, to get notified about upcoming English episodes. If you're interested in promoting your products or services to the best zero podcast listeners in the world, please take a look at sera.cafe/partner to see how we can collaborate.</p><p>Right next week, another ditch episode, where I talked to yours, founder and CEO of Dexter agency. And we talk about how he is running a remote optimization agency. And we talk about how to sell Shiro to clients, talk to you then, and always be optimized.</p><p>‍</p>",
  "show_notes": "<p>Having worked in Denmark, Poland, Spain, and the United Arab Emirates Marta gathered experience with an international focus. With her background in data and marketing, she combines her knowledge of technology, business, and law for analytical and advertising purposes. Marta specialises in building enterprise measurement plans which secure the integration and activation of data at her clients'.&nbsp; Marta builds solutions that support digital strategies, from setting business goals, to delivering them.&nbsp;</p>",
  "guests": [
    {
      "id": "marta-florentyna-saratowicz",
      "name": "marta-florentyna-saratowicz",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/optimizing-for-reach-and-performance.jpeg",
  "language": "en",
  "type": "podcast"
}