{
  "id": "smashing-bias-myths-plus-why-600-psychological-principles-for-driving-behavior-is-total-bs",
  "title": "Smashing bias myths (plus, why \"600+ psychological principles for driving behavior is total BS)\"",
  "description": "We learn why the whole concept of getting customers \"hooked\" is ludicrous and why there are way less behavioral principles than you might think.",
  "date": "2025-01-08T20:07:07.493Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/d4756fbb/08c9e915.mp3",
  "transcript_url": "<p>Brian, welcome to CRO.CAFE, and of course we need to establish your authority. That's where we need to start. Why are we listening to you? Some people might know you from Twitter your CXL courses, your articles but for those who don't can you please tell us a bit about your backgrounds and what you're doing in your daily life?</p><p>Sure. And also that thanks a lot for having me here. This is awesome. Here's my authority pitch. So for me, I'm a specialist in using behavioral science and psychology, and I temper a little bit with a neuroscience and my shtick is looking at how this operates in a digital mediated environment.</p><p>So that means in websites and mobile phones, Tech and actually my background was in social change. So before I got into pure, like online change, it was all about changing population level health but using technology for that purpose. And then later on My career, got a little bit more interface focused.</p><p>So getting more to like the UX and the front end design. And one thing I could add is I'm not just a academic ivory tower theoretician. I am, I work hands-on. So actually I worked for many years in tech. I was a network admin at one point in my career. I program at PHP Python. I build all the technologies.</p><p>I do all my ads. I worked frontline. So I actually do all implementation. So I'm not like, high level theoretical person. Actually, technically I am, and I have the scientific papers to back it, but I, if I don't get my hands dirty, I don't feel like I'm learning. So I, and I make sure I'm up with the latest.</p><p>Stuff. I heard my next life will be a developer actually. How do you go about mixing those two? Is it like, is it so completely split? You spend two and a half days of the week on theory, two and a half day, a week on practice, or how does that work? Yeah, I think it can be a little tough. &nbsp;Maybe I can tell you about that in my career.</p><p>Cause also I get approached by a lot of people who want to work in the area, similar to where I operate in this. And it's just, it's an intersection between psychology and tech, right student it's like an overlap. So in my career I. I'm a creative person and I have a lot of ideas. So I always push my bosses and I was throwing forward ideas.</p><p>So I could, I can somehow get that integration. So I always found jobs where I was working in the two. So some jobs were more like pure technology. And I was never fully satisfied with those and that some were like pure behavioral science. So I was working in crime prevention for the federal government of Canada, and I couldn't get my team to do anything digital.</p><p>And eventually it was like, eh, this has taken me off. Girl science was not fulfilling. I, and most of my career has been about the two. So I. Let a career like this. So that means you worked not just with the implementation, but the strategy as well. So that psychology gives you the insight and the strategy and gives you the the wisdom in how you implement.</p><p>And the technology is about mastering your medium. If whatever Jimi Hendrix is a master at playing guitar. Rembrandt master at painting Abba masters at singing masters at different crafts. So for me that the tech is like you would have straight strategic insight with no ability to implement, right?</p><p>If you only had the tech and if you only have the strategy, it would all be theory with no ability to implement. So you need both. Yeah. And I think when a lot of people listening to that podcast theories are mentioned quite often we often talk about it's either BJ fork or Cialdini, of course.</p><p>There's this whole list of behaviorally economics Ghanim on of course is what we talk about. We have this amazing list of a couple of honors cognitive biases on Wikipedia. What's your view on these? How do these all relate &nbsp;and how do you work with them? Do you work with them?</p><p>Oh, yeah. Yeah, absolutely. So th those are popular theoretical frameworks and models. And &nbsp;but the way you work with a theory is, you'll have to understand its assumptions and background and what a lot of people don't understand, and they get pushed around, like someone who's not really street smart and hasn't been around the block is they tend to buy into some of the dogma.</p><p>And a lot of the assumptions, but when you work as an academic in behavioral science, you say, Oh, it's just that theory. And that theory has these assumptions and it was designed for these applications. And normally it has these principles that are it's building blocks and there's a lot of other backgrounds.</p><p>So you approach them as different frameworks that generally serve a purpose and a different area of applied psychology. So Cialdini developed a system that was for sales psychology. What people don't know about Cialdini is I understand. And his doctorate, he started went undercover with what we would probably call to date, very sleazy sales strategy style, and like high pressure telephone sales, stop that you might have a moral conundrum with it.</p><p>You're working or you will have very good defense mechanisms if you don't like cognitive dissonance. And you're crossing some of those ethical lines but that's where he did his research and need to still principles. So Cialdini developed a system that. Was basically structured around that one application but you would never, ever dream of using Cialdini's framework to build a health behavior change app, right?</p><p>Like it's great for conversion optimization because it comes from studying the psychology of sales, but it did not come from therapy. And then BJ Fogg's model is a bit more of a he has a bunch of models, right? So it depends on what one model, but let's say the Fogg model, because that's what most people are talking about.</p><p>So with his easy and ability framework so BJ actually, he's an interesting player in the behavior change space because he, I was actually at the conference. I had a series of conferences and I felt like he was playing one on us. So BJ was trying to climatize a lot of people in the persuasive technology academic.</p><p>Community, which is actually a very small community of scientists. And I think he tried to get us on the behaviorism. Like I remember when he confessed, he was a behaviorist and all his like crying. He was like coming out, admit I'm a behaviorist. So he really brought behaviors back into the fold because it was very unpopular and he distilled very basic principles that are required for almost all behavior change.</p><p>So his framework is a very broad one. So basically I would say violate BJ Fogg's principles at your peril, it's a general. Set of principles that apply to most situations. It gets into the core of how like our dopamine circuits and how we enforcement learning operates. This is how humans insects, I believe plants as well.</p><p>Micro organisms. It's like how learning operates, right? Like he's really difficult core principles and his core principles are actually not his. You'll find his core principles in a number of other frameworks. &nbsp;But he put them together from a behavioral perspective. So with with his approach, it's like pretty much standard practice.</p><p>You should always be using it. Cialdini has got like the set of principles and we could go on and, there's a different story for each of the things. Yeah. And for me, it also feels &nbsp;the BDA folks are way more. Like I said, it's way more basic in, in how things function. How are organisms finishing?</p><p>Because when you look at the child anyone's there we more influence also by by social changes and they're not so basic that they're not influenced by that. For example, social proof of course, when he was this pretending to be the sleazy seal car salesmen. And doing this maybe in, in one-on-one situation, his book is falling from 1983, there was no online. &nbsp;But now when everyone's getting used to this seeing 500 people reviewing a product very positively probably doesn't have the same effect anymore. Yeah. You don't necessarily believe it anymore. There's some skepticism consumers now. Yeah. Yeah. You could only use a persuasive design strategy for so long before everyone figures out.</p><p>What's. Going on and then they become street smart ag. I don't know. Do you travel much or have you been to not in the last year now than before. Yeah. Yeah. So I traveled a lot. I filled up a number of passports to the point of having no pages left and I backpacked for 10 months when I was at 23.</p><p>That's when I did it. Yeah. So I went to a lot of like places that were like dangerous and new. And I remember the whole thing of being, they call it fresh off the boat. Like when you arrived, people try to exploit you because you don't know the games and the culture. And all the scammers are on you.</p><p>And after a while you get used to dealing with it. And you know how it works, but you don't know how the tactics operate and how the strategies operate until you've been. Been there a while and you're a bit street smart. I think it's the same with marketing tactics. So if you overdo a persuasive design strategy or behavior change principle, and we could get into, how we even call these things, so what we call them, but if you overdo them with an individual, yeah.</p><p>Th they're going to know how it works and then it's going to lose its impact. If you. Poorly implement them. Say you, you overdo it. Like Cialdini's principles are very effective. Like just because they came from like more aggressive sales strategies, because there's nothing wrong with them.</p><p>Actually. I think his principles are very high level and generally applicable. They're just not useful for. For everything. But if you overdo his principles, you will generally look like a sleazy hustler. And so you have to keep it tasteful and how you implement. So it's &nbsp;they say, what does what does a great.</p><p>A work of art. It's like a art. Sorry. A great work of literature is a good story. Told. So the story is like a generic plot narrative. And we humans have been saying the same stories so long. We don't get bored. We never get bored of those stories are wonderful, but we get bored of how those stories are expressed.</p><p>And we always want to hear it. We told them. From our generation's perspective. &nbsp;So how do you take that principle and translate it there's a lot in the implementation. &nbsp;So you can overdo a principle and you can overexpose a population to a principle. And here's the dangerous thing. If our principal becomes associated with con artists scammers, which I think many of the principles of psychology that are taught CRO.</p><p>They get adopted in that way because or saying, Hey, that's worth all these people are doing it. And then these things get built into all the templates that are distributed. And so most of that really effective psychologists, you based principles have been mainstreamed into the design patterns that we all pull from and then take it into the hands of sleazy individuals.</p><p>Boom, you now start destroying them. And now what was a good social norm gets perceived as a threat or as a lie and then good luck. Yeah. And I think we can mention with travel that's a great way to the further away you travel from from where you're based and then what's normal to you.</p><p>Yeah, the more basic you get with what works for you, and then you get to see the world in a different way, and then see, you have to revisit all these biases that you have. And. Figure out if they still work actually for you. As simple practical example is that's part of the world drives on the left side of the roads as part of the world draws on the right side of the road.</p><p>It's not necessarily that one's better than the other. I was just like a default that we've chosen to live with. Then there are, there's a lot of those and. You're under, you're probably not aware of most of them, at least not all the time. And unless you start traveling and then you'll figure out, Hey, this is the way we do.</p><p>This is not normal. Let's let's I need to refigure re &nbsp;when we compose my brain to work in this new situation. Yeah, absolutely. Yeah. &nbsp;We have bitchy wait to things, so we get used to everything around us and when something's very different. We don't know how to interpret and it really stands out.</p><p>And when it comes to design, I think also th this this impacts on like marketing in general communications for anyone CRO and that basically if you're copying what everyone else is doing, and if there's a popular psychology book that has some strategies that says, Oh, do this and that Mr.</p><p>Magic, psychological formula for getting higher conversions. Once I grew up, does it. It stops having impact. It's like an arms race, right? So that's now the baseline, people get used to it. And then your messages start habituating like phasing and the danger is that you, you get habituated, you get used to those things really fast.</p><p>If you could move to another country, they won it. That might even be scary, but you're probably used to it after a week. And that's at the same I'll show. I think for as a CRO specialist, when I'm working for a company the first day you might still see you all things wrong, but after a couple of weeks you get used to, okay, we do this because it's.</p><p>It's easier for the backends. It's easier for for marketing to do with Israel, because this is how we do it this way. And that's why I love doing a user research, actually sitting next to people or watching people go through a website or using a product because it brings you back in it States.</p><p>This is a very similar experience to me then moving through for the first time to a new country and that first day, and then, Oh shit. That's. Why are we doing this? This is stupid. I didn't know. And people may people see this in a totally different way and it opens your eyes and see your own product or a website again, through someone else's eyes.</p><p>Oh, yeah, I totally with you we all become blind to our imperfections at some point things from the user's perspective that you can start saying Holy crap. Like I don't do you ever, I have like also times when I have a problem on a page, I'll go on, I'll watch a couple of clicks sessions and see what's going on.</p><p>And a few times I was like, Oh my God, did I just sign that? Someone was on the phone and then they reached a certain point in the process that was like, Oh my God. Okay. Now I know. And you're like, yeah. And you. You, sometimes you won't even use software and in ways that are like you can't conceive of how your users will use your software, they will do things in ways that are inconceivable and only the user testing and getting in at the graphically behind them and seeing what they do. It's like the only way. Yeah. Especially with, if you're designing something you use, one of the default assumption is, Oh, okay, it's going to be on a website or you're using a browser and this is the only thing they're doing right then, or right now.</p><p>And usually that's not the case. They have a couple of browsers open and they're looking on their mobile phone. Then they're stopping midway to get loan insurance. That's usually not, that's even hard to replicate in a user studies of course. But even without debts it's very eye opening now usually to do that.</p><p>So I'm wondering, so when you start, or when you brought in for a new project, you have a very strong foundation in both the theoretical part of the behavioral science and the practical parts when you started, what do you start. It's, I guess it's hard to completely keep them separate, but do you start thinking about, okay.</p><p>Start thinking about theoretical models and how can we solve that? How can we validate it with data? Or do you say, okay, we have this problem. Let's first look at the data and then see. If we can find some theory that can help us out here. I always start with reality before I even attempt to throw in anything theoretical.</p><p>It also depends on costs as well. Cause sometimes if you scope out a project it's &nbsp;and you agree that we're going to use. This tool for that problem that, you agreed to some degree on the models. &nbsp;And actually maybe I could back up and introduce something more complex to the equation.</p><p>So there's a researcher named Tatlock who looked at expert predictions and he spent many years looking at experts in what they. Predicted Tetlock is probably the brother of Dunning-Kruger</p><p>well to the psychology of naive optimism. So when he looked at his experts who make better and experts who make worse predictions, and he said, and this is one of the funny things. So the experts who make the worst predictions are the ones who are really confident. They sell you all black and white.</p><p>This is how the world is. And they look at the world from a frame of reference and they come with a sort of theoretical model that answers all the issues of reality, right? From their perspective. They're one, one, one view, or one trick pony perspective on reality and how to frame everything. &nbsp;They tend to have pretty crappy predictions.</p><p>But they get most of the media attention. And when things don't work out, they tend to, develop skills and rationalize it. Things. The people who make the good predictions are those who look at the evidence and then play with a bunch of different models and say it's like this, but a bit like that.</p><p>And, probably work out. I'm about 80% sure that this, and they come with more of these qualifications &nbsp;and they're more flexible. They tend to have more accurate predictions. But the media hates them. And I think those people, and I'm one of those they tend to get you don't do as well in your business for winning client jobs.</p><p>You're not as strong as speaker because you're willing to look at reality and negotiate and be flexible. So it counts against you. And I think the market wants the one trick pony to come with the magic formula. So I heart, are you radically against that approach? So I look at the situation and then I come up with a model that is going to make sense.</p><p>In most cases when I teach, obviously I have to, I train people through models. But I don't train them to actually take anything off the shelf. I teach them to look at reality and then to compare models. And when you worked for many years in behavioral sites, you're, there's no such thing as we apply Cialdini to everything, which is what a lot of people do or you mentioned hundreds of behavioral economics principles, right?</p><p>There's these crazy lists. Which I can get into later, why I think they're completely absurd and actually had no scientific merit, I believe. And I could get into that. Why these over a hundred lists of behavioral science principles are actually largely baseless. &nbsp;But you could come with all these tools and then you could look at all the models.</p><p>So the health belief model, the theory of reasoned action, the extended parallel process model, you could take BJ Fogg's model. You can take the transtheoretical model, the theory of reason to actions and plan behavior. And I could go on, I can keep rattling off frameworks, but what you do is you have to pick the best models for the challenge.</p><p>And in that's not even enough. Now you have to adapt that model because the model require a little bit of calibration. And then what happens when you do that? Is if you fit a good model to a specific situation and it's really a good fit, then you're you set yourself up for better odds of success.</p><p>But if you come with a pre-fixed model, you might be using the wrong tool for the job. I don't know. I mentioned someone comes in for medical care and the doctor just boom, a penicillin or something.</p><p>Yeah. Yeah, exactly. But I do wonder, so I do feel sometimes that person in the room that's everyone's making decisions or assumptions and then yeah, you're the one saying. Yeah, but Mel not really. Weekends really be sure. Or have we validated this or why on earth? Do you think it's like this?</p><p>And but I think I hear from multiple segro people, they feel a bit the same, right? That you're the person in the room that's well necessarily negative Nancy, but. You're the one being critical about all those things. And that's basically what you're saying, right? That this the more experience you have in this, the more.</p><p>No more uncertain actually you become more &nbsp;it's quite a humbling experience to see all your predictions feel all the time and do these experiments over and being confronted with being wrong. So what would be your advice for zero people in handling this?</p><p>How do you approach this? &nbsp;To do not be seen as the negative Nancy or feel like a negative Nancy and be more, maybe more productive or more contributing to these situations. I love that question and I never I didn't expect you to ask that and it's a wonderful one because that's actually the reality of what most people who work in any sort of like applied psychology, whether it's.</p><p>More informal and more formal. You're going to face that once you're working with other people, you're asking for actual evidence. And then when you put forward, evidence-based design, conventions and strategies. Now you've got the challenge of getting other people on board. And, maybe I can start off with a bit of skepticism about human nature.</p><p>So I think it's generally human nature to conspiracy theories and I don't nonsense and high status pride or sorry, ho high status backed arguments. So that means the highest paid person's opinion will generally outright. Even if what they say is of no merit and whoever calls out the emperor for having no clothing.</p><p>If they're low level in a institution if it's a healthy institution maybe there'll be listened to. In many cases, there'll be ignored and in an unhealthy organization, you could get turned on for that. So it's always risky when you want to stand up for what you believe is right in the situation.</p><p>And maybe I could add one thing. &nbsp;Now have the credentials, right? You don't got the PhD and the long career and the big clients and all that. But I started in the trenches working my way up and I still, I sometimes. Like I work at a higher level, but I still have to deal with the same things.</p><p>And how do I get people trust me more? Cause I spent my years and I can, normally rationalize my arguments for things and explain them in a calm way that people understand. But I paid my dues when I was younger. I had a lot of all my ideas rejected when I worked in the United nations, I actually did a television commercial with Kofi Annan who had just won the Nobel peace prize.</p><p>And I was the one ultimately overseeing a TV commercial, put out. And my boss did not walk me to pilot test it. And I was like, we're putting out a TV commercial where the United nations, this thing is going to get played. We should maybe, and my boss was hostile. He was a game since I have BS and just whatever get out of &nbsp;so me and my friends.</p><p>Came up with this crazy idea. And because we're the UN and we're doing this a public service announcement commercial that was going to go around the world. We translated it into it was like English, Spanish, French, Arabic, Chinese, and Russian. Cause you know where the UN those are the official languages.</p><p>I'm not allowed to pilot test it. We didn't know some of the creative in it. We didn't know how to do so me and my colleagues, we came up with this scheme to run a secret, a lunch session where we've got people who represented all the cultures of the world. So we got some of our colleagues from Latin America, from North Americans, some Europeans, Africans, Asians, we've tried to be representative. So I created a representative. Like a cluster sample focus group. And then we did a secret lunch pilot test on this day. I got it. It was the funniest thing. So I started in behavioral science, like early, like I started in 1997. So this is pretty early.</p><p>And I was using tech then, so I had, I was undercover. Like now there's an appetite, but I actually operated in hostile environments where I, I come out my performance evaluation for having dare, done pilot testing and validation of creative. So basically the advice for for force heroes that find themselves in this situation is one build on your authority and to build a secret life where you can do test and the one that was about, but you can still, that's your advice basically build a second life.</p><p>Yeah. That's par for the hostile environment, there's started like 20. There's a goal right now there's a culture. So by today's standards yeah, let me give it like a more updated version. So for it, first of all, it could be your background, right? Cause I'm like, it's easier for me. Cause I, I spent my most of my career in this area, so I know the arguments and and.</p><p>It's hard to pull the wool over my eyes. If I think someone's being unfair and manipulative I'll see through it fairly quickly, but assuming everyone's sincere and straightforward what the best thing to do is to first of all, study your subject as seriously as possible to, obviously know your situations.</p><p>Cause the last thing you want to do is to get into a conflict with someone where you get to arguing, spat Okay. My biggest advantage. And this is a very weird one. &nbsp;If it's something I think many people should aspire to, I know Peter, you have a really strong background in behavioral science and you can probably do this.</p><p> Often spot people's assumptions cause I do a lot of training and I've worked with a lot of people hands on. So I work with UX designers, graphic designers. Like developers. And I know when they don't understand the key lesson in psychology. And I'm like, Oh, this person didn't they never learned gestalt.</p><p>Okay. I'll teach them. So they're arguing with me and they have a point of view cause they don't, I know they have, they don't understand basic gestalt design principles. And so I could say, &nbsp;think that. Project, could benefit from gestalt and I'll try and educate them and show them.</p><p>And then I'll frame it saying, Hey, maybe we can turn this into a learning experience. And then you could come back to me with your creative, but try it, try and get these proximity principles and a few other good stall principals in and see what does, and now, instead of, this being a standoff.</p><p>I'm helping someone with their career and their skills. So that's pretty much a win-win now in the future. I've addressed a problem. &nbsp;Often turn things into games like that. So also like a CRO person I'm with. All right. Normally CRO people are good, they tend to know the high level stuff not the details.</p><p>And I find most people that if it's a legitimate, &nbsp;if they legitimately don't agree, cause they don't know something. &nbsp;But there's like learning involved. They're offered like for it. The other thing is turning testing into a game. I like to have fun so we could see probably where I put out and how I do secret pilot testing.</p><p>So I really I'll ask people what. There are theories are it's sometimes I'll even give them a few principles to play with and say, Hey how would you do the creative for this? &nbsp;Let's say we use a social norm and something called the efficacy message. So a confidence boosting message.</p><p>We say, you know what? We think that. We're missing a social norm and efficacy message from this. Isn't what happened in good creative. And actually I try not to come up with the creative, I just give them the strategies. And I find a lot of creative people. They love that. It's a bit like a game for them.</p><p>They're learning. And then what happens is now your AB testing is now eh, let's crack it open and see who won or something. Fair enough. That's so much fun to have fun. I lost, I have lost a CRO Wars or with one person once it was a senior developer, he kicked my butt on a logo designed concept.</p><p>So I'm, and then here and then he's Clouding loser.</p><p>You're good. Other is also education and creating a culture. And then you, if you do things right, you don't be that person who's in the room being, trying to stand up, change your battlefield months in advance. That's probably the easiest way to do it. Ma'am have you ever the culture that career in in in games and gaming?</p><p>No, I not a big game. I have a colleague, Dr. Shad Rowe sees a game of education and education specialist. He's, he plays like a where our world of Warcraft at night. I would cold Turkey. I think about the age of, I think I was 27 was StarCraft. I said that was it. I will never play this again. This is crack right talk at the time, but it was like horribly addictive &nbsp;and that's it.</p><p>So I go voided games. So probably not mine. Good. Hey We were just, you just mentioned the we just spoke about those those principles to cognitive biases, the enormous list that's we can find on Wikipedia that's men and that's One of the brothers is less than what's. &nbsp;Let's &nbsp;you can tell us what's wrong with it, what it, what is maybe let's back it up a bit.</p><p>So what is a brave brachial giant change principle. Yeah. So before I go out and it's why, or maybe, why. How, what Brian rationalized trashing the orthodoxy here. We're being a bit iconoclast. Cause I'm about to tear down. I don't think a lot of people hold to be true.</p><p>Yeah. That's a wonderful question. So what's it. Behavioral change principles. And so it's. It starts there. So a lot of people say, we take that giant wheel, that's been floating around with all these cognitive biases. And you pick one of them or you take any of Cialdini's behavior change principles, right?</p><p> You can ask someone why do you even believe that's true. Is it real? Is loss of version real? Is it true that in all situations that humans fear loss more than they desire a game is that in mathematically proven is the Principle of reciprocity is that, always true or not true.</p><p>And you can challenge these. Now, the problem is that once you get into behavioral science it's like entering a bureaucracy and the rules get more and more dense than the distinctions get deeper and deeper. And you go from a taxonomy of. Six behavior change principles. And now you're at 200 behavior change principles.</p><p>And when you get down to the 200 principles, it's Oh, this principle is a combination of that. And it's spun in this way. And &nbsp;so you start splitting hairs at some point. So where do these actual behavior change principles come from? And then let me answer that. And then we could go back to the giant shopping lists that people throw around is almost like magic solutions for how to change behavior.</p><p>Yeah. So yeah. And there's also, there's a little bit of politics in here as well. So maybe I could throw that in. So one of the requirements for getting a PhD and one of the requirements for surviving, something called publish or perish. Is recognition. So you have to be recognized for your work.</p><p>And so academics are under pressure to have a new discovery, right? &nbsp;Oh, I found a new behavior change principle. I found a new copy was bias. I, I found this, no one knew about it, but I found it. So the easy pickings are gone. So &nbsp;self-efficacy saying that was a. Self efficacy was not in a number of early behavior change models.</p><p>That was like later at it. And I think, and Asian later I added that when like his transition from theory of reason action to the plan behavior was actually, it was a patch up job, adding social norms at, I believe it was social norms and self-advocacy or I think, or maybe it was just self-efficacy that was added to the mix.</p><p>But basically it was like, Oh, Huh, I I forgot that principle and it proved to be good. So a new principal had come out of nowhere. Assuming it would be so highly correlated with behavioral outcomes that people are like, ah, crap. I got to add that in my model sucks. And I add that in and now we get better predictive.</p><p>Patterns on the effectiveness of our model. &nbsp;So there's this competition and there's new principals and stuff. So the principals have come from old. The original old principals you'll find in the work of Aristotle that are actually quite. Popular and the old works of rhetoric persuasion principles, and actually many of the cognitive biases you'll find in the ancient Greek writings on the informal fallacies.</p><p>So these are rational argumentation tactics that are their cognitive biases. So that means are ways of getting someone to change through consent. And intellectual type of misunderstanding, as opposed to say a social norm, that of way of getting someone to change, which will be through social, emotional pressure versus a, another type of mechanism that drives the behavior change principle.</p><p>So scientists. Have to come up with these psychological models. Now, most of the behavior change principles are psychological based. And &nbsp;maybe I could do something that Jordan Peterson did, if this is okay. Explains a factor analysis is this is not to like suicide. How do psychologists actually distill what an actual behavior change principle is?</p><p>Because not a lot of people even know where to. Yeah. So let me explain one thing tactical cause. I can call anything a behavior change principle, anything I like, like I could say, I don't know, making someone stare at you for five seconds causes them to like you, or if I touch someone, it will cost them to trust me a little bit more.</p><p>I can say anything. I like. But now I got to measure that. So a lot of the behavior change principles, we know, come from psychological models where April scientists might make a survey question and they will come up with different things that they call a construct. So say a social norm which is a popular one.</p><p>We all know. And trust in the source of a message might be another principal. And that you can name anyone and anticipation of the outcome could be, yet the third w we could just start inventing these. So I could build a statistical model. And then run it through something called factor analysis, and then correlate that to whether people did the behavior or not.</p><p>And then based on that, I'll start figuring out, Oh, are some of these principles correlated with behavioral outcomes or are they just different ways of saying the exact same thing? What factor analysis does, that's brilliant. Is it clusters similar things together? So what factor analysis does is it lets us cut through the nonsense.</p><p>So there were BA there are behavioral. Finally, there are behavioral economics researchers who have gone through and said, look, these shopping lists of a hundred principles is complete and utter nonsense. They get factor analysis. You know what their principal lists come out to. It's eight, eight, Yes.</p><p>Just &nbsp;you can write another book, you got to 6% plus one. So that's basically next the children's next book, and also depends on how you frame them. So if you frame the principles as broad things, factor analysis, we'll pull all the sub techniques into each other. Yeah, so you'll have the sub principles and that the hairsplitting tactics, and you need to know those, that's just part of getting better at and applied behavioral science, but the factor also show, you know what, they're just a variation of the same old. Thing at eight is not the actual number. I'd have to go back and look at the actual number from the paper, but it was, I think it was about somewhere in that number.</p><p>Also behavioral sciences in the UK. They reduced, I think about 120 behavioral science principles. And this was through consensus to around 20. And I think the factor analysis probably would have gone down even more. That sounds much more manageable, but also don't you. So don't you think it's also because of &nbsp;the people that then see those principles they issue, okay, this is a, this is what works and it works all the time.</p><p>You said, okay, this is a principle. I found this this is gonna uncle my work. Everywhere. And then we can apply it everywhere, but that's also an assumption that the person makes reading. That's not often necessarily what the researcher intended. They just did a research and usually. And from reading all those research papers, my experience is that's a word slightly better than B, but never never always or everywhere or that's and that's usually not the research research intention is.</p><p>But that's how it's popularized and then it gets into a list. Yeah. That's part of the absurd distortion that happens when knowledge goes from the scientific community into industry and between that are the gurus who discord, like that's where you BJ, Fogg. His work ultimately he finally published and actually I saw you just got, at least he's like New York time bestseller and like nothing like Amazon is doing very well but his work turned into something called tiny habits about very small changes.</p><p>But look how BJ Fogg's work got spun into absurd conspiracy theories called hooked. Like you can addict people. It's like the actual academic. Called it tiny gaskets, not hooked.</p><p>And then my doctorate, I spent two years looking at all the meta-analyses and the big reviews of these behavior change tools and behavior or something was so low on the list. It's a requirement as a minimum for communications, but its effects are very small. And so tiny habits got spun it to getting people hooked and addicted.</p><p>And then people believe this. And now a very small principle that came from a small area of research is something like you said, people now start applying it to. Everything as if it's going to have stellar effects across the board, wherever you go. And that is utter insanity, those AIDS or those 20 that they bolt, boil everything down to they still have their they apply in certain situations and not everywhere.</p><p>There's still not a universal apply them everywhere. Yeah. They're most of the behavioral science principles are context dependent and. What people also don't know is that when you actually you'll know this by a lot of people are more lay and practitioner level in the use of these principles.</p><p>They don't know is that in every scientific paper, there's something called the limitation section. And the limitation section actually says how generalizable that knowledge is. And what academics do is they limit the heck out of almost everything they write. They'll say that, this nudge strategy worked with middle age women in suburban Nebraska in December of this year.</p><p>And it's that's the population. And now you're like, you're going to get everyone hooked or something. And the distortions are incredible. But there are some principles that are more universal that do work time and time again. And the broad frameworks tend to latch in onto those very broad principles.</p><p>And I think those you'll mainly find explained by our cognitive processes and our emotional systems and some very &nbsp;rock hundred laying factors that drive human behavior. And those tend to be a bit more generalizable, but yeah, a lot of the principals get spun to the point of absurdity and I have to do, I have to deal with that in my training.</p><p>I have to do a lot of debunking and it's like the impact is the other area of distortion. So not only is it generalizable to all humans, right? But the, so a lot of these papers will say this only impact that this had like about normally a thought published as a percentage, but let's just call it a percentage because that's what many people understand, right?</p><p>So let's say this improved outcomes by 10% once people figure out the principle that improved outcomes by 10%. Once the gurus misinterpret the science and start misleading the public. What they're going to do is going to treat it as a hundred percent. I think it works all the time.</p><p>It's watch. I see that constantly. And then, and the people, and then something that was like a marginal improvement is now like a massive like transformative strategy. And you're like we're where did that come from? So that, so there, it's not just gender, there's a lot of distortion. It's not just the generalizability problem.</p><p>Yeah, I think that's a problem. A lot of Euro people encounter when they start their career or start at a new job. And if the three year old rule that's your old role at the company is fairly new than a lot of people. The people that hired you or the team you combine they, they have those assumptions, right?</p><p>They're there at the beginning and the Dunning-Kruger charts where they may have heard some of those. Principals and assume that, Oh these are all true. And that, that's something you need to in an internal battle that you might encounter say, okay, but it actually doesn't work like that.</p><p>Unfortunately there are a lot of ways it doesn't work. We don't know if it's gonna work on our sides and we need to do, basically, we need to do a lot of research and validation to figure it out what's actually works what works for us or not. Yeah. That's like a very good point. If, actually, if you're called, if you're a more deep into applying psychology and some of your colleagues are on board sometimes a little bit of knowledge is a bad thing, but I think normally most people it's not a problem at all.</p><p>And it's in fact that you would think because while you can often do say, okay, let's go with the social norm. I don't like using the word social proof and that's fine. You can use it. It's just my I'll call it a social norm because I actually did a study where we split different types of social influence but have been proven APAC behavior.</p><p>And we actually use we actually couldn't find social proof as a distinct principle, separate from a social norm. &nbsp;Did a statistical study in these public systems in the lip. But so in fact, social proof or social norms will have many sub-components. So underneath a social norm, that could be something called social facilitation, where you're making, letting people feel they're being watched by other people.</p><p>You can have social learning principles. Where you're educating people by having them watch other people do things. There's obviously the social norm itself and also within social norms, there's multiple sub categories of how you would implement the norm. And that's where the hairsplitting calls.</p><p>Cause you need to understand those. So what I sometimes would do with people is they say, okay, let's go with the social norm. W do we want to do it like this or that styles? Anyone want to do some research on different ways of implementing it? Because. People might not know the names for all the different types of social psych principles and social influence principles, but as they play with different tactics that work they'll actually be playing on actually sometimes very different principles of social influence, thinking that they're implementing a social norm or social proof, but they're actually implementing a completely different.</p><p>Social, psychological principle and I'm okay. Cause you could do well with tactics. Just as long as they're open and they're testing, I figure that the testing will point you in the right direction. &nbsp;Your users will pretty much tell you. &nbsp;I will get blue in my face Oh, that's, you're using this principle.</p><p>Not that I could let it go. And then any of the worst case scenario, sometimes for diplomatic reasons, I will accept a something that I'm really against. And I'll say. If you're really morally against it, sometimes you have to say, I'm a Gates. This I am not accountable. If you want to go forward, I'll give you all the glory.</p><p>That's like really bad. That's a total conflict. And it very rarely happens a few times in my career. It's come to that. But normally it's okay let's just task it. And maybe I'm wrong as well because could, I'm a big. I miss God this expert in my area.</p><p>If I make mistakes all the time. And like the users are the ultimate judge, so I'll let them overrule my judgment any day. So when you, when do you know went to when you're applying, if you're applying the right principle and if you're applying the rights strategy for the challenges.</p><p>Yeah. That's a great question. Maybe I could talk about a collaboration I did with a good friend of mine. Michael Lee. Who's a he's a fairly prominent conversion optimization specialist. He's a huge Daniel Conaman fan. And we met like many years ago and we've been good friends ever since. He asked her, I'm just saying, yeah, we did a course in conversion XL together.</p><p>We talked about doing a course and then pep approached me. And then I wrote to my say, Hey, remember we said to a course, do you want to collaborate? And then, so we did a great course, but. And maybe one last thing. &nbsp;Knew we were destined to be good friends because he had a tattoo on his arm that said, Hey, Oh, I think it's, Hey, ho let's go.</p><p>And I bought, he served for the Ramones when I was younger. We're all good funding. Nice. Yeah. So you guys worked together on the core four for CXL you a more afforded from the theoretical background and Michael, more from the practical. Let's run a lot of tests background.</p><p>That's exactly it. So I, and so I wanted to, maybe I'll tell you this story cause there's two ways of approaching it. So how do you know what is the right principle for the job? So what's awesome about Michael is, he's spent 10 years split testing before he got into psychology at all.</p><p>Everything he knew was it's amazing. It's from brute force and Michael is incredibly it's uncanny how he has such a natural sense for what works. And that's, so he's got hyper tactical knowledge and he told me like, at one point he's I just know, you'd have to put all these trusts things next to the button.</p><p>I don't know why, and I know that you have to color it like this. And it was very, yeah, it's like this incredible tactical knowledge. So he could tell you where you put every UI element on the page to get better conversion. And after 10 years of split testing, he got incredibly good at that. No. I came at things a little differently.</p><p>I started hands-on so I was building and I always worked in Metro mate, but I was not a early adopter of AB testing tools. I think I started on those a few years in after they were exploding. So even before people use the word CRO think or. I was there just when it was taking off but they're true.</p><p>CRO experts. I don't even think CR like CRO is not really a thing for many years. Just like UX, wasn't even a thing, attractive design. Wasn't a thing. Digital, like all the professions we have. We were using for well over a decade before they even had formal lakes. So I &nbsp;is also basically doing user research, using qualitative and quantitative data, combining that and doing validation.</p><p>So in that sense, it's existed for a very long time, but somehow Ciera was very much linked to doing it on a website. Of course. But those principles are. Yeah. Yeah. They've been around for so long. And so Michael went on a tactically and me, I went through I always did a lot of measurement and hands-on work.</p><p>But I, I went deep into it. I was just like a PhD. And then my PhD, I was analyzing, the principles that are used in behavior change, taxonomies, and used in technology. So after several years, I could look at any page and tell you the main principles that are being applied and that can generally guess.</p><p>How well a product was doing because, and this was way before anyone was doing any work in psychology. So when I started, most people thought I was insane for looking at psychology on the web. So who would do that? That's stupid. But so I had this incredible knowledge. That's right gears analyzing the psychological principles I've published in the scientific literature and like some prominent health behavior change journals did a full statistical meta analysis.</p><p>It was like pretty solid on full tactical now. So I could look at something and approach it from a theoretical and framework perspective. Michael could approach it from a tactical spread perspective, &nbsp;we're not that radical because obviously I do a lot of measurement and I also.</p><p>Would know things based on, what works in practical applications and seeing impact metrics. So it's not like I'm a pure ivory tower, academic and Michael got into psychology later on and he started up think consuming everything with an incredible appetite. And he became a very deep expert in to Daniel economists' approach.</p><p>And. Content for behavioral economics, which I could say Michael probably knows behavioral economics principles deeper than anyone. I know, like he so we both came at it, but we have these strengths and I think we recognize them. We're also musicians, so we never did a gig together, but I think we would probably perform well on stage.</p><p>So there's two ways to approach it. What is the right principle for a job? So this comes down to something called fit and you might know it from having a lot of tactical knowledge. So that tactical knowledge, if you've worked in the industry or in an area, and you've been working with clients and customers for many years, you will tend to know what works just from brute force, trial and error.</p><p>You'll eventually figure it out. Basically you succeed or you fail. And if you're still standing, you're doing something, so you. You figured it out through brute force and you know what works now, the problem with that knowledge is it normally doesn't translate well. So you can't go to a neighboring application.</p><p>So say someone who's optimizing insurance landing pages, &nbsp;can they now go to a nonprofit and optimize the donation page? Probably not, or, a lot of things will carry over, but there's a lot of tactical things so will work. And now let's look at things from a purely theoretical perspective.</p><p>So I have these very broad frameworks and I could look at almost anything in any industry. And I could pretty much guess, okay, they're using this. I see how they're tied up. I could go into the industry and I could see, okay, most people in this industry are making this and that I could rattle off almost instantly all the general principles.</p><p>And I could reverse engineer the psychological strategies used by your tire industries insanely fast. Cause that's what I specialize in. That's just my shtick. I spent a lot of time doing it. And so between the two, you can get a sense of what works, and figuring out the, what is the right principle for any challenge and context is something you would call fit.</p><p>So what's the right fitting principle and you build that up through years of experience. So unfortunately there is not an off the shelf answer to that. So years of experience will help you to understand that the. Stopping with the mindless application of behavioral science principles is a good way to get better at it.</p><p>And going with what is the behavioral science framework that's most appropriate to mind work? No, that means you'll have to get into theory. And a lot of people don't like that. They love their magic shopping list of the 10 psychological principles that will hook your right and all that nonsense there.</p><p>They. So it will require an investment. And I, I try and help my students. I give them the frameworks and I help them create the judgment. Some people don't want that. I know they want the magic solution that works a hundred percent in all situations for all humans. Unfortunately it doesn't.</p><p>Does it work? I don't if you could give it to me. Yeah. I'll take it. So it comes down to like playing with the models. Reverse engineering and industry is a good start. &nbsp;You could use some sneaky tools, use some spite technology. I don't know, use like SpyFu or SEM, rush, try and figure out who's spending money and where the competition is and where there's landing pages.</p><p>You might not know the conversion metrics, right? You could use some scouting tools, try and find the landing pages in the industry where, there's something going on. That the needle is tipping and that there's something in there. You do a review of those. Don't steal a single idea cause that's theft, but figure out the principles and then go back to the drawing board and use that to do things in a way based on your own user research but never, ever copy principles.</p><p>Verbatim because what works in one context can fail in another. So it's insanely dangerous. And my also advice is never steal tactics because tactics are very dangerous. Like I see when I worked on the agency side, when I worked on the agency side it's when something worked at the one client, we often tried copying that over to other clients.</p><p>It usually didn't work well. Yeah, you can get backfires very easily from that. Yep. Yep. Hey so w when you ditch, obviously, so when you get a fresh batch, a batch of students, one of the most common. I guess misconceptions or the most prevalent misconceptions that you need to restart the bunking right away.</p><p>Oh yeah, there's a few. So one thing I now do more and more of is I tell people, look. Applied behavioral science is a research heavy process, right? So that means, there's a lot to learn. And it is, and we're going to implement it in a very user centered and user driven approach.</p><p>So I try and back up I, every guru and expert will tell you, satisfy your users. . Standard. So I try and set the expectation that look I'm not going to give you a magic set of principles that work in all cases. Another, so another misconception is that there are these magic shopping lists of what works in all cases for all people.</p><p>And it's so I try and set the expectation that it requires a bit more of a flexible approach and requires you to shop around. One thing that I deal with, so I I train everywhere, went from people who are absolute beginners to world elite designers. And also I train a lot of behavioral science and behavioral science teams, just because for a behavioral science team, I'll be T P I'll be teaching my peers, but they recognize I'm their peer who specialized in digital.</p><p>And so I have. A very deep knowledge only, in my niece. And I'll even tell those some of the more experienced people said, I need to tell you a lot of things you already know, but I'm just going to show you how they apply, in, in a medium that you haven't worked in. And that's important because there's no guarantee.</p><p>So one is that. It's setting that expectation that you're going to have to put in some effort to learn things. And there's maybe. I actually, there's one maybe other thing. And it's something that's changed in me quite a lot. And that's yeah, we were talking about behavior change principles.</p><p> Ended up segmenting my course into behavioral science and neuroscience. I called my second course emotional design, but that's. It's the it's neuroscience at because decisive emotions is neuroscience, right? It's neuroscience gives us more understanding of emotions than psychology does.</p><p>And I know that might sound funny to people, but you're all science through you actually. Chop open the nervous system and you take a look at what's going on a bit more literally. And so we have a better understanding of emotion. So it's &nbsp;don't do this at home, by the way. Don't shop junk, shop over here and ever assistant under that.</p><p>What kind of, if you have, neurotech like here I have my my visual cortex and other things, but yeah. But otherwise don't talk, open your brain and measure your emotions. Yeah, actually, why gets taking your policies that easy way to do it? But the other thing is to set the expectations that emotion-based design and more and applied psychology or behavioral science is more dogmatic.</p><p>So I try to tell people it's actually behavioral science is really easy. It's more like just. Learning a bunch of principles that fit into these models and then shopping around for the best fitting one. And then it's actually a fun and creative act. And that's the other thing, because I also, I did improv for a little bit of time and people don't realize how fun it is to apply behavioral sites. And I train all these, sorry. Earlier I mentioned, I trained people from beginners to like elite designers. I also train public health officials and then prominent behavioral scientists and public health. And they're shocked. These people have been wounded by very stiff 500 page of behavior change books.</p><p>And I show them how to pick the principles and models. But then what I do next is the crazy thing that no one, most people don't even know about. We played game of improv at that point and we have fun and we do a creative process and that the science and creativity go so well together. And th I don't just say this dogmatically people crack up laughing in my class.</p><p>We have so much fun. These are the best moments when we do that handover from the card analysis and research, and then we're getting creative if you do it right. It's awesome. So that's the expectation that has to be cracked. It's not stiff. It's fun. Definitely something that's heroes can copy.</p><p>I think I set the expectations right. When you're starting to have fun. Let's do that. Let's do that. Brian final question for you. When you look at, &nbsp;yeah. When you look at the profession, the people working in that compared with what you do, what's the insight that you have that you think that Shiraz haven't.</p><p>Got up on yet. So what should they invest more time in, but yeah what the heart of everything I do and let's just keep going more and more is going back to actually one of Aristotle's principles. And, &nbsp;the whole concept of humans are driven by their intellect, emotion and lizard brain.</p><p>So there's something more to that. So that's actually just say that's similar to Aristotle's concept that you appeal to the intellect to the emotions, but then it's the credibility of the speaker. And so I think forming trust with the brand is important. So what a lot of people don't know is that humans interact with brands similar to how they interact with other humans.</p><p>And I know that might sound insane. There are now studies that show you can manipulate Rand. &nbsp;An interpretation of a brand and your emotional connection with a brand, with a couple of spritzers of oxytocin spray up the nose. And that social cognition, which is manipulated through a couple of oxytocin's fruits is also impacts on user brand relationships.</p><p> In that having an emotional connection. With an authentic credible source behind the message is the main thing. So it's like authenticity and I can't give any more advice on how to establish credibility than this. Be credible, know your, know, your stuff and act in the interest of people and be authentic.</p><p>And I believe that will carry through and the rest. We're just thrown on top of that. And here's the other thing from all the studies I do. If you violate that credibility, this is what happens. You could do your own testing. I see it every time I test this people, a well-designed website that fails the credibility and trust test.</p><p>Can instantly evoke fear and anxiety and distrust. That is like fatal flaw. So be authentic as it's made the Brian, thank you so much for for your time and sharing all of this with us. What are you working on the next this year of 2021. Yeah. &nbsp;Am actually in a. Retreat mode.</p><p>So while COVID is still going on I set myself a bunch of goals. So I actually I pursued too many things at once, so I'm not, I have a line. So first I'm cleaning up my school. So I've been working, hands-on implementing funnels. Do I? I actually, I decided I'm going to rebuild it all myself. I have contractors that work.</p><p>With me and it's a mess. So I, so the only way, got to bite the bullet and then I improve all of my technical skills. So that keeps me current. So I'm on that. I know finally writing a book on everything. So my entire training system, I'm putting into a book on everything. Yeah. I feel, I just want to get it out of the way.</p><p>And then and then next I have a whole personality system which I use as the basis for making predictions on principles to use with different people. So it's a behavioral personality system designed to measure people's neural transmitters and hormone levels, and that to correlate with the taxonomy of behavior change that I use.</p><p>And I'm using that for AI. Technology. And if that's not enough, I started teaching myself C plus I put this one down. It's what I'm really passionate about. What I really want to do. I don't think I'll have any time for this, but I'm very interested in mind links. Neurotech and how we design how are we designed for human conscious perception of spatial relationships and sound and tactile experience?</p><p>So going into the user experience, but in a way where I can transmit my experiences to another person. I'm so interested in brain link technology, which is why I happen to have a visual cortex reader with, and this is just part of it. I have a whole suite, I put it down like, Brian, stop this you're insane.</p><p>You're too distracted focus. So that's what I'm passionate about going to, I get that. I get like video games. I'll get off that dopamine kick for now. Yeah. So let me know and know when the book is done, then we can do a podcast on that. And after death, we can do another podcast on the Neuralink.</p><p>Yeah.</p><p>From a question who should I ask to come on the podcast? Oh yeah. So I I just had a couple of friends who are an orchid and the people. So my friend Agnes quite did some studies with he's a good person to speak with. And he's now a professor in Paris. He did his doctoral research on social psych and I did a study with him.</p><p>So he's good to speak with if, say you want to go to the New York, the nuance of just social psychology. And how it operates in technical environments. And he could give you a ton of examples on the basically, if you want to say, okay, social proof is a broad concept. But it's, if you want to go a level down into all the social influence that is correlated with it it's going to be social norm, but here are all the other highly correlated social site principles.</p><p>So you go to that one other person, David shadows is a. A friend and a professor in gamification and education. So he could talk about gamification designs, but it for engagement this stuff a lot of it is stuff you could probably talk about LMS as it might be outside of conversion design.</p><p>And, Agnes has work is going to be way more of this also social change. So when you get to the academics, they tend to get a bit off page and more into the broader campaign. Yeah, but like you said, it makes sense to have a theoretical understanding of what you're dealing with.</p><p>And I can get a sense of where this, where are these theories actually coming from our, and to be critical about them. Yeah, Brian, thank you so much. We're way past our time. Thank you so much for for educating us and sharing all your experience with with us and definitely looking forward to that book.</p><p>And yeah, said let me know when it comes out and then we can promote it under our audience. Thank you so much. Thank you. Thank you so much. Have a great day. Bye-bye.</p><p></p>",
  "show_notes": "<ul><li><a href=\"https://www.researchgate.net/publication/8040680_Making_Psychological_Theory_Useful_for_Implementing_Evidence_Based_Practice_A_Consensus_Approach\" target=\"_blank\">Making Psychological Theory Useful for Implementing Evidence Based Practice: A Consensus Approach </a><a href=\"https://www.researchgate.net/publication/327369084_Dimensions_of_decision-making_An_evidence-based_classification_of_heuristics_and_biases\" target=\"_blank\"></a></li><li><a href=\"https://www.researchgate.net/publication/327369084_Dimensions_of_decision-making_An_evidence-based_classification_of_heuristics_and_biases\" target=\"_blank\">Dimensions of decision-making: An evidence-based classification of heuristics and biases</a><a href=\"https://en.wikipedia.org/wiki/Principles_of_grouping\" target=\"_blank\"><em></em></a></li><li><a href=\"https://en.wikipedia.org/wiki/Principles_of_grouping\" target=\"_blank\"><em>Gestalt principles</em></a><a href=\"https://en.wikipedia.org/wiki/Dunning%E2%80%93Kruger_effect\" target=\"_blank\"><em></em></a></li><li><a href=\"https://en.wikipedia.org/wiki/Dunning%E2%80%93Kruger_effect\" target=\"_blank\"><em>Dunning Kruger effect</em></a><a href=\"https://behaviormodel.org/\" target=\"_blank\"><em></em></a></li><li><a href=\"https://behaviormodel.org/\" target=\"_blank\"><em>BJ Fogg model</em></a><a href=\"https://michaelaagaard.com/\" target=\"_blank\"><em></em></a></li><li><a href=\"https://michaelaagaard.com/\" target=\"_blank\"><em>Michael Aagaar</em></a></li><li><a href=\"https://michaelaagaard.com/\" target=\"_blank\"><em></em></a><em>CXL Course by Brian: </em><a href=\"https://cxl.com/institute/online-course/psychology-neuroscience-cro/\" target=\"_blank\"><em>Digital psychology &amp; behavioral design training</em></a></li></ul>",
  "guests": [
    {
      "id": "brian-cugelman",
      "name": "brian-cugelman",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "https://youtu.be/Ow0YMdEJAiw",
  "main_image": "src/assets/images/episodes/smashing-bias-myths-plus-why-600-psychological-principles-for-driving-behavior-is-total-bs.jpeg",
  "language": "en",
  "type": "podcast"
}