{
  "id": "state-of-analytics-experimentation-and-personalization-with-browsers-privacy-initiatives-with-simo-ahava-ton-wesseling-and-steen-rasmussen",
  "title": "State of analytics, experimentation, and personalization with browsers’ privacy initiatives",
  "description": "Live at Emerce GAUC we talk about the current state of Analytics and in particular how browser are making our work harder :).",
  "date": "2025-01-09T14:36:18.242Z",
  "duration": 2123,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/f4fccb37.mp3",
  "transcript_url": "<p>Guido X Jansen: [00:00:00] Hey, and thanks for listening to one of the first English episodes of this hero cafe podcast. I started this in 2019 as a fully Dutch podcast, but more and more English speaking guests keep sneaking into the show. And in the near future, you can definitely expect more and more English. Contents. So I wanted to make things a bit easier for those that are interested in a podcast on CRO, but don't speak Dutch.</p><p>So what you can do is go to Sierra Delta cafe slash English, and there, you will find all the English contents on that page. You can also subscribe to risk Coopertino mail that will notify you when an English episode goes live. And if you don't mind the verge contents, you can of course subscribe to the podcast in your favorite podcast app, which will give you all the Dutch and English contents.</p><p>So thanks for tuning in and let's get started with this episode.</p><p>Simo Ahava: [00:01:01] yeah, my name is Simo. I'll have a, I'm a blogger, I think first and foremost. that just happens to be invited to speak at events for some reason about Belgium, about protein. I want to talk about project more and more, but nobody invites me for that </p><p>Guido X Jansen: [00:01:15] ever a written blog posts about Bill's him. </p><p>Simo Ahava: [00:01:19] Damn I haven't.</p><p>Guido X Jansen: [00:01:20] Yeah. That's where you're </p><p>Steen Rasmussen: [00:01:20] stuck. I know. </p><p>Simo Ahava: [00:01:21] I'll have to Jesus business idea for light bulb. Why have I not written by Paul jam? </p><p>Guido X Jansen: [00:01:27] Exactly. I'll do it. </p><p>Ton Wesseling: [00:01:30] Yeah, I'm Tom, I'm a blogger. I won't call myself a blocker anymore. I do still write articles even in like debt-free paper stuff. yes, that's the list of one I'm more community enabler or something like making things happening.</p><p>Evangelists in this industry, maybe evangelists too. That's a tough term evangelists, and I'm not trying to convince people who don't believe I'm hopefully enabling people to do believe to become better in this </p><p>Guido X Jansen: [00:02:02] fair enough. Fair enough. And Simo, you had a keynote this morning, about browsers mainly.</p><p>Yeah. So what was your main point? What do you want to. </p><p>Simo Ahava: [00:02:11] Oh, </p><p>Guido X Jansen: [00:02:11] good question for the audience to take a take home from that </p><p>Simo Ahava: [00:02:14] super difficult question, Christian, actually. So the talk was around introducing. It was like knowledge sharing talk. there was very little actionable stuff. It was more about what's going on.</p><p>And I think the key point of the talk was that we don't can't afford to be complacent about this stuff. We of lift our hands and say, but I didn't know. We need to know this stuff. And I think that it's anybody working in digital at the moment, any developers as well, just need to be aware of what browsers are doing and the talk wasn't about browsers in general, it was about how browsers are implementing tracking prevention, tracking, blocking mechanisms.</p><p>Which are just super important stuff for people working, maybe testing and analytics and ad tech, especially we're feeling it. And we need to know what to do about it. </p><p>Guido X Jansen: [00:02:58] Yeah. And Antonio, you run a digital agency that is impacted by this, or how are you impacted by this. How are your clients impacted by this?</p><p>Ton Wesseling: [00:03:06] I think we are lucky. Luckily that's what have like big clients that spend money in taking steps faster than the browsers are doing. Yup. that also makes me, I feel sad because the smaller challengers, which I really kind afford this kind of solutions. So they're getting more behind.</p><p>So the. The big fish are getting bigger and the small fish are getting slower. Some of that's not something I really like about this whole game, but, so far we're not really impacted, within a B testing. It can be a nightmare. If we are with a client that's quite low on data. So the effect we need to create is quite big.</p><p>If we could lose like 60% or even if we lose 20% of the data, Then the number of wins will go down by 20%. So the business case is less strong, but in the end for me, it's making decisions based on data. So if you have less data, you've got to take some more risks, but still basing the decisions on that data is way better than, </p><p>Simo Ahava: [00:04:00] yeah, exactly.</p><p>That's actually a super valuable. Point from time because it's easy to go on the conference stage and is just blast it. Everything's going to go to hell. We're going to lose our cookies, women and children first, and it's easy to paint the worst possible scenario. So we actually need people like Tony and we need people working in house to come and And dispassionately stay that by the way, we are seeing the impact, but it's not as big as some people say it is. So that's the key thing. Like we've been painting this future without third party cookie, and we've been extrapolating that to all possible different kinds of scenarios. And instead of doing that, we should actually empiric, we were working analytics.</p><p>We should have data to test what the impact is. So it's very easy to go. All neat jerky about it and say that everything's going to go to hell, but we can actually measure them. </p><p>Ton Wesseling: [00:04:47] I wanted a presentation in a UX community in the UK. but the title, it's unethical not to experiment on your users.</p><p>Because their opinion was it's unethical to run experiments without those people knowing which is a good starting point. But if you don't run experiments, don't not using the data, then you're just going to implement something that's maybe even hurting the customer more. </p><p>Guido X Jansen: [00:05:12] Yeah. And I had a discussion with, with parts of your colleague a couple of weeks ago, the first episodes of this year.</p><p>And we spoke about, the example was, that we have organization in the Netherlands doing all these kinds of campaigns. and they, I think a couple of years ago, or maybe last year, they did a campaign, next to the highways. I'm telling you not to use WhatsApp. But they didn't necessarily test it while many behavioral scientists might point out that.</p><p>Okay. Maybe in the first couple of seconds they will. Everyone agrees. Okay. Yeah. Maybe I shouldn't do that because that's a, that might be bad for me, but in the end, Literally at the end of the road, maybe more people might be hurts or worse. and they don't know. And so even if your intentions are good, you still should be validating if actually changes the behavior in the way you hope.</p><p>Ton Wesseling: [00:06:06] I have to first ethical question. if your browser. Oh, the browser of the user is blocking your measurements, but you receiving an opt in. From the user that you're allowed to track that user. It's like the GDPR is in place. So yes, you can check my data. You can share it with everyone you want. I do actively opt in on this, but then the browser of the user is like preventing this is it as a cold and then work around the browser solution and come up with fingerprinting or some other solution to trick the user </p><p>Simo Ahava: [00:06:39] anyway.</p><p>I don't know. it's it's different things. The user might not be consenting to a specific technology being in place. They might be consenting than if you do tracking, then go ahead and do it. But if the browser itself is denying the tracking from happening that the difficult is not just about an ethical question.</p><p>It's about an interpretation of intent. It's impossible for the site to know when the browser is blocking analytics. For example, it's impossible for you to know. It's this blocking happening intentionally by the user, regardless of GDPR, anything it's the user actually actively wanting to block GA or is it the baby being thrown with the bath water?</p><p>The user has just enabled some configuration default. Yeah. and the, I know that many people here and there are companies such as trace stock, for example, who are doing a really cool engineering feat, but they are earning on the side of, maybe the user didn't know maybe they do in tech that GA's okay.</p><p>And for me, I think that's part, the problem we're seeing right now, why browsers are doing this because browsers don't accept that browsers. These privacy engineers are earning on the side of absolute privacy by the user, regardless of what the underlying intent is. If the user is blocking, we have to earn on the side that they're doing that deliberately.</p><p>That's the kind of, and now the pool is going on between these two sides, are browsers absolutely correct. Or are. Vendors. Absolutely correct. And the truth is somewhere in between, but as long as we don't have a granular way of checking this. Then it's up to your own personal ethics. Do you earn on the side of respecting users without actually knowing what they are subscribing to?</p><p>Or are you willing to take the risk of doing this interpretation on the behalf of the user? Like maybe they just meant to block ads, but they accidentally blocked also GA that's the thought process. So </p><p>Ton Wesseling: [00:08:22] it's </p><p>Simo Ahava: [00:08:23] very, absolutely impossible to say yes or no to an ethics question because it's always a granular.</p><p>Maybe it depends. Maybe not. That's like the scale. </p><p>Ton Wesseling: [00:08:33] And then two weeks ago we were at super weak and Hungary on the mountain top. And then the Google tech management team announced five liters, the service that's fricking, and, you are finally able to tweet about this. And so you tweeted six suites and immediately the discussion became on, Oh my gosh, they're giving like this big gun, two people to kill everyone because now we can track every film.</p><p>Okay. Can you elaborate a bit on that and your take on that? </p><p>Simo Ahava: [00:08:57] Yeah, just to tell the listeners, my point that I was saying is that moving tracking service side is problematic because. As long as it's in the browser, anybody can go to our website and audit the data trails. You can see them in the network requests.</p><p>You can do a objective audit. You can say that this website is, has all these trackers, but what happens if the website only sends a single stream of events into a local end point on the server end point.htan.com and you don't know what happens after that, because it's happened to the black box off the server.</p><p>it's, it gets into a very interesting discussion because this, what GTM is doing is not new. You feel you've had service side proxies for years and years and years. GTM of course, because being a Google tool will explode it will become like mainstream. So now we have to start looking into, is it okay that all this stuff happens in the black box of the server and what can we do about it?</p><p>What kind of tools? What kind of audits can we do? privacy advocates have no more tools left to tackle and will legal frameworks have to implement even stricter on even more specialized and specific stipulations in place, because that's the only thing that can be done after that. So browsers are obviously really interested in knowing what happens in the server, but the current attitude of things like ITP.</p><p>For example, is that as long as it's just the vendor doing horrible stuff with JavaScript, that's what ITP blocks. But as soon as the site takes responsibility by creating a service side endpoint or doing like a first party tracking, then it's not in safaris problem anymore. The site has deliberately decided to do this stuff.</p><p>So then it becomes a governance problem with the site owners and the vendors and the publishers. And they might have to ask her to the law </p><p>Ton Wesseling: [00:10:44] who knows it was one of the two top questions that were asked by the audience after your talk, which we were not able to go through. And one of the questions was what is the best solution I could implement now, at least less for some time.</p><p>And the second question was, if I'm going to invest money in service sites solutions, will this last for a longer time? Is it worth investing? </p><p>Simo Ahava: [00:11:08] Yeah. right now, If you think about GA data and first party cookies, like a, what are AB testing tools you, the best solution right now is to rewrite them as HTTP cookies.</p><p>and even small businesses can do it. It's not an expensive solution. You can, if you're running CloudFlare, for example, you can do it with your edge cache. So basically what happens is that instead of writing cookies, the Java script, You send them to the server and the server responds back with an HTTP response that has the cookies.</p><p>And again, because your server is doing this Safari allows it to happen. The expiration is an impacted. Anybody can do that. I've written a solution myself. That's running on the Google cloud. There's an article about it, which is fairly inexpensive. But then the other question about the, investing in service side, it's totally possible to say, say what happens.</p><p>I would say that if things could continue on the current rate, then the service side is going to be good for many other reasons than just being able to circumvent privacy. we will be able to. Reduce a huge amount of stress from the client because the client no longer has to download all these really expensive, like JavaScript libraries.</p><p>All it has to do is send them shit too. Sorry to send this stuff to the server and the server will handle it. So it's just, it's not just about privacy, gays. It's all about performance gains, but. It's, it's not even a double edged sword. It has six or seven edges. Each one is sharpened poisoned, and we need to be careful </p><p>Ton Wesseling: [00:12:27] what's happening.</p><p>These are the most vendors that are being used a lot like Google, like Adobe or from AB testing perspective, like Optimizely VWO reputation. So on that they will come up with a solution that is indeed moving away from the browser and giving the. the opportunity, but also the responsibility in their hands, self dare users.</p><p>Simo Ahava: [00:12:45] So for AB testing, I really hope so. I've been flagging for service site testing for such a long time, because not only does it solve the problem of flicker and of calculating those complex bandits in the browser using pulling data from some endpoint. so it's a Supreme, the useful solution for AB testing in general with, or without the privacy implications.</p><p>And I think working in my mind about writing like a. Like a simple node library that would rewrite optimized to work Google optimize to work on the server. But I think there'll be faster than I am. So I'm waiting for them to do something, but it would make a lot of sense. Yeah. Like I think the one particular industry would benefit from moving to the service side is definitely, AB testing and personalization because they can just return.</p><p>The correct HTML with all the variations in place without having to calculate that stuff in the browser. </p><p>Ton Wesseling: [00:13:31] Yeah. Personalization is of course DDPR personalization, AB testing, if it's just two split groups, but I'm the lawyer. So I fully agree that service sides. Yeah. Solutionist, </p><p>Simo Ahava: [00:13:45] but the everything about GDPR, everything about CCPA, all the privacies of the world.</p><p>The thing is that moving just the service, it doesn't change the dynamic in any way. You still need informed consent. You still need opt in. It's not an excuse. The fact that it makes it a bit easier to do bad stuff is also not an excuse. So it's just a question of, I think that the risk is that many companies will jump.</p><p>At the chance to do this without considering you still need the exact same privacy safeguards in place, that would be if you do certain browser sidetracking. And I think that it's the responsibility of our industry, our events, our consultants, to make sure that people say understand what's happening.</p><p>The understanding is the problem that it's such a complex field, that it's very difficult to know who to follow, who to listen to. </p><p>Guido X Jansen: [00:14:31] Yeah, I can imagine that for a lot of people then the responses. </p><p>let's wait and see. </p><p>Ton Wesseling: [00:14:37] I'll also want to make sure I'm not bleeding here. Everyone should shift now to surface sites, a B testing.</p><p>I dunno, because you need to have development in place. If the server side testing your backend developers are releasing the code, it's a different ball game. So if you want to be fast than clients and testing has still is that Fountas. And before you make the decision, maybe boats. Yeah, it's the way to go now.</p><p>And then after a couple of months or years, we will see a flying site is still usable because it's so fast that's also something consider making a business decision. </p><p>Guido X Jansen: [00:15:09] What would your response be to people saying, okay, let's just wait it out. maybe even I tried to explain this to my manager.</p><p>Steen Rasmussen: [00:15:16] Yeah, </p><p>Guido X Jansen: [00:15:16] but he doesn't want me to put any time or money in it. And we don't want to be, the one, from all of our competitors the same as we do now. So why should we be one during this first </p><p>Simo Ahava: [00:15:30] CME? Just go about as business as usual. </p><p>Guido X Jansen: [00:15:32] Yeah. Yeah. I've heard of the losses. Same people. yeah, we don't see a lot of fines being handed out right now.</p><p>Simo Ahava: [00:15:40] Oh, you're talking about it. Oh, okay. </p><p>Guido X Jansen: [00:15:42] Yeah. Yeah. But the same for the browser part that maybe managers don't necessarily understand that the impact that, I mean will only get worse. Yeah. Yeah. </p><p>Simo Ahava: [00:15:52] that's a salient point to make. So about the legal stuff. I'm not going to comment. I honestly think that people should.</p><p>At least put it on the roadmap to be compliant like this it's just too risky. Otherwise, even for a small company, it's not just about the fines. It's about the brand damage. If some privacy watchdog out to you and the public that, Hey, this company is misusing your data, but about the browser stuff, like I'm like, I would definitely say to wait it out, unless you have the money to do like a proof of concept because.</p><p>This is the funny bit, which I also mentioned the presentation, I think is that we've had unreliable cookies for years and years and years. It's not like it's this it's a novel thing that our cookies are unreliable. ITP just happened to point the finger at them. And Hey, this is unreliable stuff.</p><p>Okay. Third party cookies are a different thing because they are definitely being undermined. and the business model is built on third party requests are definitely being undermined, but for our first party analytics, our GA cookies and our optimized cookies. They've been super unreliable for so long.</p><p>It could be no modes. </p><p>Ton Wesseling: [00:16:53] The data quality. I think even this movement of browsers is only going to cost that everyone's going to use better. Yeah. Data, the data quality is really low, but now we have to worry about it. And then we have to come up with </p><p>Simo Ahava: [00:17:05] the one, like the one thing that everybody should think about with their sites is logging in.</p><p>Like the log act action of logging in and authenticating against the server becomes so important because if you authenticate with the server, you no longer need any GA cookies or anything like that, you can always just fit some kind of authentication token from the server and use that instead. So you don't have to worry about your first party analytics surviving anymore.</p><p>So now the question comes. How do we incentivize login? If we don't already have it, will every single site in the world have this fake log-in where you enter the site and just click. Okay. And we'll log you in. And yeah. So it's </p><p>Ton Wesseling: [00:17:40] yeah. </p><p>Guido X Jansen: [00:17:41] I like websites like Amazon, where you're logged in forever.</p><p>Simo Ahava: [00:17:44] Exactly. Yeah. Yeah. And when you login to one Amazon portal, you're logged into all of them. So that's like a walled garden building as well. So </p><p>Ton Wesseling: [00:17:51] yes, I'm sorry. At least cross defies also becomes less of a nightmare. </p><p>Simo Ahava: [00:17:54] Yeah, exactly. </p><p>Ton Wesseling: [00:17:55] True. I'm going to switch my place with Stino here because we only have four mics.</p><p>Guido X Jansen: [00:18:01] No. Good. You can also sit here. Sounds fine. </p><p>Simo Ahava: [00:18:05] But yeah, it's a, it's like giving advice is very difficult. So that's why I always try to, especially this presentation, it's so important for me to hedge it with saying that this is not to be construed as advice or recommendations. These are just findings and experimentation and people need to make up their own minds.</p><p>So our job as educators is to show what the facts are. And then let the people adjust those factors to their own organization. So the things that I mentioned there, if you would follow everything to the letter, you wouldn't be unable to do very much of anything with the website, because you'd be so scared about all the things that browsers are doing, but you take that information and you model it to whatever your organization is capable of.</p><p>Some of those things are really expensive. Service side tracking for a large company is not free. It's the scale of cloud computing. And those numbers is can cost thousands and thousands of dollars a month. and even for smaller companies, the barrier of entry is quite high, but, you just have to make the decision.</p><p>And some, for some companies it's going to be waiting it out. And that's fine. As long as you're aware of what the roadmap with the browsers is and what the roadmap with GDPR and CCPA and all these initiatives is, we just have to be aware of stuff. </p><p>Guido X Jansen: [00:19:12] Yeah. you just mentioned, it's visually business as usual.</p><p>It doesn't change that much for us. but we have a new customer table. Steve welcome. Thank you. you're going to end this day, this conference with the talk at the end of analytics, </p><p>Steen Rasmussen: [00:19:29] the end of analytics, </p><p>Guido X Jansen: [00:19:30] as usual. </p><p>Ton Wesseling: [00:19:31] Yeah. Yeah. That's a really good editor because it's essentially about Seymour was saying also, but don't mention it.</p><p>It's just new opportunities and the market is moving forward and indeed the end of analytics. Yeah. And we're going to have to make them make a new step into the new analytics. So looking forward to the top. </p><p>Steen Rasmussen: [00:19:46] Exactly. so it's very much about these entire thing we have with Firebase and the entire protocol changing and our new approach to analytics.</p><p>So we have some infrastructure things in the browsers, but we also have a completely new way of thinking analytics and the way we work in. That is opening up a massive opportunity, but it's also a big reset for a lot of people. </p><p>Simo Ahava: [00:20:06] it's completely new, but it's also quite old, like the event stream analytics, isn't, it's a hot tip back to the days before a user based on analytics and session stuff.</p><p>Steen Rasmussen: [00:20:15] yeah, but for a lot of the people here, it's like they, we, a lot of the analytics people are session based. Thinkers. So going back to innovating events based approach, it's a major change. </p><p>Ton Wesseling: [00:20:26] And then they're afraid. So then the booking.com keynotes was talking about when she entered the company, Maria, they were shifting from the old analytics set up to the universal analytics up and Google analytics.</p><p>And everyone was like, Oh, this is a nightmare. We're going to lose all our data because it's the same with this step again. </p><p>Steen Rasmussen: [00:20:44] But this is actually much worse because. From a traditional to universal was still the same. It's the same structure. You have data, right? This is a completely new data model and way of thinking because it's building on the app way of measuring things where it's not linear builder on pages.</p><p>So that gives massive challenge. </p><p>Ton Wesseling: [00:21:04] And I like it because it's a raw data stream. You can measure everything and it makes so much more sense than to have this aggregate its thing on top of it. </p><p>Steen Rasmussen: [00:21:12] But. But from my part, it also needs for everybody to if they want to use this, they have to step away from a vanilla approach and just implementing and actually start doing a data strategy in relation to their own business saying, what is it we need.</p><p>So I see that as really crucial because otherwise they're going to miss it and they're just going to try to recreate what they have next. say I used to have a car now. I got a helicopter, but I still just drive on the roads. </p><p>Guido X Jansen: [00:21:40] So what's going to be, to take away from your talk right now. You don't have to worry about spoiling.</p><p>We have only had listeners at home, so they are nothing. Anyway. </p><p>Steen Rasmussen: [00:21:48] So the main takeaway is that. Besides all the other problems we have a burning house with the browsers. we also have a burning car with the, with this entire tracking structure. We have some issues we need to attend and we need to attend it now.</p><p>so it's not a big problem because we have time in relations to the move to app and web, but it will become standard. And we might as well start preparing and start building a data set. So we will get. Some practice. So we will have some data. So we will start having the discussions of how we're supposed to do this.</p><p>So parallel tracking and setting that up and missing with the missing play with the app and web data to see where it takes her. </p><p>Ton Wesseling: [00:22:26] Is that the big message from this year for another victory? Because we were all at super week, two weeks ago and Hungary and the organizers making this documentary and the questions he was asking too.</p><p>Probably you, are you also at least a question he was asking me in the footage documentary was, are we going to die? Is it the black future? All the dark questions. what's going on here. </p><p>Guido X Jansen: [00:22:46] Yes. Yes we are. </p><p>Steen Rasmussen: [00:22:49] But not until the end. I think in the meantime it is a big question, but so my approach is saying I've done analytics for 20 years now.</p><p>And for me, the world has ended in analytics a lot of time in those 20 years, </p><p>Ton Wesseling: [00:23:03] 27 times. Yes. </p><p>Steen Rasmussen: [00:23:05] so this is just another way and another approach to adapting to change. but this change is actually really positive because if we use the things that are in app and web, and we'd go and think beyond just the tracking part, but also that the powers that are in Firebase in relations to activation, then suddenly.</p><p>This becomes about orchestrating the website. You can do AB testing, you can do targeted messaging. You can tie everything together. And it actually builds on a lot of other stuff. </p><p>Simo Ahava: [00:23:35] I just want to get us out of the one thing I want to get us out of solutionism trap. So Atlas web for all the good it does.</p><p>And I do agree that it's a paradigm shift in how we do mobile analytics and as soon web analytics as well, I think, but it's still just a tool. And if the organization is crap and immature and unable to do basic analytics with GA Apolis web is not going to save them. It's just going to put them deeper in the quagmire.</p><p>So that's the one thing that's been constant throughout these years is that bad organizations do things badly and good organizations do things well, </p><p>Ton Wesseling: [00:24:07] it's got me a bit of super-big. There were many discussions on ethics, which are really good from the, I think there are many experienced practitioners at super weak ethical discussions, but if you take this discussion in your company, the company is not ready for that level of thinking on analytics.</p><p>They have to make more steps. Before they get to that level. And so indeed, if you get a Ferrari to a company that's not able to drive a normal car because they don't have to apply for license. then don't bring the Ferrari and their first friend them to </p><p>Simo Ahava: [00:24:37] drive to Colway spring the Ferrari. If you have a Ferrari, are you kidding?</p><p>Steen Rasmussen: [00:24:43] I think you're right, but at the same time, I actually think that it's part of the process because the maturity of analytics in a place now that. We can do a lot of stuff with data and data can do a lot of harm if we are not careful. So the ethics disgust, that is something we need to have and actually ties strongly into the cookie things, because if we have an ethical we'll approach, so I'll tracking, I believe we will not be the companies who will be challenged by the limitations, because we will actually be having a behavior that is thinking.</p><p>Within the, </p><p>Ton Wesseling: [00:25:13] I fully agree that there's an opportunity to make a new setup for analytics house being used in the company. But I believe if you had a certain maturity level, if you're too low, then absolutely take the other steps. </p><p>Steen Rasmussen: [00:25:24] Yeah. Yeah, I agree. But it is going to be required in. In a, not too distant future.</p><p>Ton Wesseling: [00:25:30] Yeah. If you are booking or even another like ING, these are the type of discussions you could have and we think your whole, </p><p>Guido X Jansen: [00:25:37] so you've all visited super weak and hungry </p><p>Steen Rasmussen: [00:25:40] last week, two weeks ago. </p><p>Guido X Jansen: [00:25:44] So what was it? Was it the main theme of the conference too, is it's a rather small conference, right?</p><p>Like 180 people on top of the mountain. </p><p>Ton Wesseling: [00:25:51] That's what </p><p>Simo Ahava: [00:25:51] I think it's more like five or 600 now. It's, there's a lot of people. </p><p>Ton Wesseling: [00:25:54] I don't know. I only counted. I only counted that go into the room and in the room, I think max 200 people </p><p>Simo Ahava: [00:26:00] throughout the whole week, people may go wait. </p><p>Steen Rasmussen: [00:26:03] Okay. But it is five days of analytics.</p><p>so I guess it would be like 500 across five days. So you have like programs that start. a little late because there's no facility even program. so most of you will start around 10, but on some days the program ended around eight. </p><p>Ton Wesseling: [00:26:20] Okay. </p><p>Simo Ahava: [00:26:21] But that's like privacy and data are, they start definitely emerging, like all over the place.</p><p>And they used to be when GDPR came out. The topic was about GDPR specifically, but I think things are moving to a more generic position now, which is good. We're not talking about individual frameworks. We're talking about general attitude towards ethical data collection. And especially with all these data breaches, these incredibly huge data breaches, hundreds of millions of emails being.</p><p>Exploited, it's just become part and parcel of what we do. And this kind of thought process has shifted away. we can collect whatever we want to do, whatever we want with it to shifted naturally to maybe we should think about what we're doing. And I think that's a very healthy, </p><p>Steen Rasmussen: [00:27:01] I've used that metaphor sometime when I've been talking to people about this saying.</p><p>We have had the privileges for some years of being like kids with keys to the candy store. And we'd been in the candy store and we just been eating candy and throwing it around and not really being careful what has been, what's supposed to be useful. so now somebody locked us out of the candy store and given us a budget.</p><p>So now we have to rethink what we're going to do with this data and how we can actually work it. I think. Yeah, that's a, yeah, an important thing because it limits us in relation to where we work. But we have also been, Oh, not us at the table, but we have seen people who have been data pics, gathering all they could in data, but not really doing it.</p><p>Simo Ahava: [00:27:43] Totally </p><p>Steen Rasmussen: [00:27:43] me </p><p>Ton Wesseling: [00:27:44] just because I have to fill my data Lake, come on, it's an obligation. </p><p>Steen Rasmussen: [00:27:50] It did a poem </p><p>Simo Ahava: [00:27:51] or a data swamp. Yeah, no, absolutely. Yeah. Data lakes are all the rage. Let's just collect all that stuff and see what that one day we'll be able to use it. </p><p>Ton Wesseling: [00:27:59] Yeah. </p><p>Guido X Jansen: [00:27:59] but also saying it. So how would you advise the people that say, okay, th the bigger companies have the money to do this, but I'm a weapon list at a smaller company.</p><p>I cannot convince my management to put any money in this, or at least not right now. They're there. Approach is more like, okay, let the competitors figured it out first. </p><p>Steen Rasmussen: [00:28:21] So I think part of this is with the combination of ethics and gathering data and excavation you actually in a place where the analyst becomes a business orchestrator or data orchestrator, making sure that you can actually do things.</p><p>So it's not now it's moving from a situation where we're just gathering the data. So we also activating it and that is probably one of. The major shifts that we see with us. </p><p>Guido X Jansen: [00:28:45] Yeah. So we need to translate this into the benefits of the company instead of, </p><p>Steen Rasmussen: [00:28:50] yeah. And so technically even the loan web analyst can now set something up that will, they will make the company money.</p><p>And that is changing the story of what the web analyst does. Yeah. So I tried to change the perception of being a web analyst to be a data driven business developer, because that is the value for the organization. </p><p>Guido X Jansen: [00:29:12] Yeah. Okay. And, I think Don has to leave right about now </p><p>Ton Wesseling: [00:29:19] the rooms are starting in 10 minutes.</p><p>I do need a sense of waste before I act, when I host. </p><p>Guido X Jansen: [00:29:24] You'll it'll get that. So my question will be, so are there any, developments in the market, do you expect to happen in 2020, either on software or legal or something that impacts our marker that you're either looking forward to or. </p><p>Simo Ahava: [00:29:40] Did you </p><p>Ton Wesseling: [00:29:40] listen to what we were talking </p><p>Simo Ahava: [00:29:41] about?</p><p>That's the only thing we'd be talking about. </p><p>Guido X Jansen: [00:29:47] yeah. No, my mind, definitely. </p><p>Simo Ahava: [00:29:50] Yeah. so I think just continuing this trend that we've been talking about, so data, more sophisticated data collection tools that are also taking, took out that the service side stuff likes with things with trace doc is doing, for example, I think there's going to be a proliferation of similar solutions.</p><p>So moving to this kind of quasi service side hybrid setups where the browser it's a client service stuff. I think we're going to see more of those at least in the, your future, </p><p>Guido X Jansen: [00:30:13] because it's conditioned easier. </p><p>Simo Ahava: [00:30:15] Yeah. Make the transition. Yeah. Easier. It's just sold a very immediate problem, which is the browser is doing like blocking client side, but I'm not sure if, how long they're going to survive.</p><p>considering how fast browsers are moving, but also like we're going to see a lot of tools around auditing. Like auditing, same side cookies, auditing, third party cookies, creating reports, developer tools designed to help you go over your clients. I stayed mechanisms, crawlers that go through every page and check what cookies are being dropped.</p><p>I think we're going to see more of those. I think there's going to be a. Because we need that information to convince our managers. We need to show them that, Hey, okay, you don't have the money, but you still have the money to throw away to this advertiser who dashed and actually use it because we don't have any cookies left.</p><p>So I think that's </p><p>Guido X Jansen: [00:30:56] you say that the browsers are moving fast, but I think one of the most popular browsers Chrome is actually</p><p>Simo Ahava: [00:31:05] So one thing too, it's fun to make fun of Corona because they're the odd one out with tracking protections. But what they are doing is they are. Actively participating in these discussions. And the problem with Chrome is that because they are a market leader for them to do something, basically necessitated becoming a web standard.</p><p>So everything they do requires like a cross-browser consensus. So that's why it's moving so slowly. I'm not defending them. They could have done a lot of things already right now, but I do sympathize, especially with their privacy engineers. They might be, they might have. The will to make things happen, but they have like corporate responsibilities, business incentives.</p><p>And then there's the whole antitrust world where if Google suddenly blocked all third party cookies without an alternative, they would exclude all other ad tech and just enjoy their own little first party walled garden. So it's not, I do sympathize for Chrome, but I think they are actively trying to build things, the web standards way, which is just much slower, but it's also more better for us because all the browsers would agree.</p><p>At least the majority would how's it. </p><p>Steen Rasmussen: [00:32:08] I also think that we've got to see like also in parts of this, say Chrome is waiting because changes are coming up. I think we're going to see, it's going to be an intense tango of workarounds of somebody doing a work around and then the browser's doing an update and then somebody doing another workaround.</p><p>And so this moving back and forth. so the standard of tracking is really in flux right now. so for Google to go and do something that would push a major shift in relation to work. So right now they can let. Things consolidate and then hopefully move to standard. </p><p>Guido X Jansen: [00:32:40] Yeah, that's true. And usually for the market leader, it's interesting.</p><p>Simo Ahava: [00:32:45] Yeah. </p><p>Guido X Jansen: [00:32:45] To be moving first one. So </p><p>Ton Wesseling: [00:32:47] exactly. Let's not go into the advertising income, Hotspur income, sorry, discussion. That's a whole different topic. But for this year, I think, having a center of excellence on analytics, which was one of the topics all sorts of a week, that's a big opportunity for that because, the data quality being able to measure data track.</p><p>Yeah, everything is going to be harder and harder. So if you have a center of excellence, democratizing analytics and quality assurance on analytics, that's an interesting move. I think, because in the end you want to have more business units or product teams or marketing use that data. So it must be easy for them to use the data and the data quality should be good.</p><p>We're not the experts in collecting data, which is getting harder and harder. So I think the center of excellence perspective is an interesting one for the bigger companies. </p><p>Guido X Jansen: [00:33:31] Yeah. Exactly. almost Lang she will have a salesperson. Thank you so much. Have a great conference. </p><p>Ton Wesseling: [00:33:37] Thank you very much.</p><p>‍</p>",
  "show_notes": "<ul><li><a href=\"https://www.simoahava.com\" target=\"_blank\">simoahava.com</a></li><li><a href=\"https://www.simoahava.com/analytics/itp-2-1-and-web-analytics/\" target=\"_blank\">ITP 2.1 And Web Analytics</a> by Simo Ahava</li><li><a href=\"https://onlinedialogue.nl/artikelen/itp/\" target=\"_blank\">Intelligent Tracking Prevention (ITP)</a> by Ton (Dutch)</li></ul>",
  "guests": [
    {
      "id": "simo-ahava",
      "name": "simo-ahava",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    },
    {
      "id": "steen-rasmussen",
      "name": "steen-rasmussen",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    },
    {
      "id": "ton-wesseling",
      "name": "ton-wesseling",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "https://youtu.be/xdje2Bh87y4",
  "main_image": "src/assets/images/episodes/state-of-analytics-experimentation-and-personalization-with-browsers-privacy-initiatives.jpeg",
  "language": "en",
  "type": "podcast"
}