{
  "id": "switching-gears-when-the-pandemic-upends-your-traffic-with-dave-powell-tomtom",
  "title": "Switching gears when the pandemic upends your traffic",
  "description": "We are going to learn how TomTom was able to quickly switch gears when the pandemic hit and lot of people all over the world suddenly stopped driving.",
  "date": "2025-01-09T14:36:18.243Z",
  "duration": 2036,
  "audio_url": "https://cdn.transistor.fm/file/transistor/m/shows/5036/0b87890d507e1bce6f16461b1827c445.mp3",
  "transcript_url": "<p>Guido X Jansen: [00:01:30] Dave, welcome to the show. And of course we'd love to start with getting to know you a bit more. So let's get started with how you go in full with zero.</p><p>Dave Powell: [00:01:38] Absolutely. Yeah. Yeah. If we rewind the clock back many years and way back to when WAP was a thing, building websites on mobile, which </p><p>Guido X Jansen: [00:01:47] yeah. WAP you were talking about. </p><p>Dave Powell: [00:01:49] Yes, indeed. I studied at Bradford university. And, it was very new for the time. It was a BSC and internet product design, what that means.</p><p>And it was a, yeah, we focused on electronic imaging and media communication, which was a very broad umbrella for study, but it's army how to code, how to use Photoshop, generally, how to produce content, how to communicate an idea digitally. And that set the foundation for really focusing in the end year on internet product design.</p><p>And, yeah, I left there and I began just doing firm and jobs really. got in websites way back when I was still a problem. and from that, yeah, I just mainly did from our jobs. And then I, he eventually came to the Netherlands and, it got a job@booking.com. That's how it all began, which was.</p><p>Maybe even 15 years ago now. So it was right back in the beginning. I think it had just changed into bookings. So yeah, this is well before, before they got bought out by Priceline. So that's where it all really started. Yeah. Working on the affiliate white label program there. And, yeah, we were styling the content to look like, yeah, the affiliate's website </p><p>Guido X Jansen: [00:02:59] booking is often mentioned as one of the big examples of how to do a CRO or optimization or experimentation.</p><p>How did you experience that? 15 years ago? What was it like? </p><p>Dave Powell: [00:03:09] Wait was a massive turning point for me because coming from a bit of a design background and also having this, purity for us, vettix, things need to look great, but it wasn't always the case in terms of Sierra and it was where form meets function.</p><p>But then if it's really selling very well, does it need to look pretty and it addressed some fundamental issues for me. coming from the design background, which sort of threw away some of the role box. And I was like, This actually works. The customers are buying it, convert. it makes sales.</p><p>So what better way to move forward in a career than actually using science best design decisions? Which for me, yeah, it really is. It really sparked my interest. </p><p>Guido X Jansen: [00:03:54] And now you work for a, Kato's a bit harder, our team, team look like and what you're working on. </p><p>Dave Powell: [00:04:01] Yeah, I'm in the ecom team.</p><p>we're mainly just looking after sometime.com. we have websites all over the globe all over the planet, different countries and, yeah, we basically take care of sales through the website, but, our particular focus is on replacement sales from the email database. So we have a big team. It's about 10 of us, but we're in a smaller team.</p><p>There's three of us that are best, concentrating mainly on reselling. getting all the customers that have a device or how the device to get a new one, that's what our Fox is. Just the three of us. We've got a front end developer. We've got me, which is one of those T-shaped people. And we've got another t-shirt person next to me, Ariel.</p><p>she's also very good with, with analytics. </p><p>Guido X Jansen: [00:04:45] Yeah, I can imagine that, when, when the pandemic hit that's, people drove around a lot less. It did have a big impact on you guys or. </p><p>Dave Powell: [00:04:53] It had a massive impact. we also have the traffic index. sometimes all about maps and traffic data.</p><p>And, I was actually looking at the TomTom traffic data. That's not part of my role, but it's just interesting to see the level of, traffic drops. So significantly the minute lockdowns began to be imposed. So I was comparing, Amsterdam and London then obviously not, even reached the lockdown yet.</p><p>It was insane to see how. How the graphs just really tight. Yeah, it's phenomenal really. But on the flip side of that, when the lockdowns have eased up, people have more, they're going to choose a car more. So we've seen a huge increase in people using CAS because they don't want to use the trends and these kinds of things.</p><p>So it's had a downside, but it's also had an upside once people. Are free to roam, so to say for awhile. Yeah. </p><p>Guido X Jansen: [00:05:47] And how has it impacted your work? Could you just continue on what you were doing before, or does it have a massive impact also what you were actually doing? </p><p>Dave Powell: [00:05:56] at that point every Sunday, everyone was very shell shocked.</p><p>We didn't really know what to do. AB testing didn't seem. Feasible people will not on the website. people will not buying things. So yeah, we really had to take a good look at what we were doing at those times. And we thought it would be a perfect opportunity to pick up the things that you can't necessarily measure that you can't necessarily say, this is worth that.</p><p>So in that time we shifted to a different. Different platform. we were working loosely with react, but we, created all these new templates for a sales page. and in that creation, I switched to using a fig because the developer, he said, Oh, we should try using this. It's gonna decrease the times that we've, that we've got from design to, into actual code for it being live.</p><p>So we managed to shave off an optimize that process. That we were having. That's what we were looking. We're looking internally to see how we could optimize our own workflow. again, things built faster. so yeah, I taught myself Sigma. with the prototyping, you've got really into that massively obsessed even, wonderful till, so we built that, I got stuck into content square, cause I didn't never really had enough time to really dive deep into it and understand it on a fundamental level.</p><p>I spent a lot of time looking in content square, and then I'd worked out these, yeah. These floods that were, that were happening, that were seen in the replays and then using figures to solve some of those problems. And then, yeah, it was, we're producing quite a nice little flow between them with this, with the insights.</p><p>And then yeah, we were obviously feeling the backlog, but yeah, during those times, it. It really helped us to do the things that we wouldn't necessarily have had time to do. So it was a good thing. I think </p><p>Guido X Jansen: [00:07:42] you made good use of the time. You usually have a backlog of things that you. Think of a okay.</p><p>If I have time, sometime in the future, I can do those things, those basic things to fix workflows, to optimize my own stuff that you never get around to, you started picking up those things, right? </p><p>Dave Powell: [00:07:59] Even one of the jobs that I picked up and we didn't have one repository of all the images. from past, from our past devices, we didn't have it there.</p><p>The was scattered about everywhere and they weren't PNG. So I took two days and I stripped them all our P and G's are looking nice. I'll figure the file. So yeah. Got it. Got things organized. We really did. </p><p>Guido X Jansen: [00:08:21] That's something you normally wouldn't do, or normally wouldn't prioritize, if you have other things to do.</p><p>Dave Powell: [00:08:27] Yeah. </p><p>Guido X Jansen: [00:08:27] you talk about fake Mar I see it come up a lot lately. Okay. Tell a bit about the tool. What does it do? How people in chiro can use it? </p><p>Dave Powell: [00:08:35] it's like sketch, but it's also Excel, the online version. You can actually work on the design collaboratively. It's not saved on your hard drive somewhere.</p><p>So I can work on the sand file as a developer, I can work on the same file as the copywriter. It's the same file. So you can see them live making the changes there, which is never been seen before it's never been done. So yeah, the point of collaboration it is it's absolutely phenomenal. And the logins that are being built for it.</p><p>It's anything that you can think of. it's just, it's developing so fast and it's also it's free. if you're a small team, two or three of you, it's ideal, pay for software. everyone likes that I'm not paying for it for over 10 years now. </p><p>Guido X Jansen: [00:09:22] All my God at Pfizer is about evidence based conversion optimization with a focus on data and psychology.</p><p>Dave Powell: [00:09:27] We </p><p>Guido X Jansen: [00:09:27] see that analyzing data and recognizing customer behavior results in better online dialogue with your clients and a higher ROI that demons strategists, analysts, psychologists, and UX specialists gathered valuable insights in your online behavior of your visitors. And together with you optimize </p><p>Dave Powell: [00:09:45] the different </p><p>Guido X Jansen: [00:09:45] elements of your zero program through redesign expert reviews, AB test and behavioral analysis.</p><p>For more information about their services, go to Oman dialogue. So it's basically a SAS version of sketch. </p><p>Dave Powell: [00:10:00] Yeah. </p><p>Guido X Jansen: [00:10:01] So do you use it to, actually create designs or is it more like prototyping or </p><p>Dave Powell: [00:10:06] I would say I use it for everything now. So even if we've got an email they'll come in and the London page, I'll try to create the whole flow so that what we're looking at, how does it fail?</p><p>how is it experienced by a customer? Because then you can really, with a fine tooth comb golf through the copy, then you can say, Hey, copywriter. Do you think this flows and you're all looking at the same thing, the same experience from email to landing page, because our email department's slightly separate from who builds the London page so that there can be some things that don't quite match, but in this instance, then everyone can collaborate around the stand fail, and that show it's got continuity for a customer.</p><p>Guido X Jansen: [00:10:48] It's a freemium model, right? So you start on free and they do have paid options. Yeah, which started $12 per editor per month. I see. Depending on the package, but, yeah, it's easy to get started. It's a, at least it's a great way for hero to basically communicate with the designer and developer on what needs to be changed.</p><p>Dave Powell: [00:11:07] Absolutely. even in that you can, create duplicates of things. And say, this is version and this is version B. This is what we want to test out. Yeah. even once you've, you've built your design, you can see how it actually works. It feels how it reacts. So yeah, even in then you can plug it into to maze.</p><p>I don't know if you've heard of maze it's that's also a UX kind of analytics tool you can set. yeah. Goals for, for a customer to do you see this website you're interested in buying something. please find out if it comes. With a magnetic Mount. So that's the goal that you can see the customer's gone in the recording, solid clicks.</p><p>So you can even get UX analytics. Yeah. Macy's is also free analytics </p><p>Guido X Jansen: [00:11:52] also freemium model. Yeah. </p><p>Dave Powell: [00:11:53] Yeah, it is. Yeah. UX analytics, just a very low cost let's say. And you can get insights and validation before you've even really called it. Anything, which. I think that's key these days. </p><p>Guido X Jansen: [00:12:05] I haven't heard of a major before, so I'll definitely check that out at all.</p><p>I'll add the link for everyone, in the show notes. mostly your work on retention at, at TomTom. So w what would you say, what are the most, what are the main drivers for people? a two to one, the replacement in the first place, and then B. what triggers them to actually, buy the upgrade for me?</p><p>Dave Powell: [00:12:27] the business model in the past, we, the older devices you used to have to pair for map updates. that was a big revenue driver for us. but of recent years, we've started to, sell the devices with maps installed on them already. And then the updates just gone, periodically.</p><p>that was something that we actually surveyed customers, way back when we first started all the optimization. What was the reason for you purchasing this device? So it's all the decisions that we've made ed and all the messages that we are sending out is based on customer feedback. Iteratively. So what we, you think that we're saying on the website about these devices?</p><p>And what, how we were selling. It wasn't necessarily the reason that customers were buying it. So we did lots of surveys. We keep doing surveys and we keep like the top five reasons, the wow factors of why people actually do purchase something. So in effect, customers tell us why they purchase it. And we highlight that message.</p><p>In different ways and communicate it to other customers, which haven't gone through the whole process. Oh, it's not re it's a really, I did know, they've read the small print or whatever, and we've just elevated that message. And then rolled it out and seeing sales increase. </p><p>Guido X Jansen: [00:13:48] What are a couple of those reasons?</p><p>do you know them? </p><p>Dave Powell: [00:13:50] Yeah. The fact that they don't need to pay for the maps anymore, because yeah, that was a big thing. And then the maps were outdated and, obviously it's not a good experience. having a device that, the maps are not up to date and also a lot of customers really enjoy, the updates over wifi now that there's no need to plug it into a computer anymore.</p><p>Cause that was quite a lengthy process. For those times, biggest screens is also, a key driving factor because the more you can see it's the brightest screen, it's just at a glance. You can really see the road ahead and the change in situation. yeah, from a safety angle, I use one.</p><p>So I, I really enjoy driving. </p><p>Guido X Jansen: [00:14:28] Yeah. And I can imagine that they'll start to the whole customer expectations changed a lot in the years that the devices are around now, people also use the using their mobile way more using a maps. Apps on their mobile. And that might be the thing they compare it to, a while as, before they might went on top started they compared it to just a book in their car as just a whole different thing.</p><p>Dave Powell: [00:14:53] Yes. Very nice stuff. I think we're going to talk about our comparison tables a bit lesser on, but, I really that's. That's the key. That's a nice one. Yeah. Yeah, he's a true, the technology has moved along, very much And we, we accept that people do use mobiles, for the navigation purposes.</p><p>but for me, talking from a personal standpoint, I like a tool to be for that in particular. For me, my phone is my form. I don't want it there. It's designed for navigation and I find some of the others, then they're not as good in my view. because sometimes I've been doing this for the longest amount of time.</p><p>They've got a lot of data on it. They're still around for a reason. Cause I think they're very good at mapping data. but it is interesting to see the big shift to mobile. And I think it is much a younger audience, definitely sticking to this and yeah, to be fair, it's not a market that's going to last forever.</p><p>I appreciate that. And then, but on that, you've also got a lot of people that got. In belt navigation and the cars, and that's invariably highly out of debt and really not particularly good. And I'll give you an interesting example. I hired a car when I was in Spain and that had an inbuilt navigation thing and I just couldn't use it.</p><p>it was impossible. if you can take your portable device with you, pop that on the windscreen, you're in a foreign country, device works, you got that. You know that you can relax and know how are you going to navigate in a different country. So it's still got its uses where, necessarily inbuilt stuff doesn't work.</p><p>I think you get used to it. what you like. </p><p>Guido X Jansen: [00:16:27] Yeah. That's the interesting part, right? So you can use that feedback from customers not only to improve, visually your website, how you sell stuff or retention part, but also feed that back to the company. Saying, Hey, we get all this feedback and it's not necessarily the website that's limiting people from buying was actually the way our business model works or the harder product currently work.</p><p>That's hindering people from actually buying this. Like you said, a with people don't wanting to, download a map update, you just want this to automatically happen. So let's feed that back to product. And hopefully they can fix it. </p><p>Dave Powell: [00:17:06] Absolutely. I can't say any more on that topic. absolutely. </p><p>Guido X Jansen: [00:17:10] yeah, actually that's fine.</p><p>that's I think greater and I think that a lot of. the mature Shiro themes, are dealing with this more and more that's usually with the CRO, the usual starting point. This is the websites, because that's where you at least own a, it's an old channel and you have a lot of data there.</p><p>That's a point where you have a lot of data. so it's relatively easy to starts here or there, but often, very quickly you'll see that the website might not be to bottleneck. I need to, look for other places in a funnel that, which might be the product itself. So what would you think is an insight that you might have that you don't think others have?</p><p>In our outside syrup. </p><p>Dave Powell: [00:17:51] my main thing of the past couple of years has definitely been, like I said, I was gonna mention it comparison tables. I feel like such a geek saying it. And because again, I get excited about it now because who would get excited about, I could embarrass the table.</p><p>What's </p><p>Guido X Jansen: [00:18:05] wrong with me? </p><p>Dave Powell: [00:18:06] You do Dave. I do. Yeah. yeah, we've done so much testing now on comparison to evals. That I find them absolutely fascinating and sell the customers because we've looked at EEG data, they put the helmet thing arm, and then we watched that levels of joy and frustration. And these things really help customers to understand the difference between things.</p><p>And there's so many different ways that you can actually, they lay out the information to make it a clearer, less clear, an answer, questions that people have about. Is it features, is it benefits? yeah. And you can see the levels of joy that it helps them to understand something that's fundamentally quite complicated and a number of things that, That they can compare at the same time.</p><p>I believe there's only seven things that we can store in our brands at any one time. So that's my lack of comparison table because it maxes it out to the things that you can start and your brand to make a decision on purchase. so yeah, on that, we've done so much. Air B testing, heat maps, looking inside people's brains, user testing for me.</p><p>Yeah. If you're in a position to. To use a comparison any way you can. You should. it's a very cool tool. We've even used, personalization. And so we've taken their old device and pitched it against the new generation ones. So at a quick glance, they can see, Oh yeah. That's what's different.</p><p>So it's, we've really elevated that. As I said before, we went through a, you don't have to pay for maps anymore. So we elevate that. We put that in the thing. Oh, I do. I don't. I do. I don't that's in, that's not. And, yeah, fine comparison table geek, whatever you want to call it. But yeah, that's my, that's my main side.</p><p>My inside tip. If you can use comparisons and you can use personalized comparisons. Then that's even an extra level </p><p>Guido X Jansen: [00:19:56] fight. Spec offers a worldwide unique AB testing, personalization and product recommendation solution SiteSpect works service sites without any tags or scripts, which guarantees an ultimate performance.</p><p>The SiteSpect solution eliminates delays and the chance of any flickering effects. And this approach also ensures that the current and future browser stretcher rules like ATP and ADP does make an impact on your AB testing and personalization </p><p>Dave Powell: [00:20:23] for more </p><p>Guido X Jansen: [00:20:23] info visit &nbsp;dot com. Yeah. Because people, when using the device, you have to have a TomTom account.</p><p>I can imagine that, more and more people on the website, also our login. Yeah. So then if they do then you know which device they have. </p><p>Dave Powell: [00:20:38] Absolutely. </p><p>Guido X Jansen: [00:20:38] So you can use that for personalization. </p><p>Dave Powell: [00:20:41] Yeah. Completely. Yeah. And then we follow them around with it. It's how personalization works.</p><p>It's yeah. Yeah, we can point out the things that they're missing out on with the new devices compared to their old devices. in some situations the devices are so old, we don't support them anymore, then that's not fit. It's not a good experience, not a good driving experience any longer.</p><p>And it is done to update and get a new one. </p><p>Guido X Jansen: [00:21:05] You just mentioned the heat maps, EEG. What kind of, research methods do you guys usually use for your research? </p><p>Dave Powell: [00:21:13] it's a bit ad hoc, to be honest, it's not some sort of great roadmap plan that we have. it's just sell as much as you can. but yeah, I think a lot of it, it starts with a gut feeling and, yeah, for watching people use the website with session recordings, you can you can follow the mouse and they're actually reading things and you think, does it make sense that it's this way around?</p><p>Should it be this way around? Okay. Let's run a test and let's just flip the content and see how that works. And then obviously, yeah. even given little explanations, we can see that people were hovering over things, looking for information. All right. Let's try with, with the question about mobile, to answer what a bit more about what that feature might be.</p><p>Wow. Look at the interactions on it. People are looking for that information. Okay. Let's embellish that information. Let's see. let's make it, a far richer, let's try and explain it even better. okay. We see that this topic has got more hovers than this one. Okay. Let's put that one at the top then.</p><p>Cause that's a bit more of a question. so we'll do. Numbers of different, research is on things, but I think, yeah, a lot of it usually stops with just by session recordings. I've been spending so much time watching sessions regarding yeah, for me that's yeah. One of the, one of the killer weapons out there to find out what's going on.</p><p>And then obviously we, we do the EEG things also to get. To get an insight that you couldn't get from user testing, just per se, user testing, asking questions, because you, couldn't straight down into the subconscious and, yeah. If people are getting frustrated, looking at a table, you can see where they're looking and where the frustrated bears.</p><p>and then that's again, we turn it into a test and we rank here. We think, Is this going to really see a big shift. and then obviously if it's too complicated, but it's not, when it's a terrible, it's easy. </p><p>Guido X Jansen: [00:23:01] So I don't use those EEG, research methods for the current website.</p><p>Or do you also try that out with things that's come out of, fig, to see what their reaction is before you even, pre-life </p><p>Dave Powell: [00:23:11] would be nice? no, we're not doing, for those kinds of projects just yet. it's relatively pricey. Yeah. I've saved all my money with fig it's relatively proxy. we usually yet two or three tests, just to check and we've been mainly to check in on the flow of things.</p><p>So a customer gets an email. How do they interpret that email? How does it make them feel emotionally hear negative news. then they go in and they go to the website or they'll go to my products area. And then we'll see them navigate and, follow them through the funnel. And then we make changes best on the benchmark, test that we did.</p><p>And then we'll make changes to see if we can do the improvements of where they've got most frustrated where they didn't really make sense to them. And then obviously on the points of joy, one of which, of a recent task we did, They actually enjoyed reading the text, the copy on the landing page.</p><p>It peaked in joy of, think four people out of 10 sauce. Ooh. that's really, that's something even, you know, a bit of copy can convince some joy to a sat nav buyer's life. </p><p>Guido X Jansen: [00:24:17] So was it really informative or was it the funny text or? </p><p>Dave Powell: [00:24:21] as you've been talking, I'm quite hands on person and, yeah, to cut a long story short as always been at home and we need to make things a bit more personal.</p><p>We've turned the webpage where it's got my face on it. Now, Dave from Samsung wants to sell the device. So it's yeah, we want it to humanize it, how can we do that in this day and age? I can't go to the office. We can't do these kinds of things. W I set up the photography myself and, I've done product shots.</p><p>I've been super busy. and then I wrote the text from my heart, like death here at sometime. Thanks for visiting the bedroom. Really appreciate your time. I, just be honest, and yeah, the feedback here and that it really does work, so yeah. </p><p>Guido X Jansen: [00:25:03] Yeah. So one of the things, so you've been improving a lot of, things lately, because you're suddenly had a bit more time to improve the basics. I'm assuming that COVID might stick around for a bit. are there other things on your backlog that you said, Oh, that will be really nice to fix, to improve the overall process before we.</p><p>Get back to, the daily grind of zero. </p><p>Dave Powell: [00:25:26] for me, I think we've got it set up very well. We're quite mature now as a team and something that I think is quite often overlooked is spreading the culture of CRR because it's great that three people do it in a team, in a company of how many people. But if everyone's doing CRO other CRO involved in many aspects of that company, then your train is going to go way faster.</p><p>You'll learn so much more about your customers. yeah, for me, the focus is now to try and help people develop their own CRO skills. There are methods of validation, the content that they're making, that they're creating. How can you validate it? How can you know that this boss does better than this one?</p><p>This email's gonna work. If you've never asked anyone outside your circle. So I introduced, some areas of the company to things like what's that tool called now. A usability hub where you've got five, second tests. So people could just, did you understand that the offer, what was it about? So you can get a little bit of feedback, some quality feedback, enough time at all, from someone that's not in your circle.</p><p>And I find that, that's something that I'm going to help to get the rest of the company. Not all of it, cause it's massive, but where I can help to, show how to validate things. Then, for me, that's really optimization on a company culture. </p><p>Guido X Jansen: [00:26:52] I recently had a session, for digital elite day.</p><p>and it was about, how to become better as hero practitioner. would you have any tips for heroes or just share your story? How would you, how do you go about improving your own knowledge level of thoughts? Euro, if you come across something and you say, Hey, I want to know more about that.</p><p>What do you do? Do you read a book? Do you go get a course? Do you get your hands dirty? How do you approach that? </p><p>Dave Powell: [00:27:18] I'm very much a hands on person. And, I think from everything that we pretty much mainly learn is by doing, I'm going to borrow the phrase from growth track, get shit done. That's really what it is.</p><p>Get your hands in there. See what's happened in ask customers, ask people, does this work, does that work for you? Validate things, test them out when and wherever you can. and it, yeah, if you feel compelled to go off and read about a website, ecology to do I'd say follow up. What excites you?</p><p>what, what you love about it? what area particularly excites you and then really just dive into it and learn as much as you can from wherever. </p><p>Guido X Jansen: [00:28:02] And if you want to know anything about the comparison tables, go to Dave.</p><p>and for example, a two like fake model that you just, don't write in and started using it, or did you follow a course for it or whatever video tutorials that helped you out? </p><p>Dave Powell: [00:28:18] I've done a few video tutorials and I'm also one for looking for sauce fails. So if there's an issue that I don't know how to solve, there's a great community out there, So how do you do radio buttons? How do you do drop downs yet? There's a sauce file out that go look at it. Understand how it works, steal it and use it. You know what I mean? That's what it's there for. So </p><p>Guido X Jansen: [00:28:40] it's like templates. </p><p>Dave Powell: [00:28:41] Yeah, absolutely. Yeah. </p><p>Guido X Jansen: [00:28:43] then thank you so much for sharing your story with us.</p><p>So my final question for you will be, who I should invite next as a guest on the Shiro cafe and, what I should ask him or her, </p><p>Dave Powell: [00:28:54] I believe you've done, A podcast with Roderick from Brad engineers, but I would like to invite LTL fond of fear, she's a wonderful presenter. And, she's helped us out a no end with the EEG, tests from brand engineers.</p><p>Yeah, I think you should invite her on and, and have a look at inside people's brands and, what she can tell you about the difference between a conventional user testing and, EEG testing. </p><p>Guido X Jansen: [00:29:21] Yeah. And they also have this new tool. Are you guys using that too, or? </p><p>Dave Powell: [00:29:23] No, we're not using that one at the moment.</p><p>No. yes. COVID budget cuts. Let's say. </p><p>Guido X Jansen: [00:29:32] So we'll ask her I'll do you know about, about brain peak and, the current status of that one? I think I spoke to Rohrig just before they released that. so yeah, it will be interesting to get an update from them. how does, how that's going? </p><p>Dave Powell: [00:29:44] I've really enjoyed working with them.</p><p>We've worked with them for a number of years now and, it's one of those things I think is always got to put a stake in the ground. And see how people are experiencing it on a subconscious level. Which yeah. Is always fascinating. Yeah, </p><p>Guido X Jansen: [00:29:58] exactly. Dave, thank you so much. Great talking to you and hope to talk to you soon, somewhere offline.</p><p>Dave Powell: [00:30:05] Pleasure. Thanks. Bye. Bye. Take care. </p><p>Guido X Jansen: [00:30:10] And this </p><p>Dave Powell: [00:30:10] concludes </p><p>Guido X Jansen: [00:30:10] season two, episode 41 of this year, both guys to with Dave . And again, make sure that they're shared this with your colleagues, if you like the content. And especially if you've experienced a similar market shift because of the pandemic. Next Monday, in our episode, we stay on the client side.</p><p>When I talk with Emily Oliver, UX and experimentation manager at music, magpie and declutter, and she is going to share some interesting experimentation results </p><p>Dave Powell: [00:30:37] with us. Talk to you then, and always be optimizing.</p><p>‍</p>",
  "show_notes": "<ul><li><a href=\"https://www.figma.com/\" target=\"_blank\">Figma</a></li><li><a href=\"https://www.sketch.com/\" target=\"_blank\">Sketch</a></li><li><a href=\"https://maze.design/\" target=\"_blank\">Maze</a></li><li><a href=\"https://usabilityhub.com/product/five-second-tests\" target=\"_blank\">Usabilityhub 5 second test</a></li></ul>",
  "guests": [
    {
      "id": "dave-powell",
      "name": "dave-powell",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/switching-gears-when-the-pandemic-upends-your-traffic.jpeg",
  "language": "en",
  "type": "podcast"
}