{
  "id": "the-vitality-of-the-data-revolution",
  "title": "The vitality of the data revolution",
  "description": "We learn about promoting the value of market, opinion and social research from Esomars president Joaqim Bretcha live at MIE20.",
  "date": "2025-01-08T20:07:07.493Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/b4b051aa.mp3",
  "transcript_url": "<p>Guido X Jansen: [00:00:00] Tell us, who are you and what do you do? </p><p>Joachim Bretcha: [00:00:02] Thank you. Thank you for having me here. </p><p>Guido X Jansen: [00:00:06] Yep. Yeah. Okay. </p><p>Joachim Bretcha: [00:00:10] Thank you. Thank you for having me here. It is. My pleasure. Yeah. so I am tracking Brita. I'm a guy from Barcelona here in the show. I am the SMR president, being as a Mark, the lower community of the market research and insights and analytics.</p><p>in the world. So we are present in the hot 100 feet pantries, more than 6,000 members around the globe, but impacting 100,000 people or more in the whole community. And I work also for, for a Spanish company called net West that we are data collectors, in law, in Spain, France, Italy, Germany. </p><p>Bart van der Meer: [00:00:46] And w what kind of data do you collect?</p><p>Joachim Bretcha: [00:00:48] So we born as a digital collector, Creating access panels. So people are willing to participate in surveys or tasks. Like we were asking. We're very focused on having them very well profiled and incentivizing them properly in a very nice, unfair relationship. And then we move to the more developed surveys.</p><p>So we acquire a batch company in 2014 for white Cooper that had a software that can trace what people does, what people do online. I'm a wine, Oh, always with consent, of course, and informed consent. And with the whole information. And incentivizing them. Of course. So now we are collecting huge data sets because we can track what people do on their laptop or their mobile.</p><p>And this is the way we can serve. We are in this observational, basically of passive data. </p><p>Guido X Jansen: [00:01:36] And, this morning, you had a session here at the me conference and you gave the audience a global outlook on the vitality of the data revolution. So what would that, what was that about </p><p>Joachim Bretcha: [00:01:47] evolution? we are in the forefront of sort of evolution.</p><p>the Congress office from our Wars in September in Edinburgh, they like history and they like to dig into history. So I was inspired by the Scottish enlightenment in breasts, but this alignment of what's a fantastic moment in which the sports really had an effect on the world. They changed the world and just many people.</p><p>And among them, I'm a Smith just will mention that. And Smith and Tim's ward. So he was telling, look in the first industrial revolution, there was a concept created a new concept. That was the capitalism, the new concept that really allow the revolution. And the second one was the power was a steam machine, also promoted by James Walker, Scottish guy.</p><p>So we had these two pillars, the fourth industrial revolution, and they do believe that the fourth institution, the one we are now, it's an revolution that is transforming. The way we create, share and expand the value is completely throughout the digital capabilities. Now we have two pillars and if we look at the mindset, it was capitalism in the first industrial revolution.</p><p>I believe today is human centricity having the few minutes center. if we look at the power is data, as everybody says, power, they visited the current oil, but not only data, I would add data drastic data. So data that you'll have collected with via the trust of people and doing the things properly. So the two pillars of the fourth industrial revolution for me are, customer centricity, people understanding and thoracic data.</p><p>And who else is better positioned for this, that Margaret searchers insights professionals that have been for more than 100 years, treating people with respect in terms of understanding what they do and managing data. Yeah. And </p><p>Guido X Jansen: [00:03:32] it's not getting easier for us data professionals. This is if, with specifically GDPR, everyone seems to be against us </p><p>Bart van der Meer: [00:03:41] browser, are coming in the next few years.</p><p>Guido X Jansen: [00:03:44] Exactly. ITP ATP. </p><p>Joachim Bretcha: [00:03:46] Yeah. But I think this is an opportunity. we, as professionals have always said on several related putting the bar high, if anybody could do that would be easy. Yeah. So this for us is an opportunity to differentiate ourselves from other industries. For instance, the UK, data protection authority just released last year in a report saying that they are super concerned, extremely concerned about the amount of data that is being shared without the knowledge of people and the deep, the deep data that, in terms of deep of observing what people do.</p><p>That was for the programmatic industry providing news and Promatic advertising industry. So many things have been done there in properly. We as professionals in the micro research and insights profession, we must do things properly. We have to construct these pipelines in which information or data just troubles.</p><p>Yeah, we must do that, but we must be very careful in doing that properly and really respecting the rights of people as citizens. </p><p>Bart van der Meer: [00:04:47] how do we do that? Other than following the law? Is that, are there things we should do or need to do ourselves? </p><p>Joachim Bretcha: [00:04:53] I always say that we are just in the infant, in our childhood regarding technology.</p><p>we have got drank of technology for the last 20 years. what's like an eras and now we are just waking up saying, Oh, Whoa, what happened? What happened? yeah, it wasn't hung over. Maybe. technology has really blown as a way, wow, we can do so many things. And now we are discovering that stuff.</p><p>So many things also have a cost related to it. Yeah. So I think that now we are just at the beginning of they're standing the impact of technology in our lives. And for instance, GDPR, for me, it's has the first attempt to rule this. I believe that more or will happen because we're adjusting the childhood or maybe in the teenage, maybe you already says now thinking, okay, Now we have understood, when the humanity started to be in life in, on earth.</p><p>what was the life span was 20 years. So people, every three years was repeating the same learnings. When we pass from 20 to 30 years, there were some people that had experience and could tell the guys there 10 years, Hey, look, don't eat this. Don't go this way because you will have problems.</p><p>So these people were really. Important to the evolution of the humankind because, okay. We are learning. So I think we are now still in this 20 years of span. And now some people say, eh, don't go this way because this way is dangerous. </p><p>Guido X Jansen: [00:06:15] And what do you see happening in a, say the next five years?</p><p>Further than five years for me, it's like the next five years. What do you expect? But what </p><p>Joachim Bretcha: [00:06:25] are you guys working on? </p><p>Guido X Jansen: [00:06:26] for them? Yeah. What are the projects groups within the organization? What are you working </p><p>Joachim Bretcha: [00:06:31] on? so the one, so the subject that is really steering the whole industry is the end client.</p><p>So the end user, because there is a transformation there. we all know that people want to be, have better information to take better decisions. In a much more in a faster way. Oh, so these are parents, everything and India cheaper because there's also this new mindset, which is everything is doable and everything is cheap or wait is not that cheap.</p><p>so what is happening now is that people want it's faster yeah. To take this issue. So what we are seeing is that because of these digital live we have under, this is like a public, this, we have to collect data. every time it will be less necessary to ask for data that we must have four different and spend time to dive into the whys, dive into the world.</p><p>we observed you are doing all this. Why are you doing, why do you prefer this? So a combination of observational data, plus a more qualitative data. And of course there is now a spend alone from the end client that wants to insource the sense that do it yourself. Is a big trend, okay, we don't need to have so many internal years told me that middle man.</p><p>So we'd have been sourced and all these pipelines to make sure information or the data trail from one side to the other. But for instance, this week we have too many, two very relevant pieces of news. One is the culture of the championship. You know what it is. So he was the he's apart a while it was this antivirus.</p><p>Software that you could install on your lap, desktop for free. Great. That was to defend you, to prevent you from having virus, but they were in this hall of information terms that they were delivering. They were capturing everything you were doing. All right. Your laptop. It's a library. Yeah. Yeah. how many people was using that information?</p><p>Because it's, it was millions </p><p>Bart van der Meer: [00:08:23] of people. And what was the name? I will </p><p>Joachim Bretcha: [00:08:26] have to check, sorry, my memory, maybe it's mixing too many languages. Yeah. Avara a V a R </p><p>Bart van der Meer: [00:08:33] F antivirus. </p><p>Joachim Bretcha: [00:08:34] Sorry. &nbsp;I've asked. All right. so this particular day of championship has been closed down, so there's a big effect.</p><p>And the other one is Google's announcement on, closing the third cookies. Third party cookies. Yeah, I really do. So these are very relevant names suddenly. different data lakes with these appear. So how will we react that? Yeah. </p><p>Guido X Jansen: [00:09:02] And, so your organization, is collecting those concerns, from your men members.</p><p>And then, you think you do research, but you also take this to governments, right? </p><p>Joachim Bretcha: [00:09:12] So SMR is, is a nonprofit organization, for members and companies. so yeah, we try to. To elevate those interests in front of the legislator. our mission is to educate the legislator, to make them understand what we do and how we do things.</p><p>I'm assured them that we are in good shape, where we professionals were not doing nothing. Badly. </p><p>Guido X Jansen: [00:09:33] so how often, does your organization talk to legislators and think, Oh my God, they have no idea what they're talking when I'm talking about </p><p>Joachim Bretcha: [00:09:41] no, very nice process. We have a responsible, between Brussels and Amsterdam community and it's taken us like six years to have now a very important place in European union meetings.</p><p>So we were starting talking with, let's say, of his officers. From a certain rung and we have been upscaling with errors. </p><p>Bart van der Meer: [00:10:03] yeah. </p><p>yeah. And now they, they discuss things with you when it's, when there's a data issue coming up too. so you can help them understand. That's what it is.</p><p>They're talking about why people use it, what they can do with it, both good and embed. And if they want to make legislation about it, what would be the good way and what would be the </p><p>Joachim Bretcha: [00:10:25] wrong way? Yes, that's it. We are sitting at the table, which is important. We had elections for the European parliament, which has recently.</p><p>Yeah. So the whole team changed. So now we are rebuilding all of this, all these connections and networking, but now we have the learnings and these learnings are exportable. Europe is the most active player, but the rest of the world is also following the pattern. So in India, in brassy, Japan, Australia, Singapore, Africa, we are using these experiences and learnings to help also other parts of the world because there's a marriage worldwide.</p><p>It's a worldwide organization. </p><p>Guido X Jansen: [00:11:00] do you feel like politicians are actively reaching out to the organization to get information or is it still about you guys really need to push this on their agenda? </p><p>Joachim Bretcha: [00:11:12] You mean politicians? Yeah. Politicians are very concerned about in Europe about sickle cell. On the rights of citizens.</p><p>Now, it's something that's been copied in other countries. </p><p>Guido X Jansen: [00:11:21] are they actively looking for information on this that we can, or you can. </p><p>Joachim Bretcha: [00:11:25] they are aware of the problem and they want to tackle the problem sometimes is lag. If you want to cut a tree and do just well with the bulldozer and think they whole for, so we have to make sure that if they want to get that tree.</p><p>Yeah. Is that signal? What is the tree? How they have to cut it? </p><p>Guido X Jansen: [00:11:43] that sounds like when we just spoke before the recording, there's this proposal, in the USA, that's. Yeah. Any kind of research, any user needs to, give informed consent for that. There's not only online, that's for every kind of research, but also scientific research for, universities, that, participants should give informed consent.</p><p>Which basically kills the whole, research, because yeah, for a lot of those research things, it's important that the user does know what it's about. Otherwise it's they already have a bias for the research. but yeah, that sounds like the bulldozer. Yeah. Yeah. </p><p>Joachim Bretcha: [00:12:20] We are learning. We are all learning about the facts of everything I showed this morning.</p><p>For instance, a wall street journal, sorry, New York times in December, they released eight. In a row articles were interesting because there were some, people working in different apps, the U S that were alarmed by the quantity and the depth of the data they were collecting.</p><p>So they released anonymously to the New York times, 12 million people data yeah. Have their cell phones and you could trace everything through indeed, that Trump, you could really, they're just very nice. These are things you can follow. I've been </p><p>Guido X Jansen: [00:12:57] thinking about it in Europe. We have this Austrian, that goes up, against all the big companies that, okay.</p><p>give me your data. And then, I think there was a couple of Germans also that's requested like all the data from their telecom provider and, basically showing them. W older GPS data for the last five years, </p><p>Joachim Bretcha: [00:13:16] but these are not telecom providers. This is your app for your fitness app or whatever.</p><p>It's not even the Telekom. Yeah. And this is because the technology allows to collect everything they do. So what we have to say, no, we just have to collect these data that has a purpose and it has to be limited. </p><p>Bart van der Meer: [00:13:34] and, also if I install an app, I am not automatically consenting for you to.</p><p>Resell that data to anyone you want. That's it. even if you only collect the relevant data, I still don't want you to just sell it out to insurance companies. </p><p>Guido X Jansen: [00:13:50] Yeah. And that's also why. so I had a discussion a couple of weeks ago. I was a guest on another podcast. &nbsp;ditch, both guests and that we spoke about, I also have ad blockers, and all like it goes three or whatever.</p><p>And not necessarily because I don't want that. The website, I visit not to collect my use data. I'm actually, usually I'm fine with that. That's fine. But I don't want them to sell it to whatever advertisement party and some websites are horrible. Usually with Ghostery, they're reporting on all the trackers that are installed.</p><p>Sometimes it doesn't even fit on my screen. </p><p>Joachim Bretcha: [00:14:24] I just presented this morning. some slides of others. We have run two studies, asking consumers about privacy and how they feel about privacy. that the Netherlands was one of the countries, 10 countries that I was always one of them , people. So the main computer, if you are transparent, if you are transparent, you gain the trust.</p><p>If you can trust them, people are willing to participate and to engage and to share. Otherwise, if you are a bit blurry, people are not, they don't have the trust. so it's a very strong message for companies and brands say, look, you have to work and being very clear and people treating people as adults and being clear, okay, we are going to collect this.</p><p>And for this reason, I don't worry, we are not going to do this or that. </p><p>Bart van der Meer: [00:15:06] Yeah. And what is, for ASMR? what I like the main points you're going to focus on, let's say in 2020, for example, are there specific things or countries or, Yeah. What did you want to achieve this year? </p><p>Joachim Bretcha: [00:15:20] Okay. My main objective.</p><p>Guido X Jansen: [00:15:23] This is your final years of precedent. </p><p>Bart van der Meer: [00:15:25] Yeah, we talked about it. </p><p>Joachim Bretcha: [00:15:29] Yeah. It's only two years. Yeah. It's an election. It's an election process and it's been fantastic by the way. so my main objective is to get to communities closer. The community that is the more traditional people came from the motivational space of market research and the community coming from the more.</p><p>Data analytics, data scientists, digital technology got part of the equation. These tend to be more new generation, more modeling to data, more related to how to work with data. The others come from the generation that they really understand the purpose of the survey or the purpose of the investigation or the work they understand the needs of the clients and understand what are the answer because that's stuff that they need to deliver.</p><p>So we, I think we have to become more methodologic agnostic, have a very open view. Okay. Okay. What is your problem? let's find an answer. I don't care. What are the metrics that we'll use? What they have is to bring you a valuable answer for you to have a double decision to take the good position.</p><p>So my main objective is to bring these two collectivities together to help those people that come from the more traditional space together. into this new era of digital and also give the new digital professionals, this vision and this broader view of what is this all about?</p><p>Because sometimes we find that this new community is very much into data. They love treating data, working with data, but they need to have, say a superior perspective or, okay, this is useful for what we need to understand. What is the business question that is behind? Get the response. Yeah. with these lakes of data, you can really get to crazy places.</p><p>You find correlations that have no meaning, but you'll have fun. You go on that. Maybe you can take bad decisions, so you need to have this way. I call it that we need translators. We need people that can translate these two worlds. </p><p>Guido X Jansen: [00:17:21] Okay. how do you see, the maturity of the industry, in Europe versus the rest of the world?</p><p>Joachim Bretcha: [00:17:27] Well, Europe is. The traditional market is very powerful, very diverse as well. So let's say us it's quite interesting. they tend to say that you as is more quantitative and have it stage is more. Okay. Let's give me hard data. I know I want to have a number. Do U S is more tense Europe. Sorry.</p><p>It tends to be more like, okay. We have to understand the why. and Asia is just jumping. they have this reality of more traditional, but also jumping into the new. Did you tell like very fast when I told the world, I am, I like to provoke. Okay. I am provocative. Sometimes being present is hard, but I am provocative.</p><p>And when I, is it </p><p>Guido X Jansen: [00:18:10] a </p><p>Joachim Bretcha: [00:18:12] rebel spirit? Yeah. Got that one rebel spirit. so when I told the world I tell Americans, look, you need to repeat it. We Europeans have to save the world. We are the ones who saved the world. So they look at me. So they look at my friends. they like it and they're going to be like, what did you say?</p><p>Yeah, I look at listen, China, the three main powers, China, us Europe. So China drinks treats people like you, American free people like consumers. The only ones that treat people like citizens is zero. if we want to save the world, we have to be strong in Europe, keeping these values very high, be provocative, but in a way in that way, summary.</p><p>Alright, cool. Nice. I have no </p><p>Bart van der Meer: [00:19:00] more questions there. That's very clear. </p><p>Guido X Jansen: [00:19:02] Yeah. That's sounds like a big, there's a big, </p><p>Bart van der Meer: [00:19:04] yeah. One year is not going to be enough, </p><p>Joachim Bretcha: [00:19:09] but it's about setting.</p><p>let me finish with this. Symbology was giving you before. I think it's very nice. traveling the world, you learn a lot of things and you meet very interesting people. Brilliant people here, always people I like to talk to. No. Yeah, you are a wonderful market. Yeah. And so I was in Mexico.</p><p>I visited this topological museum, which is one of the Western world and it's on Mesoamerican cultures is amazing. So I got immersed in the midst of American pre-Columbian period. So there was in 15, 19 is when the clash of cultures of court. So he was like, Martians came to earth and to communities. Yes.</p><p>So it was the Spaniards getting into Mexico. What is today? Mexico then actually learn Mexico city and the asterix ruling, all these parts of the world. And the assets were a very sophisticated country culture. Sorry. The Nazi land, the current Mexico was like Venice. It was built on a Lake and you have all the candles and you'll have all the markets and zoos policies.</p><p>Everything was fine. So he wants to catch up mixing a clashing. So the way they started to talk is because I've not got this landed in Yucatan, which is the South area of Mexico, very bad. So he got a life in prison. This lady, my LinkedIn is one of these feminine characters in this story that has changed the world.</p><p>A few people know. So Malinchak, she took her as a slave. She could speak my young, of course it was my young and she would speak as stick. And then you had, another Spanish breeze for &nbsp;sorry. he had been, she braked there, so it had been there for awhile. He couldn't speak Maya, so they arrived to Mexico city &nbsp;they start to talk and the way they talk was, non Cortez spoken Castilian for that from a &nbsp;to Maya and from Miami, by Melinda to Astec to the King, that moment, the King was super powerful.</p><p>they asked the King was super powerful, but he used to. Speak like a child. So when he was meaning, for instance, my people don't, my people don't love me. He was saying, I am very feared. people respect me. So he was using this contrary side. it was not </p><p>Bart van der Meer: [00:21:20] literally saying what he meant. </p><p>Joachim Bretcha: [00:21:21] Yes, that's it.</p><p>But you have to know that. Yeah. So in this moment they meet and he says, you a Spaniard, you are welcome. This is yours. And the translation was literally this one word by word. What he was meaning was you get out of here. I will tell y'all don't even dare to do anything. That was a real meaning. Yeah. So these bad translation had a huge effect, as Yeah. </p><p>Guido X Jansen: [00:21:47] and at least that did the translation, right? there are quite some videos I think on YouTube and I like this is a, like a fun business, thing to do with your team just to stand in a line. And then one sentence and one sentence to the next person and the next person gives it to them.</p><p>Number three and number four. And like after 50 people, it's something completely </p><p>Joachim Bretcha: [00:22:07] different, but that's what we need today in our industry. We need these translators that can really translate the motivational side with the digital more techie side, because we can't afford the clash of cultures. You mean, must get together.</p><p>We must work to have this holistic view and understanding of people, which is what we are here for. </p><p>Guido X Jansen: [00:22:26] Yeah. You want to prevent the total shutdown, right? like the proposal in the U S like saying, okay, we're doing informed consent, no data collection at all. If we get there and it's going to be really </p><p>Joachim Bretcha: [00:22:36] tough.</p><p>Yeah. We did. We professional has to know what they do for what the article is about. Yeah. </p><p>Bart van der Meer: [00:22:44] good luck with that for the next 11 months. </p><p>Guido X Jansen: [00:22:46] Yeah. </p><p>Joachim Bretcha: [00:22:48] I would say I would like Barcelona to win the champions league, but I'm afraid that's difficult. </p><p>Bart van der Meer: [00:22:55] I don't think, in the Netherlands we have any chance of winning it as well.</p><p>Joachim Bretcha: [00:22:58] no, I don't think so. Last year was a year. </p><p>Bart van der Meer: [00:23:00] Yeah. </p><p>Guido X Jansen: [00:23:03] Keep that in mind. Thank you so much. Have a lot of fun here at the conference. </p><p>Joachim Bretcha: [00:23:09] Thank you.</p><p>‍</p>",
  "show_notes": "<ul><li><a href=\"https://www.esomar.org/\" target=\"_blank\">Esomar</a></li></ul>",
  "guests": [
    {
      "id": "joaquim-bretcha",
      "name": "joaquim-bretcha",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "https://youtu.be/1SNMCft8_9w",
  "main_image": "src/assets/images/episodes/the-vitality-of-the-data-revolution.jpeg",
  "language": "en",
  "type": "podcast"
}