{
  "id": "the-art-and-science-of-converting-visitors-into-customers",
  "title": "The Art and Science of Converting Visitors into Customers",
  "description": "Khalid and I discuss how you can go about the seemingly simple task of finding the things that are broken on your website.",
  "date": "2025-01-08T20:07:07.493Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/8914845d.mp3",
  "transcript_url": "<p>Khalid Saleh: [00:00:00] So my name is Khalid Saleh. I have been doing conversion optimization CRO since 2006, a long, long before even full knew what CRO it is.</p><p>And I still remember the early days of, because we would talk to VP of Phoebe's of eCommerce CMOs, and they would ask. So what do you guys help with? And I tell them, well, we help with conversion rate optimization. And they're like, Oh, search engine optimization. I'm like, no, it's something different. It was an interesting challenge back then because you really trying to educate people about, about CRO, how it started as a and interesting stories.</p><p>So I come from a development background. I finished my computer science degree from college. I was a software developer, senior software developer, then a software architect. So I, I saw a clear path, you know, I'm like, okay, software architect. Then my next level was going to be either a director of development or a CTO.</p><p>That was my plan altogether. In 2005, I get a dream projects. Motorola finally decided they need to have an eCommerce sites and they were willing to invest millions of dollars and it's, and I still remember getting the calls. You're going to be one of the three architects on the project, about 120 developers working, two other architects with me, price tag, $35 million, three months to spend that money, develop everything.</p><p>And it was. It was a dreamland, I mean, whatever features we wanted, they said, just go ahead and implement them. We, we implemented everything you can imagine within the span of three months. And of course, as a software, as a software architect, you get to choose what pieces of the software you work on.</p><p>So like, you know, the interesting parts you're like, I'm going to work on this and I'm going to give the rest of the team new </p><p>Guido Jansen: [00:01:42] technologies. </p><p>Khalid Saleh: [00:01:45] That's literally what we did. That was just funny because now if I mentioned some of those technologies feel safe, really? That was new. I'm like, yes, it was 2005. It was new back then.</p><p>Long story short. We, we finally come to the Launch day, we're excited. And I remember I'm reading about marketing. I was interested in a CEO at that point at that point. And I'm convinced in my mind that they're going to have a problem when it comes to visitors, to the sites, they're not going to have enough book come to the site.</p><p>We turned the new sites on and we had 16 servers, Microsoft servers, and it's a cluster environment. And within two hours, three hours, the whole cluster goes down. All the servers are down all of our 16 beefy servers. So they did not have the problem that I imagined that they would cause there were a ton of traffic, tons of visitors because they had the advertising campaigns on billboards and online everywhere you can imagine.</p><p>Great. I'm happy. I'm not going. We can bring the service back up. We'll figure out the issue. But then another problem happened because a month later for our $35 million investment for the $35 million investment that Motorola had put in the project, they had about 10 orders, not great ROI, you know, I mean, he probably could have people money, you know, it was like here here's $200 on buy from us.</p><p>We'll be better ROI. Long story short, some people lost their jobs, and in my head a spark for a new idea, I'm like, Oh, we can, we can do something there. and that's how the idea of invest started actually. it's kind of like at the same time my wife had had her, we had our first baby and she was sitting at home and she's like, well, I don't want to go out and work.</p><p>What should I do? I'm like, well, you know, we ran into this problem. Maybe you can figure out a way to help companies solve this issue. Never imagined is going to become an agency. I'm gonna choose a completely different career path. But here I am 15 years later doing CRO loving every, every minute of it.</p><p>Guido Jansen: [00:03:45] Yeah. And I, jumped forward till, two, this week. I saw you post a short video on LinkedIn. and, and, and many people, listening to this podcast minds might recognize this. but the main message of the, of the video you posted is, asking his hero. If they guarantee results is a dumb question, dumb request.</p><p>Khalid Saleh: [00:04:08] So please explain. Sure. So I always say, like, even on my LinkedIn profile, I have a very strong opinions. But they are weakly held so I can change my opinion if somebody convinces me otherwise. And I think by the way, that's what CRO does to you. I am constantly humbled by, by visitors and by experiments that we run, I used to give talks and I still do, around, around the world.</p><p>And I would say. This is absolutely the truth I noticed. And then we run an experiment a month later on the curly. Really? This is what one shouldn't have. so we, we get this quite a bit, many companies can't and, you know, as they go through the process, they're interested in conversion optimization because they typically have seen gay study, about an AB test that generated 2015, the a hundred, sometimes 500% uplifting conversion.</p><p>So they get through the excited. They look up the top companies and then they usually like, you know, they'll, they'll reach out to them. They say, Hey, we'd like to invest with you guys. And the next question, do you know if they have not done marketing long enough that you'll hear this question, we're going to X invest amount of dollars.</p><p>Can you guarantee the results? Yeah. And I always tell them, well, Conversion optimization. Ultimately the core at the heart of it is as the process testing, experimenting, and when you're experimenting, ultimately what you're doing is you're saying that I have a hypothesis, I've done my analysis. I've done my research.</p><p>I have a really good theory of five visitors are acting a certain way and now I can, how I can adjust that behavior. But I don't know. I want to experiment. I want to validate that hypothesis. And that's the reason we call it the experimentation. We don't call it the guaranteed results. Now I offended somebody recently because they said, well, you don't guarantee any results.</p><p>And I told them, I'm like, let me be very Frank with you. A couple of things. If anybody, whether you sign up with us or not, if anybody guarantees results, you probably should walk away from that number two. If I can guarantee results, I would have humongous list of companies standing in line, wanting to sign up with us that doesn't happen either.</p><p>I'd love for it to happen. but it's not happening and it doesn't happen with anybody. Now, what I can guarantee you is we will do the analysis. We will do lots of discovery. You will see the work, you will see the, but this is getting created, but it is up to your visitors to judge. Whether we know what we're doing or not.</p><p>so, and then the other thing that I always add the first two to three months in any CRO engagement, you have some quick wins, correct? That's like, you're like, okay. I think based on my experience, that can figure out how I can increase conversion rates, but really you're just doing research. You're just understanding.</p><p>The website visitors, you're making assumptions about them. And after about three months, you start saying, okay, you know what? Now I understand how visitors click. I understand really for this particular website, what I need to do, but before then, you're just guessing. And you're just throwing your opinion out.</p><p>Some people feel very uncomfortable with what I say, but I'm like, this is just the reality. You do it long enough. This is, this is how you should deal with it. Yeah, exactly. </p><p>Guido Jansen: [00:07:06] And then we are more like the R and D department of the eCommerce team writes is it's </p><p>Khalid Saleh: [00:07:11] not the guaranteed results. We </p><p>Guido Jansen: [00:07:12] do research.</p><p>Khalid Saleh: [00:07:14] It's just almost like it. Like when somebody, I always tell I'm like, you know, I, I faced two people there, a group of people that say we don't believe in AB testing. experimentation. We don't believe in that. And I always tell them like, well, you take, when you get sick, take any medicine. They're like, Oh, of course.</p><p>I'm like, I tell them, look, do you recognize that every medicine that you take before it gets put out in the market, it goes through a process of AB testing experimentation. Now at the same time, I'm asking for guaranteed results in CRO is almost like going to a company and telling them that a to scientist and tell them you have to go and see that this drug is going to work.</p><p>No, they don't know, you know, they've done the best research, but then sometimes they put a drug out and they discover that, Oh, it's making things worse. People are dying. That's the same, </p><p>Guido Jansen: [00:07:56] asking a people asking for a guaranteed a COVID-19 vaccine within </p><p>Khalid Saleh: [00:08:03] X months. </p><p>Guido Jansen: [00:08:04] You don't know, maybe berries will be there.</p><p>Maybe you'll never be there. We don't know. </p><p>Khalid Saleh: [00:08:09] Or you can use them the malaria drugs. Correct? Exactly. Exactly. </p><p>Guido Jansen: [00:08:18] Yeah. And also I think it's zero, of course. I think that's an often discussed topic within people are practicing zero to zero is not the best term. Or what we do. Right. And that's, I think part of the issue, I guess, when, when, people outside of our field, see what we do and see, okay.</p><p>Conversion rate optimization. Okay. Tell me how much can you optimize my conversion rates? </p><p>Khalid Saleh: [00:08:40] I mean, it's, it's. </p><p>Guido Jansen: [00:08:41] It's not necessarily a dumb, but </p><p>Khalid Saleh: [00:08:45] yeah, I just, I just had to use that term just to get people to talk. It's a tough one because, and I've seen some posts online about people saying, well, we should call it something else.</p><p>And I see, for example, that the optimize the core cause of the experimentation, I have. Mixed feelings about that, because I remember doing CRO before. I remember when the term first came out, the Eisenberg's Brian Eisenberg came up with the term and then they start using it, the future now, which is it, which doesn't exist at this point.</p><p>But it's almost like you're fighting a losing battle and I'm like, Oh, it is what it is. But really the problem is in understanding what people like, you know, the, the understand that people have about CRO and what it entails. And it's understanding what Sarah practitioner, practitioners themselves understand about the field and how they optimize and how they can increase conversions.</p><p>Conversion rate itself is difficult to optimize sometimes. Correct. So, yeah. </p><p>Guido Jansen: [00:09:40] Yeah. And also the, the, the, the challenge with the term experimentation I find is that businesses are not. Interested in experimenting there, they're interested in the results, which might be increasing the conversion rates, which is why that terminology works.</p><p>But they're not necessarily interested in the next permutation. If you say, Oh, I want to experiment on your website. That's okay. Sure. But I'm only going to pay for that. </p><p>Khalid Saleh: [00:10:03] You know, I think you hit the nail on its head because. Lots of times. And this is by the way, one of the challenges with doing CRO, we focus the success rate for conversion optimization testing programs.</p><p>It hovers around anywhere 10 to 12 to 15%. People are usually Brown proud when they get to 15%. And I always saw them like, you know, in the industry, we focused a lot about what we learned. We're learning from failed experiments. We're learning. And I completely appreciate that. Then that's what we do. But I want to think of it from the other side of the table, from the side of the CMO or the business owner or the founders of the startup, they're really not interested in what we're learning.</p><p>We eventually earned the right to talk about those failures. Correct. But initially they're like, Oh, I'm not paying for science over here. I'm paying for results. I want to see exactly what impact you have on my bottom line while we learned this and this, and this is about your customer. Well, how do I translate that into dollars in the bank?</p><p>Because that's ultimately what my investors want to know. And that's what I want to know. Yeah. That's kind of like the field where we struggle, a CRS marketing majors have suffered. </p><p>Guido Jansen: [00:11:05] And the sheriff for AB testing has been impacted too. If you want to keep that thing to enterprise standards, but safe, 80% on your annual contract, you can consider a comfort, but there's summer release.</p><p>You can take advantage of full stack and hybrid features, strong </p><p>Khalid Saleh: [00:11:21] privacy compliance, no blink and enterprise. </p><p>Guido Jansen: [00:11:25] Great security. Feel good about your smart business position. Infested what you saved, backing your CRO program. Check out www dot &nbsp;</p><p>Khalid Saleh: [00:11:35] dot com </p><p>Guido Jansen: [00:11:36] slash 2020 walking about experimentation and maybe even our R and D.</p><p>chiro is often, applied as optimizing what we already have. how do you think's hero's canal in, in discovering new features? </p><p>Khalid Saleh: [00:11:54] I think this is such a, an important question. Lots of times when we do CRO, there's different levels that you work on. So at the very basic, very basic level, you know, you have bugs on the website, you have performance issues, you have the ability issues as mobile first or not.</p><p>You gotta get that out of the way. And that's simple in all honesty, some of that stuff is not, does not even require a CRO, correct. A good QA company, quality assurance company should be able to point out to you the bugs that you have on your website, right. They don't exactly which, you know, keeps us in business and, and you can use analytics and you can use heat maps and session replays.</p><p>And. Yeah to find some of those issues. So that's, that's fine. And that's the very first level. The next level is what I call usability issues. And I always also like to make the distinction between usability and conversion. I think both impact the website, conversion rates and both impact revenue, but usability.</p><p>I think of it as more top of mind issues. I'm clicking on a button as a user and I expect certain things to happen, but they're not happening. you know, I'm trying to do certain things on your website then, you know, the system is not responding to me. Less fixed usability issues. Now the level above that is conversion.</p><p>And when I go to conversion, I'm working on two things. One is issues that you have on the website. So persuasiveness, how does your website convince me to buy? So that's number one. Number two is new features that you must have. And lots of times we ignore those, but those are so powerful because you go out from.</p><p>I'm tweaking the website and I'm enhancing certain things into, guess what? I've just opened, like, you know, a whole new revenue stream for you a lot more strategic. I'll give you a couple of examples first on the usability versus CRO. cause people always look at like really, and I know this has been a debate that's been going on for a while.</p><p>I was telling you on the, whenever you fix usability issues on a, on a website, you end up with a website where. The visitors thinking to themselves can buy from this website. You it's conversion issues. There's two levels. When it comes to fixing conversion issues. The first one is you go from, I can buy from this website and two, I want to buy from this website.</p><p>Very powerful. You fix persuasiveness issues. The second level of conversion you go into, I must buy from this website or conversion and you go from the 1% to 2% to eight or 10%. So that's, that's one example. The other example about strategic initiatives. So I have a friend who does lots of user research and it's funny because he would never call what he does conversion optimization, but really that's what he does.</p><p>Like, you know, at some level, right. And he was working with a, re a manufacturer for furniture you'll figure. I was like, okay. And he's doing customer research for them. They sell, bedroom sets and he's interviewing all those users. And he discovered that. Typically in the past, when people bought bedroom sets, they, you know, they put it in their bedroom and they sleep.</p><p>And that's the end of that. But now there's the transformation, especially with COVID the bedroom sets, especially on Saturday day and Sunday hums hangout place for the, for the whole family. We're not long, we're no longer just using the bedrooms, that's asleep and it looks nice. No, we actually want the bedroom set for the kids to hang out.</p><p>So the bedroom functionality needs to change. And I was talking to him. I'm like, he's like, this is so powerful because now he's working with that Spanish factor to say, so how do we rethink manufacturing? The bedroom sets no longer is just a bench, you know? And I had dressed and all that and I'm like, okay, this is powerful user research.</p><p>Guido Jansen: [00:15:18] Turn it into a workplace or a play area. </p><p>Khalid Saleh: [00:15:22] It's so powerful. Correct. And now, instead of like, Oh, I'm just tweaking the website and making it more user friendly. I opened a new line of business and we're talking about $80 million of additional revenue per day, then 2021. That's powerful. That's conversion optimization.</p><p>That's Beth. </p><p>Guido Jansen: [00:15:39] Oh, you help, companies find, basically the broken areas on the websites, whether it's usability or preservation. I think that mainly, it sounds mainly like the BJ fork model, right? So you need to increase, both, your usability and your perspiration and you need prompts to have people act.</p><p>On the website. It doesn't make sense to have really persuasive websites if it's been usable and the other way around, it can be very user friendly, but if no one wants to buy there, it's not use. But how do you go about helping people find those broken areas on their website? How do you find out what is broken?</p><p>Khalid Saleh: [00:16:13] There are many models that we use. And I think like now it became a standard, a standard model for lots of CRO. So one of the things that we'll do whenever a new client comes on board, there is. A whole bunch of interviews that we conducted when it comes to user research and we use the jobs to be done framework.</p><p>Yeah. That helps us really drill very deep to understand what bill wants to buy. What are they using the products for? What did they decide to stop using his instead one day bought this new product and that's built the foundation for any conversion optimization work that we do now next after that, we'll do.</p><p>a series of activities, we'll do an expert review if they want, we're doing an expert review, we're getting two, three of our team members sitting in a room, looking at the website from the perspective of the visitor and looking at usability issues and conversion issues, looking at the mobile and desktop we're looking at.</p><p>Okay. So where we're coming from, which landing page what's the keyword that they're using. So making sure that there's continuity. So we typically run the site through 150 different points. Just jotting down all those different issues that we see on the West side. after that we'll look at analytics.</p><p>So now we look at data and try and figure out using the data. What's the story that we're seeing on the website and data is extremely powerful. Yes. This can be tricky, correct? Because if you look at data long enough, it can tell you whatever story he wants to hear. So you have to be very careful. we're looking at heat maps, video gear, recording, session replays, of users, users on the, on the site.</p><p>We conduct user research, but on a smaller scale compared to the user research that we do. And that's when you see those popups that appear on the website, trying to understand yeah. Three different types of elements. I would say motivators, what's bringing people to the website and we tried to understand barriers.</p><p>What's stopping people from converting and hooks for those who converted, what actually persuaded you to convert. we'll do some usability testing as well. So we'll bring bill from outside and it. For usability testing. I love to do give the sites on a mobile device to my son or daughter. I'd tell them, Hey, go ahead and add an item to the cart and just wash them or give the sights to my mom.</p><p>I always tell people if you can sell to my mom, he can sell to anybody. Cause she's not aware of all the latest and greatest those tasks to be very, very simple. The interface has to be very simple. we would look at also some of the competitors to just understand the competitive landscape. If there's interesting features that might be worth us considering.</p><p>Those different devotees are looking at the site through those different prisons and different ankles. Jeremy's humongous list of issues. we're that we need to optimize with one websites. We generated so 250 items, and I always tell people I'm like another started 50 items that are just my, our initial run through the website.</p><p>each one of them could turn into. Quick fix, look and lose. There's something broke over here. Just, just go ahead and fix it. We don't need to test or no, there are certain things where we know that's, you know what? We actually need to spend some more time analyzing their behavior, or we come up with a new design.</p><p>So that's kind of generally the process that we've run through for over </p><p>Guido Jansen: [00:19:19] 10 years now, all my diet of advisers about evidence based conversion optimization with a focus on data and psychology. We see that analyzing data and recognizing customer behavior results in a better online dialogue with your clients in a higher ROI, that team of strategists, analysts, psychologists, and UX specialists gathered valuable insights in online behavior of your visitors.</p><p>Khalid Saleh: [00:19:41] And together with you </p><p>Guido Jansen: [00:19:42] optimize the different elements of your Ciero program through redesigned expert reviews, AB test and behavioral analysis. For more information about their services, go to Owen dialogue. And how do you feel about, I mean, this is just an expert to refuel rise. I also have this list and on the one hand, this is the easiest way you can sell Shiro to our clients because you can do a stand alone on the other end.</p><p>I don't actually want to do an expert. Right. I don't think if I would advise you as a client, I wouldn't advise an expert review. I would say let's go do, do user research with actual clients. </p><p>Khalid Saleh: [00:20:23] Yeah, it's a, it's an all honesty is it's a fun show. we have a large client. They're an SEO company, very well established, perhaps one of the first SEO companies in the U S been doing SEO now for 25 years.</p><p>And they came to us and this, I know the owner, he said, I'd like to do a CRO audits. I tell him, okay, well, let me understand. We actually have done a CRO audit for them, I think two years ago. And they took our recommendation and they implement it and he's like, you know, he's like, we didn't see a huge increase in conversions.</p><p>So I'm like, okay, so he's like, let's do another expert review. And I told him, I'm like, look, let me be very honest with you. And expert review is just my opinion and grade that you appreciate my opinion and you think I'm an expert, but your users might have a completely different opinion. So let's do that.</p><p>The abuser research now. I'm thinking to myself, and this is kind of, we're always putting ourselves in the shoes of our clients. I think to myself, I'm going to benefit my client. Correct. And it's like, it's much better for you. He's thinking, Oh man, this is going to be expensive of lengthier than a CRO audits.</p><p>That's the reality of it. Now we actually managed to convince them to go through the process of user research and we're going through this process with them or we're like, okay, let's do the user research lessons with jobs to be done interviews. let's go through this process to uncover issues on the website.</p><p>And it's sort of interesting. So they do this company because they're an SEO company, they do SEO audits and he was telling me, he's like, you know, CRO audits are different. So you don't do an expert. If you want to do a user research, I'm like, yes. And then he's like with an SEO audits, they tell the client specifically fix one, two, three, four, five, six seller stuff, things that you need to fix on the site with a CRO audit.</p><p>We don't tell them, fix one, two, three, four, because we tell them you need to test one, two, three, four. And by the way, this first idea, you need to do that three, four other things. It's like. This doesn't work. And I'm like, yeah, that's the challenge with CRL audits. They're easy to sell, you know, there are smaller engagements, but how much the client benefits from them.</p><p>It's, it's a tough question to answer. </p><p>Guido Jansen: [00:22:15] Exactly. Yeah. It's definitely what I tried to do is, the list of items to have those come from previous research, like, Nielsen Norman group, or a CXL or whatever research I can find. so at least base it on something besides my own opinion, but still, and, and it's not necessarily well, necessarily cheaper, right?</p><p>I mean, I'm doing user research. It's not that doesn't have to be that expensive, especially when you're starting out. </p><p>Khalid Saleh: [00:22:42] Well, it depends. So, so we conduct two different types of user research. The. Jobs to be done interviews typically, right? We tell our clients we'll conduct 20 hours of job interviews just to be done interviews.</p><p>Each one of them is about an hour. So 20 interviews, 20 hours, there's 20 hours that need to happen before and 20 hours needs to happen after analyzing and then pulling all that data. When cuffs, just to do jobs, to be done interviews you're at about the a hundred to 120 hours. And this is just the user research versus an expert to use.</p><p>So with us, one of the benefits of doing CRO for so long is we've conducted close to 15,000 AB tests at this point. </p><p>Guido Jansen: [00:23:18] That's a, that's a great, base of, of, of data that you have that you can use for that. Right? </p><p>Khalid Saleh: [00:23:21] Exactly. But you know, what's for each recommendation that I give you, I can literally pull up and I can tell you, I'm looking off this recommendation with 20 clients that worked really well and generated an average uplift of 7%, but with three clients, it actually reduced conversion rates.</p><p>And with, yeah. And I look at this data and I'm like, I mean, I'll make a recommendation, an educated recommendation. But it's challenging. It really is not easy. </p><p>Guido Jansen: [00:23:41] Yeah, exactly. So you just spoke about, also with higher management, it can be hard to convince them of, of, of experimenting in itself. so how do you go about, basically, training your clients and helping implements.</p><p>A culture of experimentation at the company and as you've worked for him, but assuming you, you also think that that's something you need even to do your job and to keep doing, to keep the client, </p><p>Khalid Saleh: [00:24:07] the, the, the process that we follow. One of our, we run a project, we refer to it as ship scrutinized, hypothesize implement and propagates, and, and like there's differences.</p><p>That scrutinizes, when you find all the different problems, we just talked about hypothesis, you create bought the Cynthia, the design implemented. Did you run? They be testing the last portion propagate as the education. Yeah, we have learned the hard way. That without client education, you can have the most successful project you're generating uplift, but if you're not educating the client, if you're not sharing the wins, if you're not sharing the learnings from the experimentation program, you're not able to keep the clients for a very long time.</p><p>So. I remember a large enterprise client. They sign up with us. The CTO is very excited and he he's the one who sponsored the project and I'm like CTO, but company let's come on. And they're one of the top 10 companies online actually. So I'm like, Oh, well, they don't even have an experimentation program.</p><p>Look at this, we're going to do something really amazing. Six months later, we finally managed to launch our first aid test. I always refer to it. I am willing to venture and say, it's the most explosive to ever launch. To make things worse. We don't generate a single uplift from that AB test sitting with the CTL and he's like six months single AB tests.</p><p>I'm looking at him and he looks at me, he's like, and there is no uplift. Like yes there, no. I was like, we paid this much for a single AB does. Now the nice thing is the director has director was sitting there and he explained to him that we had 23 iterations. You you're given feedback on the AB testing and modifications.</p><p>what, where it's powerful is that the same company that we're talking about now, their development team, and since they used to have a large development team and they used to call it the agile, but there, it wasn't really agile. Now it's split to 17 different teams. now every single feature that gets rolled out to the site is, goes through an AB test process and experimentation process.</p><p>Now it took about four or five years to get to that point where it just really ingrained in the culture. took a lot of hard work, but now they turned from two from, Oh gosh, we've wasted so much money into it. Oh, gosh, we have to do it this way. This is how we succeed. That's the reason I think client education initially when it comes to here's the process that we're going to follow and then sharing the wins sharing, like, you know, and then saying, Hey, we've had this one over here.</p><p>Can we actually take it to your BC team and see what they can do with it? the, the, the best example that I, as we were running testing for dish network, which is a large satellite provider for DV services, we would take the wins. From what we've done online and they would use them and they, advertising that they did a newspapers, had lines, you know, inserts.</p><p>And I think out of like 17 or 18 different tests, only one of them did not generate 10 uplift. Now it's not the same uplift, but 17 or like, Oh, here, now we can even multiply here your winnings and guess what? That turned them into two believers as well. </p><p>Guido Jansen: [00:27:08] Yeah. I think for me a really important milestone is always, usually when you get in.</p><p>developers see AB testing and experimentation as extra work, cause it needs to do it on top of whatever their feature they're developing, right now as really important milestone. When you get to a point where the development team starts understanding no, no, we should be facilitating things before we build them.</p><p>And then it saves us time. I think for me it always feels like a big win. If I reached that point. </p><p>Khalid Saleh: [00:27:38] If the developers start thinking and I listened by the way to the language that developers use. Yeah, because developers and me coming from a development background, we'd like to have the best code and it looks really elegant and it's fun.</p><p>It doesn't matter whether users are going to use it or not. We don't think of it as the barbers, you know, I was like, great, that's amazing. Use it. Goddammit. but if a developer start thinking, Hey, I got this really quickly. We can test the functionality. And if users like it and start using it, plus enhance it.</p><p>If the developer says that he or she that's what the experimentation is all about and it's extreme, extremely powerful, but that's also another reason why with most of our clients, we handle the implementation ourselves. if you, if we had done this interview back in 2011 out of told you that most of my failed experiments, because we give ideas to our clients that we're waiting for development team to implement, but we're just sitting around and we used to have flags when we give the client our seventh or eighth experiments and they haven't implemented, we know that they're going to cancel the contract.</p><p>Cause they haven't implemented. What's the use of experimentation. That's the reason we switched to a mode where we have to implement the code, the experiments ourselves. Yeah. </p><p>Guido Jansen: [00:28:43] And, it was peak of 2011. Well, actually 210. I think your book, you wrote a book </p><p>Khalid Saleh: [00:28:48] on CRO. </p><p>Guido Jansen: [00:28:49] so now 10 years old. if you, if you would be writing an update for it for 2020, what would you change?</p><p>Khalid Saleh: [00:28:57] So it's, it's sort of interesting because. The book and it talks about the, the, you know, the conversion framework, which was what we use for our expert reviews, kind of the different analysis. There's so many different things that we want to change. Of course, all the case studies need to be updated, but let's talk about the fundamental things we've introduced the process jobs to be done in the last couple of years.</p><p>And our clients have seen tremendous success as a result of that. There is nothing about jobs to be done in the book, because we just learned about the process two years ago. So that's a new chapter in the book. The book is when we first wrote it was talking about our process, but it didn't talk about the full, it talks about just the scrutinized phase and talks about the expert review portion.</p><p>So. When we run a project there's 16 different steps to the book talks about the only one step in the process of conversion optimization. How can expert review without the elements you do evaluate? I would say about 20, 95% of the book needs updating, but the, I would write a new book, go about the whole process on how you actually run an end to end conversion optimization program.</p><p>That will be, I think a lot more useful nowadays SiteSpect </p><p>Guido Jansen: [00:30:04] offers a worldwide unique AB testing, personalization and product recommendation solution SiteSpect works, service sides without any tags or scripts, which guarantees an optimal performance. The SiteSpect solution eliminates delays and the chance of any </p><p>Khalid Saleh: [00:30:19] flickering effects.</p><p>Guido Jansen: [00:30:20] And this approach also ensures that the current and future browser </p><p>Khalid Saleh: [00:30:24] stretcher rules </p><p>Guido Jansen: [00:30:24] like ITP and ETP don't make an impact on your AB testing and personalization of more info. Visit &nbsp;dot com. That's going to be a huge uptime.</p><p>Khalid Saleh: [00:30:39] Or a second, yeah. Book, because it's funny because as I was talking to our publisher recently, our editor and because it was like, we need to like an update to the book and. When we published the book, there was, there was only two other books about conversion optimization written at that point in time. So he pulls the list and he's like, he looks at me and says, she's like, he's like you recognize there's 70 other books written about conversion optimization since then.</p><p>Yes. I recognize the field has changed so much. And I told him. No, it needs to be a new book. I mean, yes, there are some updates to this one, but there should be a new book completely. </p><p>Guido Jansen: [00:31:11] Yeah. Trailblazer four to four to zero books. That's good. </p><p>Khalid Saleh: [00:31:15] Ah, there you go. At least we try, we try. Exactly. </p><p>Guido Jansen: [00:31:19] So you can, you could try to do that again with, your next book.</p><p>If, if 10 years later there's 70 books on a topic, then, then you did </p><p>Khalid Saleh: [00:31:26] that, right. There you go, there you go. That's actually, and I mentioned this to you when we were kind of exchanging emails, when we decided, you know, what are we going to release our, training? Like, you know, the CRO mastery training where we said, you know what, we've been doing this training.</p><p>So we do the training all across the globe. Now, last time I did it, I was in, I was in Singapore. Long, long flight that can tell you that much 24 hours almost. And we do the training usually around the U S and now we're stuck. And I'm like, Oh, well maybe we finally record this training. And I'm like, okay, well, how do you take that training and convert it into a book, you know, things to ponder and another project to add to the list of things online course, that's actually what we have.</p><p>So the CRL mastery is of course, yes, we released it about a month ago and I think we are. </p><p>Guido Jansen: [00:32:10] So why did you go to Singapore for an online course? </p><p>Khalid Saleh: [00:32:13] Well, no, at that point it was an actual, an actual conference. They invited they're like, Hey, you know, and I, Oh, I am, I'm like, I've never flown to like, you know, East Asia.</p><p>I'm like, Oh, good reasons. Like, you know, take a break, fly there, discover a new culture and, and teach conversion optimization </p><p>Guido Jansen: [00:32:27] at the Singapore's a nice city to pick that </p><p>Khalid Saleh: [00:32:29] out. Definitely. Definitely. </p><p>Guido Jansen: [00:32:31] That's a good one. So, if you look forward to the next, say, say next year, how would you like to.</p><p>Change the way that you work with, with clients on zero, what would you like to improve? maybe on their side or on your side? </p><p>Khalid Saleh: [00:32:45] There are several things that I think every CRO should think about, about this challenge. I always think about kind of what are the big challenges. And I think if we are able to sell them, then clients will benefit more from or services and we can keep those clients much longer and we can have there.</p><p>Visitor's happier because we're creating a more user friendly website. I think one of the struggles that many CRS face is figuring out how do I show my client the exact ROI that I'm generating as a result of my work? cause the client would like that. Oh, definitely. we gotta figure out a way to do that.</p><p>Now we have few things that we've been experimenting with. they're not easy to implement, but eventually the minutes we'll figure this out. We want to roll that out. I think that will be very interesting. There's a lot, the focus on experimentation on AB testing, but in all honesty, if you think about, if you peel the onion.</p><p>And you'll look at all the different AB testing software out there from the optimized way to VW. And we have our own, a dusting software that we released. We've used it with clients for many years now. We made it available to the public. If you peel the onion, They're all very simple, correct. One version of the website.</p><p>Here's another version I'm going to split visitors and I'm going to see the uplift. Exactly. It's that, </p><p>Guido Jansen: [00:33:58] especially if you, if you use Google something like Google analytics to do the analysis anyway, so exactly. </p><p>Khalid Saleh: [00:34:03] So I will stop here and. AB things, companies struggle with that, by the way. So I'll give you an example, optimized lead.</p><p>They're like, Oh, so we've built the software. What do we do next? So they go to personalization. They couldn't figure out what to do is like quit or we'll just add something else. VWO and, and, been long time user of VW. I've done the guys when they first started, they said, Oh no, we're going to add the full conversion optimization platform.</p><p>We're going to do session replays and heat. Again, they're stuck. And I think what needs to happen when it comes to a B testing software is to figure out how we can use AI. Or machine learning to actually enhance the customer experience on the website. And I was stopping on like nowadays people use AI very loosely, you know, that's like everybody has AI.</p><p>And I was like, this is really not AI. If you have . Exactly. I know there's a big distinction, correct. Between the two, if we can figure out a way to use AI. To an end like genetic algorithms where you figure out different versions of the websites and how you can actually enhance those genetic versions of the different websites to present users with a better experience.</p><p>That will be powerful. Now I know that there's experiments ascent, for example, is trying to do that and they have some interesting. Some interesting work and trying to achieve that. They're still not there, but I think that will be interesting to see in two, three years from now and how that would work the whole Google policy around cookies.</p><p>And I'm not even going to get into that time, how that's going to impact us. That will be also huge. So it will be interesting couple of years actually, when it comes to conversion optimization, </p><p>Guido Jansen: [00:35:37] final point, you you've written a book, but do you, do, do you have any recommendations for our audience in terms of books?</p><p>Are you an avid reader or? </p><p>Khalid Saleh: [00:35:45] Oh my God. I, I, yes, I am. I'm always looking at, I always have four or five books next to my head that I'm constantly reading. Here's what I think it's easy to you open a blog post, correct. And read. And there's some, by the way, some amazing resources when it comes to conversion optimization as available, I think what Pat and the guys at CXL have done.</p><p>It's just tremendous because they really revolutionize the industry. our blog, I always think is our blog is kind of the second most popular blog. I think pep gets about 300,000 visitors a month. We get about a hundred thousand visitors. So it's like quite, quite a task to try and catch up with them, but investing the time and picking the right book.</p><p>And Jim thinks of the time to read books and delve deep. That requires commitment and not, everybody's willing to put that commitment by the way. Now, if you pick any topic and you choose two, three, four, five books on it, and you read about it, guess what that elevates your next thing is you just figure out a way how to implement that, that knowledge.</p><p>some of the books that I really love reading and, and they're more business, but the roadless stupid is one of my favorite books that I've read that I continue reading just about running business and talks about. All the mistakes business owners make and that the stupid tax that Bay I was talking, I'm like, Oh my God, if I think about the stupid off paid running ambassador in the last 15 years, I must have wasted a couple of million dollars on silly things.</p><p>And now I read this book and it's like, Oh my God, you're pointing out to me all the mistakes I've made. So. there's couple of books on differentiation. I think that's another big thing. Whether you're a CRO or you're an eCommerce or a SAS company, we live in a time where everything, but he looks the same.</p><p>Correct. and that's what we suffer from the problem of sameness. we were doing a usability test for, for eBay. And we're trying to turn to test the search functionality on the, just to see how it works. And we bring a whole bunch of people. They're testing iPhone 11 to see if people and I'm watching there.</p><p>And this guy searches on eBay for iPhone 11. Doesn't like the search functionality. It goes to Google, puts insights, ebay.com. You know, I found 11 second result. It's not the eBay. It's actually Amazon. Remember, we're doing these about this for eBay. The guy clicks on the Amazon result adds the iPhone 11 to his baskets.</p><p>He's going through the check and I'm standing there watching him. And I thought, where are you going? He's like, well, I'm finishing the task that you asked me to do on the you're on the wrong side. </p><p>Guido Jansen: [00:38:10] Yeah. Yeah. That's something that I've also seen in, in user research. That's that blows my mind when people just go through a different, so I did research for a price comparison websites, which buyer, redirects people do a different website, but people.</p><p>Thought they were buying from the price comparison website. And I already knew from, from the, people, working at the help desk from the price comparison website, like 20% of the phone calls is people that have a question about the product that they bought. Well, I'm sorry he's at him, but I'm pretty sure he didn't buy it from us because we actually don't sell anything.</p><p>Khalid Saleh: [00:38:46] There you go. It's a huge conquer. This problem of sameness. We all look the same, whether you're CRO consultants, how do you distinguish yourself from other CRO consultants? You know, whether you are an eCommerce offsite, how do you distinguish yourself? Cause everything has been commoditized. Product services, you know, I've been commoditized.</p><p>Guido Jansen: [00:39:05] Isn't that something that's a pep is also a writing about lately. I think he's writing a book on it or something like </p><p>Khalid Saleh: [00:39:10] that. He is so like, you know, I think we both are like funny because I've been writing on LinkedIn for awhile and then he's also, he's like, Oh, I saw him in January and he's like, Oh, I'm writing a book about it.</p><p>I'm like, Oh really? Because it's such, such an important topic. and I think if you're able as a business to figure out how to stand out. That's how you really going to be able to capture a segment of the market. That always mentioned a story. So we have this company reached out, reaches out to us and says, Hey, we want to hire a CRO company.</p><p>I'm talking to them. They're large. And the project is really nice. It's like almost like a, not 20, $25,000 a month for a 12 months engagement. So I'm talking to their COO and he's not called by the way. We're also talking to CXL to wider funnel, kind of the usual suspects that we always compete with. So I'm thinking to myself, I have evolved because I can sell better than anybody else.</p><p>I get to know the CMO were presented to him two weeks later, you know, we're really, we established that relationship and I call him, I'm trying to find out what's going on. And actually conversion rate experts were also on that, on that part. Some talking to them, the guy's name is Michael and I'm like Michael.</p><p>So you've listened to us. You've listened. CXL, you've listened to wider funnel to CRE what do you think. How do we stand up? And now I have thought to myself, by the way I stepped out from, from them. That's what I, and he just he's like call it. Can I be very honest with you? I'm like, sure. He's like Collin, you guys all sound the same.</p><p>If I did not know who I'm talking to use out executive, same as CXL as CRE as wider fund is like, there's no difference. It's like the differences are so low now that's really hits me in the face. I'm like, Oh really? I might think that I'm different, but here my prospective clients has told me you're the same, you know?</p><p>So how do I distinguish myself? So since then, this was back in 2015. Differentiation and how you stand out is a big thing that I always ask myself and ask my team </p><p>Guido Jansen: [00:40:56] like blue ocean strategy or other books that you, what kind of books do you, see on this topic? </p><p>Khalid Saleh: [00:41:01] Bang. I can, I wish that there is a really good book, two to click it, to kind of look for, I think there's a book competing against luck.</p><p>very powerful. It talks about jobs to be done, but it talks about also differentiation. That's very, very powerful blue ocean strategy. I love that book as well. I must have read. Oh, 15, 20 books about the topic. And in each of them, I have them all my Kindle sections highlighted. Then I look at them and the problem is not in the theory, correct, but the problems in the implementation.</p><p>Cause I can tell you the theory is very simple. Create a, create a unique experience. Everybody can copy my process. No one can copy the experience. Okay. Great. Well, What does that mean? There you go. You know, how do I actually create that experience? That's a lot more difficult. </p><p>Guido Jansen: [00:41:42] Any final books you want to zip?</p><p>Ah, </p><p>Khalid Saleh: [00:41:43] I think all the books that I can think of fleeing up, especially I've been up. Like I told you, I've been up since 3:00 AM, so.</p><p>That's like reading books, read books, doing calls, you know, I think I've done my all at the same time. I woke up my wife and she was like, Oh, how's your day. I told her. I'm like, you know, I've had seven calls and I'm about to jump on a podcast recording as well. She's like, wow. It's such like productive day.</p><p>Like a typical day. There you </p><p>Guido Jansen: [00:42:06] go. Very good. Thank you so much for, for joining me on the, on the podcast and sharing your thoughts about the CRO industry. Much appreciated. I think. Thanks. Thanks so much for your time. Well, </p><p>Khalid Saleh: [00:42:16] thank you for having me. I appreciate you having me as well as the guests. Thank you.</p><p>Bye bye. Bye.</p><p></p>",
  "show_notes": "<p>Khalid Saleh is CEO at Invesp, one of the first companies in North America dedicated to CRO that he founded back in 2006. He's also the co-author of an Amazon.com's bestselling book: \"Conversion Optimization: The Art and Science of Converting Visitors into Customers, a book he published already 10 years ago.</p><ul><li>CRO Mastery course <a href=\"https://bit.ly/CroMastery\">https://bit.ly/CroMastery</a><a href=\"https://www.linkedin.com/posts/khalidh_marketing-conversionoptimization-abtesting-ugcPost-6673293163072942080-wQvB\" target=\"_blank\"></a></li><li><a href=\"https://www.linkedin.com/posts/khalidh_marketing-conversionoptimization-abtesting-ugcPost-6673293163072942080-wQvB\" target=\"_blank\">LinkedIn post on \"Guaranteed results\"</a></li></ul>",
  "guests": [
    {
      "id": "khalid-saleh",
      "name": "khalid-saleh",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/the-art-and-science-of-converting-visitors-into-customers.jpeg",
  "language": "en",
  "type": "podcast"
}