{
  "id": "the-6-soft-skills-that-cros-need-to-master-with-elise-maile",
  "title": "The 6 soft skills that CROs need to master",
  "description": "Learn the 6 soft skills you need to have or develop as a CRO specialist: listen, communicate, organize, be flexible and curious and have integrity.",
  "date": "2025-01-09T14:36:18.243Z",
  "duration": 3032,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/88328bc0.mp3",
  "transcript_url": "<p>Guido: [00:00:00] and before we started with the soft skills, we of course like to know how you got involved with this, you know, how you got started and what you're doing with this you're out right now. </p><p>Elise: [00:00:10] Um, so pretty much like everyone else I fell into CRO. Yeah. I, um, I actually started out as a front end developer.</p><p>So I'm self taught how to code. I taught myself when I was about 15 years old. Um, and then I went off to university and did a media arts and English, but my media course was really practical. So there was lots of Photoshop and I learnt how to record radio and edit video. Um, and part of my course, yeah, it was great.</p><p>It was really, really hands on, which is so unusual for a university course. But then I ended up specializing in website design because I already had a bit of a background. Who is code. Um, and then Australia. Yeah, I was working as a freelance web designer and developer for about nine or 10 years. So quite a long time working in digital.</p><p>Yeah. And then I took on a contract, um, with a B2B company and they were doing AB testing and I was like, this is quite interesting. This is, this is quite fun. Um, I'm one of those rare front end, double X front end developers. Um, That wasn't particularly attached to my code. Uh, I didn't, I wasn't precious about it at all.</p><p>If it needed changing, I was fine with it. Um, and that the whole appeal of AB testing was I could write some code, test it, see how it went. Um, and then, you know, if it didn't work out, then that's fine. You move on to the next thing. But because it was a B2B company, it took forever for us to get any kind of results of that, of that test.</p><p>Um, So then I actually moved on to a travel company and worked there for almost two years within their dedicated optimization team as a front end developer. So I was just building tests day in, day out. Right. Absolutely loved it. And I learned so much from my colleagues about AB testing process, experimentation analytics and all these things, which I had a little bit of knowledge about from.</p><p>Dabbling in it at the BTBY company and from my background in digital, but I'd never really followed a proper process, but because they already had a same ingrained, I learned so much. Um, so then I kind of. Turn that into my career, essentially. Um, and I worked, I worked with an eCommerce business for about two years, and then I went into contracting.</p><p>I've been contracting for the last gosh, almost three years now. Um, sort of moving around, helping, uh not-for-profits especially, but also, um, I really like focusing on small to medium sized businesses. Um, I really like going in and making a difference in doing the education piece around what experimentation is and, you know, helping them out with, with that research piece as well.</p><p>So I do quite have UX, um, with most of my contracts as well, so that UX piece, that analytics piece, um, and then helping them embed this process into their workflow. And I think the really nice thing about working for SMEs in particular, Is that, um, once you've made that impact, I told them what the benefits are of experimentation.</p><p>I can then. Leave that job, but leaves them in a position to hire someone permanently. So I feel like I'm opening up the job market for other CRS who want a permanent job, which isn't me at this point in my career. Um, but there's plenty of people out there that are looking to go in and make a difference and to work in CRO, um, So, yeah, I've really enjoyed.</p><p>We enjoyed doing that sort of work, um, in terms of what I'm doing at the moment. Um, I'm actually, I'm actually rolling down a lot of my contracts because, uh, I'm seven months </p><p>Guido: [00:03:38] pregnant. Congratulations. Thank you. </p><p>Elise: [00:03:40] Um, so I'm, I'm kind of planning on taking a bit of maternity leave for a couple of months, um, which means that most of my contracts at the moment are sort of winding down, um, helping find replacements, um, to sort of cover my maternity leave.</p><p>Um, And just, yeah, that's, that's kind of what I'm working on right now is sort of handover stuff more than anything else. </p><p>Guido: [00:04:01] Basically, you're creating a lot of jobs for everyone. Uh, and, and now extra work because of your freshmen pregnancy leave, </p><p>Elise: [00:04:08] uh, </p><p>Guido: [00:04:08] giving, giving work to everyone else in the industry.</p><p>That's really nice. </p><p>Elise: [00:04:12] It seems to be that way at the moment. Um, I, I'm sort of, I've been posting over the last couple of days about I'm on LinkedIn and on Twitter, about a couple of jobs that I've seen advertised. I'm just trying to connect. The right people to the right jobs. Um, and I'm like, I didn't, I didn't sign up to be a recruiter.</p><p>I've got a lot of respect for recruiters right now because there's an awful lot of chasing. Um, and I, I wasn't, I wasn't expecting to do that. So, um, yeah, but that's, that's kind of how I find it to see how our and what I'm doing right </p><p>Guido: [00:04:39] now. I'm curious, like I just said, no one studies hero. So I think you, you also rolled into it.</p><p>Was it mainly, um, uh, learning on the job or that you also. Uh, seek out particular like courses online, um, um, to, to fill in some, some gaps in your knowledge, </p><p>Elise: [00:04:59] a bit of both. Um, I think that there's no substitute for learning on the job. I think that's the best way to learn. Um, and certainly in my experience, I learned much better through having an actual project to follow rather than, um, sitting down and doing a course and answering questions.</p><p>Um, although I have, I have done that, I've done sort of all of the Google analytics, um, certifications, um, I'm sort of looking at copywriting courses. Uh, I've had lots of conversations with SEO experts. So not necessarily a course, but like building up that network of people you can go to and ask questions.</p><p>Guido: [00:05:33] That really depends on the, on the course, how hands on they are. Of course, some do have projects anymore. Uh, working together included, but yes, there are also a lot of those courses. Of course, it's, like I said, just filling in a form or a to get your certificate throne. </p><p>Elise: [00:05:49] Yeah. It, it feels like a box ticking exercise.</p><p>And for me, I don't, I don't learn through box-ticking I learned through doing, um, but everyone, everyone is different. Right. So some people are much better having a structured course to follow. Um, I had to train a guy how to code, um, About a year ago and, you know, everything I taught him was useful, but then he was like, I really want to do a structured course because that's the best way that he learns.</p><p>So he went off and did a structured, a JavaScript course and came back with this immense amount of knowledge, um, which is like really, really helped him out over the last year or so in the role that he's, he's working. </p><p>Guido: [00:06:24] And they also are also really juice enjoyed, uh, the combination as in, um, I want to get those that handle, uh, experience, but also.</p><p>I would prefer to skip the first couple of months of failing. Yeah. As, as much as possible. So a couple of hours, uh, of a course to help me get started and to at least avoid the biggest mistakes that would be </p><p>Elise: [00:06:51] well, you can't, you can't avoid failing. You can't work in CRO and avoid failing. I'm really sorry to break on to you.</p><p>Um, but no, you're, you're completely right. And I often find with, um, especially paid courses, uh, you never really know what you're going to get. Um, they kind of give you all this sales spiel and you're like, Oh no, that sounds great. And then you sit there for the first couple of hours and go, well, I already knew all of this or you go, this is way over my head.</p><p>What have I let myself in for? Yeah. So finding the right course can be so, so tricky. Um, which again is part of the reason why I much prefer learning on the job. It's partly reason why I love working for SMEs because a lot of the time. Something is thrown at me and I go, do you know what? I don't know the answer to that, but I'm going to go look it up.</p><p>And I'm going to speak to my network and find someone that knows the answer and I'll come back to you. And I've learned something in the process of doing that. Um, but again, that's just me. That's, that's how I learn </p><p>Guido: [00:07:45] best for over 10 years now, online dot look at Pfizer's about evidence-based version ultimization with a focus on data and psychology.</p><p>We see that analyzing data and recognizing customer behavior results in a better online dialogue with your clients and a higher ROI. The team of strategists, analysts, psychologists, and UX specialists gathered valuable insights in the online behavior of your visitors. And together with you optimize, if the elements of your zero program through redesigned expert reviews, AB test and behavioral analysis, for more information about their services.</p><p>Go to online dialogue. Speaking of gaining skills, uh, the point to where we're sitting together, uh, today is you, you wrote a blog post, uh, about chiro soft skills. Um, so first of all, why did you, uh, write the book? </p><p>Elise: [00:08:35] It started off about a year or so ago. I'd landed a contract and, um, And there was some big communication issues with one of the stakeholders.</p><p>Um, and I sort of sat there and I spoke to some of my peers and the people I was working with. And I was saying, why are we struggling to explain to him what CRO is? Why are we struggling to get him to sign off on any experiments that we want to run? What's the, what's the problem here. Um, and it turns out that he was a really visual learner.</p><p>Um, he didn't, he didn't have the, um, the brains that thought in analytical ways, he couldn't look at data and go, Oh, okay. That's a problem. Um, she couldn't, he couldn't read an email or read a hypothesis and understand that that was a problem. And this was the concept that we wanted to experiment to see if we could improve the problem.</p><p>So, yeah, we, we worked out, he was really visual. So off the back of this contract, which had been really frustrating for a good couple of weeks, trying to. Understand what he wasn't getting. It was just a communication issue. Like he couldn't, he couldn't understand the way I was communicating to him. Yeah.</p><p>As soon as I, since I had this brainwave of, Oh, he's visual, he needs to see wire frames or he needs to have a mock up of something, which isn't the best process to have. But when you're trying to educate someone around the AB testing process, um, Just to begin with then having a visual and sort of doing that extra piece of work at the beginning of, of a test process really, really helps in the long run.</p><p>Um, after just had this brainwave, why somebody thought, Oh my God, I had a stakeholder a couple of years ago. Who I was having the same issue with and we would butt heads all the time. And it's probably because of my methods. My preferred method of communication was not the same as his preferred method of communication.</p><p>He couldn't absorb the information. Um, and then that kind of trailed back to a story that I frequently tell, um, from my university days I have, um, I have a really close friend. I'm still really good friends with him who, um, is not dyslexic, but he. It's really struggles to absorb information through reading and writing.</p><p>Um, that's just not his preferred method of communication. He, um, he's very audible, so he's very chatty, um, understood things better when he was sat in a lecture and could listen to the information, but that meant that he really, really struggled to write and submit his essays on time. Whereas I'm much more of a written communicator.</p><p>Um, I know I'm speaking right now to you on a podcast. Um, but I, this has taken the years of practice for me to sort of get better at communicating, um, audibly and linguistically, um, as opposed to writing stuff, which is part of the reason why I wrote a blog post. Yeah, exactly. Um, so I kind of worked out the system with my friend.</p><p>Where he would dictate his essays to me. And then I would sit there and I would write them. Um, and the irony is like, I kind of do the same thing with my now husband, uh, quite a lot where he will, he works for startups. Um, and he's heavily invested in one particular startup right now. And, you know, he'll, he'll kind of have this idea and really struggled to.</p><p>To articulate, um, what he wants the messaging to convey. So we'll, we'll literally sit there or go for a walk and we'll have a chat and then I can sit there and write down copy for him. And so I think this is what you were trying to trying to say, essentially. Um, so the whole idea of the CRO soft skills was off the back of this is experience that I had with a contract.</p><p>And then when I thought about it, I thought, actually, this goes way back. These methods of communication and preferences go way back in my life. Um, I have all of these examples to draw on. I want to draw more attention to it. Um, and that's kind of how I came across this whole idea of CRA soft skills. </p><p>Guido: [00:12:28] Well, so let's go, uh, go through them.</p><p>You you've written down, uh, six of them. Is there like any particular order or hokey in them or </p><p>Elise: [00:12:36] not? Not really. It's just how I wrote the article. And so I'm kind of happy to go in whatever order. Yeah. </p><p>Guido: [00:12:41] So let's start with listening. Number one </p><p>Elise: [00:12:44] again, I feel like listening is, um, It's kind of like that key point to understand what someone's preferred communication style is.</p><p>Um, And I, in my article, I've split it into two. So there's the aspect of listening to your customers, especially when you're working in CRO, you know, your customers are the ones that are probably experiencing the problems. They're the ones whose experience you're trying to improve upon. So you should listen to what they have to say.</p><p>Um, I mean, I'm a big advocate for UX. I come from a developer background and I've been doing AB testing for longer than I've been doing UX, but the more I've I've done. UX the more, I'm a big advocate for it. And I think you can't really do UX without doing AB testing at the same time. I think the two go hand in hand, um, which is why listening is so important because you can understand why people are struggling to complete a particular action on your website or app.</p><p>Um, so that's why I think listening to your customers is really important, but I think that listening really extends into your colleagues as well, especially when it comes to trying to understand, you know, how best they communicate with you. So. Um, again, it could be that they have a test idea, um, but they don't really know how to explain to you their test idea.</p><p>Um, but if they've got an idea, then that's great. That means they're already engaged. You know, you don't have to necessarily educate them around, um, AB testing. Um, But, you know, you need to do something with that test, which means you need to listen to them in the first place. Um, if you're trying to work out what their preferred communication style is, listening is not necessarily having a conversation like we're doing right now, listening to, and also be reading.</p><p>They could have written you an email or, you know, send you a screenshot of another website that they've seen where they've gone. Oh, I really liked the design of this particular aspect on this website. That's their way of communicating. So you need to listen to that. And then try and communicate back in a similar style </p><p>Guido: [00:14:36] and, and, and try, um, try to get them to understand the, how AB testing work.</p><p>Right. I think that's where a lot of people. Also struggle with, with people coming through. Okay. I wanted to do an AB test on this, a new landing page that we made, but okay. It's a new landing page. Is it live yet? No. So there's no perfect. Now can you please meet us at, uh, </p><p>Elise: [00:14:57] yeah, exactly. Um, but yeah, so I think that listening is kind of like that first, the first port of call, really, to understand, you know, both in terms of how you can improve things, um, for customers.</p><p>But also how you can improve your relationships with your colleagues as well, by understanding where they are in terms of understanding CRO, um, in terms of building that relationship and understanding how they communicate best visual or audibly or. Um, written, um, depending on how they've reached out to you in the first place.</p><p>Um, and also just kind of listening their concerns because you'll always come across a couple of colleagues who, you know, have major issues around testing and think it's a massive issue in terms of risk. Um, In which case if you've listened to their concerns properly and taken the time to not immediately get defensive around why we all know that testing is the least risky.</p><p>Um, you can take really when you're launching a new product or a new feature, but if you can listen to their concerns and it means that you can communicate the reasons why they're wrong back to them. Yeah. Um, but if you just talk over them or get defensive straight away, then you're never gonna. Have a proper conversation and you're continually going to, yeah, I agree.</p><p>Guido: [00:16:16] Argue with that, especially when you begin, uh, that a company that's, you're always new to them that I think like 30 or 40% of your time should probably go into internal communication to explain what you're doing and get them to understand how things work and </p><p>Elise: [00:16:32] completely, and I guess. Part of where my experience comes in because I am a contractor.</p><p>So I tend to change jobs every three to six months and go into a new business and have to go through this process. Um, from this whole soft skills is probably more relevant to people that do chop and change jobs a little more frequently than someone who is sort of set in, you know, a company like Amazon or booking.com where, you know, testing is already ingrained.</p><p>So, um, but those relationships are still really important to build. And I think listening is, is. The first step to that. Um, I also think it can be applied to your personal relationships as well. Like a lot of people just tend to talk over each other. Um, and we don't listen to each other enough, really, </p><p>Guido: [00:17:13] so more and more are listening for four year olds.</p><p>So the second point is communicating. I think we've. All right. I'll touch on that in the intro and just a bit, but, uh, any more tips on communicating? </p><p>Elise: [00:17:24] I'm not sure. I mean, again, it really depends on who you're communicating with. Obviously stakeholders are going to be vital for getting sign off, in which case, working out.</p><p>How that particular stakeholder prefers to communicate is going to be really important. Um, but then also if you're working with engineers, for example, some engineers are not, um, people, persons at all, you know, they, they like being behind their screen. In which case you can almost. Automatically assume that grabbing them for a coffee, um, or, you know, having a video chat like this and these particular circumstances, um, is not going to be the best way to communicate.</p><p>So you need to make sure that you're writing emails, which. Contain all of the details that they need, </p><p>Guido: [00:18:09] do them through JIRA tickets or, or get comments, </p><p>Elise: [00:18:12] right. That's exactly it. Exactly it, and be succinct as well. Like don't, don't ramble on. Um, I was, uh, I was actually having a conversation with, um, some colleagues two days ago around the European style of communicating versus the British style.</p><p>Um, And in Britain, we're very kind of, Hey, how are you? How was your week? Um, whereas, uh, in my experience, you correct me if I'm wrong. Um, I love the European style of just, you know, hi, this is what I need. Yesterday's brainstorm was so good. I really liked step's idea of running that test on the call to action buttons, making them orange will really make them stand out.</p><p>Don't you think? </p><p>Guido: [00:18:52] Yeah, right. We want to design real AB test winners and achieve enormous conversion uplift. Then stop, brainstorming, and take a scientific approach. If you can read Dutch follow the steps that online influence the bestseller or even book Dalton out and rule in the office course and become an expert in applying proven behavioral signs yourself.</p><p>Go to &nbsp;dot com for more information and free notes. I remember working for 'em or hearing a story. Uh, it happened before I joined the company, but they, there was a Swedish company and they took over a company in the UK and they were quite offended by the sweets just saying hi, and, uh, and this and this, and this is what I need while the UK will prefer saying, Hey, hello, how are you?</p><p>Elise: [00:19:39] Yeah, they do. Do we do all of the niceties? I actually much prefer the European style. I'm like, no, no, no, this is what I need from you. This is what I'm telling you. Just get on with it. You know, I'll catch up with you at the pub or, you know, we'll have drinks on a Friday or whatever, and then I'll make nice.</p><p>But right now I need, I need to do work. I need to get stuff done. Exactly. </p><p>Guido: [00:19:59] So, so what I'm hearing is, is, is mainly beef be flexible in how you communicate. This is not a one size fits all. I really tailor it to the person or a group of people that you are a communicator. </p><p>Elise: [00:20:09] Exactly. That's exactly it. Um, and don't get me wrong.</p><p>It's not easy at all. Like I said, I'm, I'm much more of a, a writer and a reader than I am a talker. Um, this is something I've had to work on over the last couple of years. You know, the first time I gave a presentation, I, I was so nervous. I was so scared. Um, But if everything went fine, you know, and I was presenting to absorb the information.</p><p>If they didn't absorb the information, then I made sure I sent a nice email at the end, with a followup to explain why covered. Um, you're completely right. Being flexible in your communication styles. I think. It's really, really key. </p><p>Guido: [00:20:45] I actually heard a, saw a comment from someone on a, on LinkedIn or post actually from someone that said, uh, that he has been, uh, working as, as off to, to, to actually tailor the communication, uh, to this.</p><p>This was specifically. Uh, about the results of experiments and sharing that with the company. And he stated that previously that's, uh, to the specific group person that he was communicating with anything that, well, last week I changed it, I just sent one template to everyone and no one complains. So my, my first comment was.</p><p>Are you sure that the people are reading? I don't want to, I don't want to be an asshole, but is anyone reading it? </p><p>Elise: [00:21:26] Yeah, you're completely right. And it could be that no one complained because you know, they looked at it and went, Oh, I don't, I don't really understand it, you know? And they didn't want to ask the question.</p><p>Um, which again, I think is where that communication style really opens up those relationships. If you've already proven yourself to be open to communicating. In the way that the other person prefers. If you're already listening to them and actively listening to them, then they will feel more open to and approach you with test ideas or with questions.</p><p>Um, that's, that's the thing I love most about my job is when people come and ask me questions, because I know that they're engaged. Yeah. I know that I've already to build that relationship. If no, one's asking me questions, I'm thinking, what have I done wrong? Um, what, what are they not getting? Because.</p><p>Nope, no one understands everything. I tell them the first time around, I wouldn't expect them to, you know, I've got sort of almost eight years experience working in CRO. I wouldn't expect to be able to convey eight years worth of experience to a person in an hour's presentation. I would expect them to come to me with questions and if they don't have questions, then I've done something wrong.</p><p>Guido: [00:22:32] Well, what I usually try to do when I'm there, there's usually a, of course, some communication going on between different departments and Shiro. It's often situated within digital marketing. Uh, but you might have communication with, uh, sales or with, uh, customer success or customer service or whatever the name is.</p><p>And usually those departments have different goals than your department. Uh, so it really helps to get an understanding what it is, is the goal of the service department or the sales department. What are their KPIs for, for this quarter or this year, if you can frame your results, uh, in those KPIs in, in that context for them.</p><p>Uh, it makes much more sense than when you just send them a report. Okay. We increase the KPIs for eCommerce, but yeah, they don't. </p><p>Elise: [00:23:20] Yeah. Yeah. And that might not be relevant to them. </p><p>Guido: [00:23:22] It's not their KPIs. </p><p>Elise: [00:23:24] It's really interesting. You bring that up while you actually also wrote an article on where CRO should sit.</p><p>Um, and I think, again, this is why communication is so important because I've seen CRO. Sits within their own team. So sort of completely dedicated. Yeah. I've seen them sit in analytics, product marketing engineering. And the hard thing about working in CRO is that you have to have relationships with people from all of those teams.</p><p>It doesn't matter where the CRO team or person is positioned within a business hierarchy. It doesn't matter at all. What matters is that that person or team has a relationship with all of these other teams? Because everything overlaps and </p><p>Guido: [00:24:03] it matters in the end of the, at the end of the year, when you need to explain your KPIs and then it really matters which departments you fall.</p><p>Elise: [00:24:12] Yeah. No, that is true. I mean, who's, who's budget the paycheck coming out for sure. But from, from like a relationship point of view and from a soft skills point of view. Yeah. I don't think it doesn't matter at all. It's it's about those relationships that you build. Um, As, as a CRO specialist. </p><p>Guido: [00:24:29] Yeah, it's funny.</p><p>I, um, uh, I often feel more, most comfortable if it's, if it falls within product, uh, somehow. Um, and then I was also talking to a company, uh, last week and they were looking for, um, uh, growth product lead and. Uh, they had no ID. Why Sierra would be relevant there. </p><p>Elise: [00:24:53] Oh, dear. </p><p>Guido: [00:24:54] I'm like, but that's okay. I think if I'm reading the job description that they had for it, there was exactly, it sounded like CRO.</p><p>It sounded like, but just because it was not onsite on the website, they thought it was completely irrelevant. Oh gosh. That's weird to, uh, to, to have those conversations and then you. Um, experienced that the communication or, or the, the knowledge gap that there can be at some companies. </p><p>Elise: [00:25:20] Yeah, definitely.</p><p>And then obviously someone goes in and. Shows them the importance of CRO and product and that relationship. And they go, gosh, we totally missed the boat on that. We've got like completely. Yeah. </p><p>Guido: [00:25:30] Yeah. But they, they even got the experimentation in there, so I'm like, okay. But it's very similar. </p><p>Elise: [00:25:37] Oh, wow. </p><p>Guido: [00:25:37] So let's, let's go through to your, uh, third point, which is being, </p><p>Elise: [00:25:43] yeah.</p><p>I'm actually talking about product. This works in quite well. Um, cause uh, obviously a lot of, a lot of products, um, Product manager's job is, uh, managing essentially we all manage it sort of the process of a product being researched and developed and built. Um, and I think CRO does also require a substantial amount of organizational skills as well.</p><p>Um, Not, maybe not quite to the same level as, as project or product manager. Um, I've, I've done some project management in, in my past and I have a big props, lots of respects to project managers. Um, it's not for me. Uh, I'm very much a, um, I like being active. I like producing things and creating things myself.</p><p>Um, and I find that with project management, there's an awful lot of chasing other people. To do stuff, uh, which I, I sometimes get a bit frustrated with. So </p><p>Guido: [00:26:36] it's basically the job. Yeah. </p><p>Elise: [00:26:38] Yeah. So I have a lot of respect for the people that do project management. Um, for sure, but with CRA I, I believe that you still need to be very organized.</p><p>Um, In order to just to manage any kind of CRO or experimentation roadmap. And even if you're working within a team, um, and maybe you're not in charge of the full sale roadmap because things change and it's the so quickly within experimentation. Um, You know, you might be working on, you might be focusing on UX and doing some research into one part of a website, as well as, you know, another part of a website and trying to submit results, or like do some analysis that requires a certain level of organization to understand what you need to prioritize and what you need to report on first and where your time should be spent.</p><p>Guido: [00:27:23] So, so how do you do this when you, when you start at a company? Uh, you said you often come in as the first one, uh, breaking over for new eight, four, four news, zero people a to B and then get them, uh, up and running. But, uh, even though there's a blank slate, uh, zero wise or experimentation wise, There are real, already structures in place.</p><p>They might already be using a JIRA or Trello or Google sheets. So how do you get started? How do you, uh, get them, uh, on board with using, uh, documentation? </p><p>Elise: [00:27:58] It's a really good question. And actually mentioning all of those tools is key. I, I prefer to try and use a tool that they're already familiar with. Um, you know, if part of the team already using JIRA, then I'll be flexible and turn around and say, yep.</p><p>Okay. We can. You can stick all of our AB tests in the backlog, into JIRA and we'll have a JIRA. Right. Um, or, you know, if, if they're using Trello then fine. If there's nothing in place at all, then I might simply start with a Google sheets because it's less overwhelming for them to learn a brand new tool and a new process.</p><p>If all they have to do is look at what is essentially an Excel spreadsheet. You know, most people are familiar with that. Um, And in terms of kind of getting that organization, that process in place, a lot of that has to do with the education piece when you're first trying to get everyone up to speed with what AB testing is.</p><p>Um, Part of that is talking about the process. You know, you need to have a backlog of ideas, need to be evidence-based in is prioritize them and decide what you're going to run fast. And then ideally you want to put together a roadmap, um, so that you know what you're going to be running and what you're going to be running lost in the news reporting on it.</p><p>So, and I think all of this plays into being organized is them understanding what. What process should roughly look like? Um, and there's no perfect process, right? You know, every business has something slightly different that works for them. And that doesn't, but starting off with the basics there's is a good way to start.</p><p>I think </p><p>Guido: [00:29:23] marketing mergers have suffered and the sheriff AB testing has been impacted too. If you want to keep testing to enterprise standards, but save 80% on your annual contract, you can consider it. Oh, fertile to go, but there's summer release. You can take advantage of full stack and hybrid features, strong privacy compliance, no blink and enterprise.</p><p>Great security. Feel good about your smart business decision infest, what you save, backing your CRO program. Check out www adults over the phone slash 2020. Yeah, reusing the, or utilizing the tools that they already have. Uh, I think that's, that's definitely always my strategy because the hardest part is getting people to switch tools.</p><p>So, and it really depends on their maturity. And if you're just starting out, it doesn't make sense to, um, uh, to introduce a new tool, uh, unless they're, they're really, uh, bought into the whole idea. And everyone wants to, uh, has the time. Weekly or maybe even daily to use such a tool and get familiar with it.</p><p>Does it make sense to, to start learning a new tool? I love using like effective experiments. I really love the tool. Uh, it really takes away a lot of the communication you need to do as a, as a CRO, a manager, uh, getting everyone on board. It just does that for you. But if no one is using the tool, because they're not familiar with it, they find it too complicated.</p><p>Everyone's in, in, in JIRA or trout all day. Anyway. Uh, it's, it's really hard to make people. Change in general, but </p><p>Elise: [00:30:59] definitely no, I'd completely agree. I really like effective experiments as well, but most of the time I go in as, as a one woman band. And, you know, if I try and force a tool like that on a team, a lot of the time they kind of go, but we don't.</p><p>We're not redoing the CRO. You're here to do the CRO and then we're going to have a replacement come in to take over from you. Um, we don't want a whole new tool, you know, we'd much rather everything connected up. We're using JIRA and our engineers are using JIRA. Then that means all of the engineers conceived documentation.</p><p>And it's sometimes </p><p>Guido: [00:31:32] perfect. Of course. I'm I get really frustrated with JIRA though. Brett two effects. I wish for effective experiments daily F I use for that. But, uh, yeah. Then the, then the frustration is it's something you need to take in for at least, uh, um, the start of such a, </p><p>Elise: [00:31:48] yeah. I feel like if you force the tool upon someone or if you.</p><p>Really try and force a very strict process upon a company. Then they're never going to continue. They're never going to carry on with it. The whole thing will be a failure. Um, you really need to try and work with what they're familiar with and try and understand what is accomplishable. Um, within that particular business is it's very much a per business or per company.</p><p>Um, Situation really. </p><p>Guido: [00:32:15] And it's a particular, um, uh, tips for your mind to have to organize the results of experiments. </p><p>Elise: [00:32:21] Keep everything together if possible. So for example, if you're using something like JIRA or Trello, um, then make sure that your. Putting all of the results, even if it's a slide deck, a lot of my results, I tend to put into, um, a presentation slide.</p><p>Uh, so that again, I can address the different communication styles where I can write out a paragraph. This is the results I can also graph, and I can include a screenshot of what was tested. Um, So it's nice and nice and accommodating for all those different communication styles, but I make sure that that goes in with the Gera ticket.</p><p>I'm also, I'm a big fan of numbering, all of your experiments, um, sort of in the backlog, in whatever, uh, Organizational tool you're using making sure you've got like that. And then whatever testing tool you're using, make sure that the number is the same across all of those experiments. Um, it's quite fun.</p><p>Now I'm working with some teams to sort of turn around and go, well, how are you getting on with, you know, CRO 67. Um, and we all know what we're talking about in fact, but one of the companies I used to work for, we had an ongoing tickets, uh, which was within our, um, Within our JIRA board for all of the experimentation we were running and it was something like, it was something like CRO one, two, three, and we'd have stand up every week.</p><p>And we'd say, Oh, Sam how's CRH one, two, three, coming on. It had nothing to do with testing. It was trying to get him to quit smoking. Um, so it meant we didn't have to ask him how he's getting on we're quitting smoking. We just get how CRA one, two, three, um, see if it. Yeah, exactly. Yeah. He'd always say it was blocked.</p><p>It's blocked right now. </p><p>Guido: [00:33:58] Nice. So we, we need to listen. We need to communicate. We need to stay organized. Uh, and we also need to be flexible. Uh, so what do you mean? </p><p>Elise: [00:34:08] I mean, we've talked, we've used the word flexible quite a lot in everything we've already covered. So being flexible around communication styles, being flexible around what tools and processes you try and put into a company.</p><p>Um, But I also moved flexible in the sense that, you know, we've just talked about putting together a roadmap and putting together a plan for testing. Um, however plan, like things never go to plan, right? I'm I'm seven months pregnant and I'm being told to put together a birth plan, knowing full well that.</p><p>That probably won't happen. It won't go according to plan. Um, it's yeah, it's fine. I'm going to have to be flexible about it. Um, I do the same thing with, with my roadmaps, with my experimentations. You've gotta be flexible because, </p><p>Guido: [00:34:48] but you have to have a baseline. </p><p>Elise: [00:34:50] Yes. Yeah. It seems good to have a plan. So you've got, you know, roughly what you want to accomplish, but business requirements change last minute campaigns suddenly come up because someone forgot to tell you that this was happening.</p><p>Um, you know, we have, uh, twice weekly releases where the website might change something which might affect the test that's that's running. Um, the whole idea is that you almost need to plan for those instructions. Now, um, a lot of my testing roadmaps do tend to include a little bit of. A breathing space almost, uh, for those last minute things that can come up.</p><p>So there's that aspect of flexibility in terms of the actual running of experiments. Um, but again, I think it's also about being flexible with colleagues around test hypotheses that they might have come up with and you sit down and you have a chat with them, and you realize that that hypothesis is complete nonsense maybe, but you can see where they've come from.</p><p>With the idea or with the problem. So you need to be a bit flexible in terms of getting them to think about it in a different way, or, you know, rewriting or reworking that hypothesis, or thinking a bit more around what their KPIs are. </p><p>Guido: [00:35:58] That's, that's a, that's a struggle in the beginning, right? If you start out and they are enthusiastic, but come to you with stuff you think, well, no, but you do want to give them enthusiastic about it.</p><p>You do want to get them. Keep that man full in all of this. So like you just said, you don't want to put them down right away and demotivate them. So there's a fine balance. </p><p>Elise: [00:36:21] It's a really difficult line to draw because you don't want to you're right. You don't want to turn around and say, no, that's, that's not gonna work.</p><p>Um, cause you do want to keep them engaged, which is why, again, it comes back to listening. You need to listen to them and understand how they've come across this particular hypothesis so that you can then sit down and go, alright, I understand that. That's the problem that you've witnessed. Maybe you've seen a user recording or your mum spoke to you at the weekend and said, Oh, I think you could improve the website by doing this.</p><p>You know, that's someone who's experienced a problem, but we need a bit more evidence or we need to work out how we can actually, um, measure that. The thing that we're changing has improved, um, You know, it's, it's around being flexible with a colleague to try and encourage them to think a bit differently about the hypothesis.</p><p>They've come to </p><p>Guido: [00:37:11] the skill. I need to work on that. Not necessarily in a situation where, uh, starting a new company and introducing people to Shiro, but I do often very often feel like the bath cope at meetings where people talk about numbers in analytics or not necessarily experiments. And I'm like, Uh, that that's not what those numbers mean.</p><p>Uh, th th there are a lot of conclusions drawn and then there's me the only one being in the room saying, well, </p><p>Elise: [00:37:38] yeah, yeah, but I mean, there's, again, there's a really fine line between, especially when you're looking at things like data where, uh, it can be interpreted in certain ways. And I think we'll probably cover this a little bit later, but, um, You don't want to fudge the numbers, you know, that there's still a right way and a wrong way.</p><p>Um, and if what they're doing is wrong or completely out there, then, um, you, you don't need to be fixed. He can turn around and go. We'll actually, you know, we have this evidence and all of that, this experience to say that what you're telling me is incorrect, um, which isn't necessarily. Flexible. Um, in fact it's the opposite of being flexible, but you need to understand you're needing to sort of work on when is the best time to be flexible.</p><p>And when you should </p><p>Guido: [00:38:21] fights back office a worldwide unique AB testing, personalization and product recommendation solution. So I spread the works to service sites without any tags or scripts, which guarantees an ultimate performance, the SiteSpect solution eliminates delays and the chance of any flickering effects.</p><p>And this approach also ensures that the current and future browser skirts your rules like ITP and don't make an impact on your AB testing and personalization with more info visit &nbsp;dot com. Yeah. For example, that when people are. Uh, either really sad or really happy with the results from a, from a certain day or we, we score 10% of the ball, uh, budget or attempts and below budget, and there's really good or really bad and like, okay.</p><p>But your standard deviation is like 50 bucks. </p><p>Elise: [00:39:12] Yeah, yeah. </p><p>Guido: [00:39:13] Or maybe even 5%, but still within the range of expected things. So it's not necessarily. Yeah. </p><p>Elise: [00:39:21] Why, why are you celebrating? Like, no, just celebrate right now. </p><p>Guido: [00:39:24] Yeah. Or it can also be positive, right? So you don't have to feel bad. It's not exceptionally bad.</p><p>It's just 10% less than expected, but it's within the expected range. </p><p>Elise: [00:39:34] It's within the expected range. Let's see what happens over the next couple of days, but yeah, flexibility. I think, um, I think I also mentioned in my article around, obviously I used to be a developer. Um, so. Knowing what can, and can't be tested.</p><p>Uh, sometimes someone might come to you with this great idea and you're like, Oh, that's, that's fantastic. And then you sit down and you start to develop it, or you start to code it or T shirt size it, Nicole, actually, uh, it's, it's not technically possible for us to do that. So you have to be a bit flexible in the term in the sense of how do we make this test work?</p><p>Because we could still have a lot of learnings. I think that's where, um, things like fake door test come in, where you, um, You sort of create a link to a new feature, which doesn't actually exist yet. Um, and you kind of go, well, we don't have the capacity or we can't build out the whole feature right now.</p><p>We just want to see if it's, if it's viable or not. Um, that's a good way to be flexible in terms of actually building experiments. </p><p>Guido: [00:40:30] Do you want on the subscription to our surface click here and then, Oh, we haven't built this yet, but, um, yeah. Great to know your interested. </p><p>Elise: [00:40:37] Exactly. Exactly. That's that's a good way to be flexible.</p><p>I think </p><p>Guido: [00:40:40] number five, I think that this is almost a, at the, at the core of, of being a CRO, a practitioner is being curious. </p><p>Elise: [00:40:47] Yeah, for sure. Um, And I'm like, is curious T genuinely a soft skill. I think I remember when I started writing the article, I was like, when I call</p><p>‍</p>",
  "show_notes": "<ul><li><a href=\"https://medium.com/@angelfish2222/cro-soft-skills-1476a6da9fa8\" target=\"_blank\">CRO Soft Skills</a> by Elise Maile on Medium</li><li><a href=\"https://cxl.com/blog/2019-conversion-optimization-report/\" target=\"_blank\">CXL state of optimization report 2019</a></li></ul>",
  "guests": [
    {
      "id": "elise-maile",
      "name": "elise-maile",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/the-6-soft-skills-that-cros-need-to-master.jpeg",
  "language": "en",
  "type": "podcast"
}