{
  "id": "unleash-your-primal-brain",
  "title": "Unleash Your Primal Brain",
  "description": "Let's demystify how we think and why we act with the authority in evolutionary psychology and digital marketing: Tim Ash.",
  "date": "2025-01-08T20:07:07.493Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/282f1c22/5144faa6.mp3",
  "transcript_url": "<p>Guido: [00:00:00] When you're in the internet business for so long as you have, I think you have a lot of. Interesting stories and knowledge to share with us 25 years in CRI I don't think it's called zero back then. </p><p>Tim: [00:03:05] No, I coined the help coin, the term landing page optimization and conversion rate optimization and some of your European colleagues.</p><p>Yeah. I started calling it CRO, which I violently hate, but okay. That's another </p><p>Guido: [00:03:16] topic, not a topic. And w with all that experience and you've been in this doing this for so long. Why are you still doing it? What is your passion for this field of work? </p><p>Tim: [00:03:27] It's such a fascinating topic, I guess I'm come full circle and I made a career out of technology and learning that didn't exist when I attended the university of California.</p><p>San Diego. I studied computer engineering and cognitive science, which was in the psych department at the time and is now its own department. And so I've always had an interest in cognition. I stayed there for graduate school for my PhD work for seven years in what would now be called neural networks or machine learning, deep learning AI.</p><p>So that was teaching computers to learn by example. So it's always been my passion to understand how people think, how we make decisions. And in a way, the applying that to internet marketing and specifically influencing people when they come to your website, that's the perfect application for it.</p><p>It's this blend of art and science. Everything is infinitely measurable, but at the same time, the principles that influence people are based on psychology. And so I've been exploring the human brain, my </p><p>Guido: [00:04:27] whole career. And so I also have a background in psychology. I don't know how your experience at it.</p><p>But at least here, when I studied it it had nothing to do with align. So maybe your combination with computer science was, it was a bit more focused on that but how did you make that transition? &nbsp;From being doing this stuff offline to online, </p><p>Tim: [00:04:49] , my first jobs were more on the technical side, so they were programming and there worked for big companies and I realized what a soul killing environment that was.</p><p>And I said, this isn't really for me. So in my late twenties, I. I was 29. I quit the PhD program seven years into it, and I started my first business. So I actually got an office space about 200 square meters and a desk and a phone and an internet connection. And then I called up my girlfriend at the time.</p><p>I said, Hey, I'm running around my office naked and sitting at my desk because I can it's my business. So it was really just that entrepreneurial. I'm going to do my thing. And that happened to be in 1995. Right when, the early.com days. &nbsp;It was, it's been a pretty exciting ride. I've seen </p><p>Guido: [00:05:33] the whole thing.</p><p>Talking about that you, there's not your first book that you've written you've already written two other books on landing page optimization. So what were your takeaways from the process? And the writing and the marketing of book one and two. And what did you take take with you to this book?</p><p>Tim: [00:05:52] Yeah, so the original book I wrote was the first edition of landing page optimization, and that was followed up about four years later with the second edition. And this is expanded. This was written with my friends and colleagues rich page and Morgan tees who are super smart and really helped make the second edition.</p><p>Fantastic. And then it's been translated into several languages. There's the German Brazilian Portuguese. I think this is Korean. I'm not sure. I'm pretty sure it's Korean and then Chinese, but my favorites are the Polish Eastern European additions. This one cracked me up. This is my book in Russian, which is my native language.</p><p>I was born in Moscow and I never wrote or heard of it. So it's really trippy to see it that way. But the, to your question writing a book is a huge undertaking. As you probably know you've talked to some authors before each one of those books took two years of my life and that's a big price to pay, especially when you're doing other things, running an agency in my case, raising little kids.</p><p>So you have to really want to give birth to a book. In fact, I joke that's the closest a man will ever come to giving birth. It's a long drawn out. Painful process. It's a bloody mess by the time you're all done. And then the real work begins just like raising a kid, you have to promote the book and so on.</p><p>And then that work never </p><p>Guido: [00:07:15] ends. Yeah. Most authors tell me that. They also say, it must be a very fulfilling thing to do out of your own interest and motivation because. &nbsp;You shouldn't for one, do it for the money. Maybe if you were a New York times bestseller, but otherwise it should really come from the spinoff of the book, but the book itself is not something that you aren't money with.</p><p>Tim: [00:07:35] Yeah. Mine was actually fairly successful. It'd be just the two U S edition sold 50,000 copies, which is a huge hit, especially in an applied like a B2B book. So it's for marketing practitioners. How many of us are there out there? In fact I've had people tell me. Yeah. Or blame me. I always joke, &nbsp;that their career in CRO started by reading my book.</p><p>And I said, don't blame me for your poor career choices. So there is some gratification, but it's a solo activity. Yeah. You have to, you're isolated, you're writing you're in your head. And then maybe a year or two later, someone says, I loved your book, so you get this sporadic. Feedback that's delayed.</p><p>So it's not like keynote speaking, which from the badge wall, you can see, I do a little bit of over the years where you get immediate feedback from the audience with books it's really a solitary activity, writing a </p><p>Guido: [00:08:24] book. Then once it's done, of course you can have a revisions, but that's, it's relatively static compared to when you're talking to an audience and you can adopt.</p><p>While </p><p>Tim: [00:08:33] doing your thoughts on the second to second based on their reactions. Yeah, that's true. </p><p>Guido: [00:08:36] Yeah, of course. We're going to talk about your book, but my last question, before we do that so in, in those 25 years how are we doing with Shiro right now? How do you see </p><p>Tim: [00:08:48] Our, I, you know what, I'm not optimistic because I've seen, generational change.</p><p>I'm a gen X-er and millennials have come along. Now there's gen Z kids coming into the workforce and I see the same kind of mistakes being made on websites. You know what I had this whole chapter, your baby is ugly about the seven deadly sins of websites, and those are still endemic. Those same problems of, visual distractions, not enough trust.</p><p>Not keeping your promises unclear calls to action. &nbsp;They're everywhere. It's not that hard for any of us in the CRO industry. It'll take a look at any website and say it sucks. And here's why, and you don't even need the test. A lot of that stuff just fix it. So we're still there because there's always new people cycling into the industry and the experience of the of the more experienced people.</p><p>Aren't really the ones designing the experiences. It's usually someone new. And until they learn to really care about the user experience and about their putting the priorities of their visitors first that won't change. And that takes a lot of, time and psychological shift to take on that perspective.</p><p>Guido: [00:09:56] Ah, we've proven ourselves enough or as a field, as </p><p>Tim: [00:10:00] heroes or. &nbsp;The, I don't think so. I think that the problem with CRO As an industry. So in terms of the world out there, have we made it better at yeah, maybe few websites, but there's still plenty of ugly babies, as I like to say out there, really dysfunctional websites.</p><p>And so as long as there are websites and that's an important caveat that will probably continue. So good news. We all have job security. Yeah, but eventually won't be websites. It'll be holograms implanted in your skull, or it will be voice or a mobile app or in an app experience on mobile rather, which is not really a website.</p><p>So I guess there, from the broader perspective of our websites better, no, they're not from the perspective of. The industry, I would say the big problem is we're too tools focused. &nbsp;We pay lip service to being user-focused, but we're technology focused and we need to be data-driven and my hypothesis is this.</p><p>If I hear the word hypothesis, one more time, I'm going to lose my lunch. We were trying to make it all scientific and stuff. The bottom line is. You get good ideas for improving websites and you have to make sure they didn't screw things up and make them worse. That's legitimate. But my problem is that there are all these tool companies that have been beating the drum of AB split testing.</p><p>Test this test, this, you should test everything. I've actually had people tell me that really the font in your footer make it readable. You don't need the test. Changing it from eight point the 10 point font, just do it. And so this over-reliance, I would say on quantitative testing everything has to be tested, I think is actually a disservice.</p><p>And so we're seeing as little technicians that are fiddling around with stuff and making tactical changes mostly on single pages. And a lot of the more powerful tools, what I did with my agency site tuners. You have to have a strategic perspective. Sometimes you have to redesign a whole website.</p><p>Sometimes you have to add a personalization layer. Sometimes you have to fix all of your email communications. Sometimes you have to train your customer service people to sell better. On the phone. We did a training for one client trained about 60 of their phone reps. Website sales stayed the same phone sales jumped up 15%.</p><p>That was, we made a millions of dollars with a one week training. So I look at it more like a McKinsey or a high-end consultancy would attack it, which is very strategic and not just this kind of stay in your swim lane and just do your look. </p><p>Guido: [00:12:36] Yes. It feels a bit because we're designing. Those interfaces Omar computer.</p><p>And we don't see, we don't experience how our customer uses it. I think that's an inherent problem or the way we design those things that's inherent to our business, but it's also disconnects us from who we actually designing it for. We're not standing in a store, like it like a sales man in the store. We don't have that immediate feedback again. </p><p>Tim: [00:13:02] Yeah. And &nbsp;it's funny because Ben and Carl, my friends In the UK, they are big advocates for walking a mile or kilometer since they're in the UK, in their visitor's shoes. &nbsp;Think Carl tells the story of they ordered a garden shed and he not only ordered it, he put it together himself and then tried to call customer support for help and stuff like that.</p><p>So how often do we do that? As marketers? We're sitting there talking about my row as is this and this keyword groups performing well and, I'm at 95% significance in this kind of bullshit and we're talking to each other and we never actually talked to the end users of our product or service.</p><p>We should be out there in the field. I think everyone at a larger company should be in customer service at least once a quarter taking phone calls and seeing what's actually happening with their customers. So there's definitely not enough of that. We're in our own little echo chamber.</p><p>Guido: [00:14:23] In the book unleash your primal brain. I actually, I finished at the half an hour ago actually. So I'd actually more out of interest. You did the audio book yourself too which is not but I really love when authors do that, it really gives a different dimension to the book. When it's read by the person that actually wrote a thing that sort of audio books, I think five hours, 16 minutes.</p><p>How long does it take to record something like </p><p>Tim: [00:14:52] that? Oh, yeah, that's a great question. I had to learn it all myself. I decided to do it myself for a couple of reasons. One is apparently for nonfiction, that's actually preferred that the author recorded. It's a selling point with big deal, but also I am an international keynote speaker, so maybe I know how to present and communicate just the thought.</p><p>I I studied everything from how to record it, what software to use, how to clean it up and make it okay for audible and other platforms. And I did all of that myself. It was really fun. I built my own sound isolation booth in my office, out of moving blankets and PVC pipe to cancel all the room echo and basically they say about three hours of total time for one hour finished recorded.</p><p>Now I have to mess around and learn platforms and stuff. But yeah, actually I was under that probably about it's about an hour and a half of editing for me for every hour of finished. That's not too bad. No, it's not too bad. You take out the ohms and ums and the breath sounds you can't put like, Oh, you can't do that on.</p><p>Yeah, exactly. </p><p>Guido: [00:15:59] Nice. So let's get into the book. W what stood out for me, a large part of the book is actually a boss. The evolution &nbsp;and brain biology. &nbsp;And I was wondering, so very recognizable first off from of course studying psychology myself. But I am wondering, so knowing things like like how neurotransmitters work how does that help a regular human being to get insights into their behavior or their in customer's behavior?</p><p>Tim: [00:16:30] Yeah to be clear, the book is not written specifically for marketers. It's not a neuro marketing book, although I, if you read through it, what it is, and in the audio book I use kind of audio call-outs, but throughout the book, there are these call-outs and there are a couple of hundred plus of them and they're the main points.</p><p>And if you pause on each one of those and consider, how does this apply to neuro marketing or marketing more broadly, you could read the book with that prism. But the book is really the basic operating for human beings. It's retracing the arc of evolution from earliest life on earth to what makes us bizarrely and distinctly human.</p><p>And it's saying we picked up stuff along the way, what works is still there and let's figure out, which part of the brain is actually acting in a certain situation. So it's, you can use it for business leadership, persuasion, marketing sales, you can use it for personal relationships and. Culture building and organizational psychology.</p><p>You can use it for personal development, sleep memory. What makes us happy, whether it makes sense to chase happiness in the first place. So it's really what all 8 billion of us on the planet have in common. It's not an applied. Book stay tuned. I may write eventually in the same series, primal brain marketing, primal brain leadership, primal brain personal improvement.</p><p>So those would be layered on applied books, but this one is the why behind our evolutionary psychology. Yeah. </p><p>Guido: [00:17:53] It feels especially as a, as someone interested in this topic, it feels like a like a history book almost of collecting all those bits and pieces of how the brain evolves. And how it worked out.</p><p>So it does really well. </p><p>Tim: [00:18:06] Yeah. Thank you. I, to be really approachable, there is an a book and a TV series in the U S many years ago by Carl Sagan called cosmos. It was like the Neil deGrasse Tyson, one Dido, if you will, and billions of stars, and he would make astrophysics fun for the common person.</p><p>And a lot of people were turned on by it. And so this is my attempt to do the same thing for how our brains really work. I'm trying to make it accessible to everyone. My problem was that there are a lot of specialist books and most of them were unreadable. Everybody talks about condiments work.</p><p>For example, thinking fast and slow. That's that book's about a thousand pages and I wouldn't wish it on anyone. It's it's an important book. Therefore, you should read it, but it, it's written by a researcher and he's not a good writer and neither a lot of the other people.</p><p>So there's all these perspectives, </p><p>Guido: [00:18:56] like I said, in the book &nbsp;it's being human one Oh one or how the brain works. One-on-one I think it's will be also for. Obviously for the general public, but also I think for students doing this or cognitive sciences, it will be a great starting points </p><p>Tim: [00:19:11] To and you ask how this applies to marketing.</p><p>So to return to that question I think that anybody that is in marketing, it doesn't understand what they're trying to influence, which is the human brain is at a huge disadvantage. So we're thinking about. Twitter this and, &nbsp;retargeting that. And it's again, mostly technology-based and you really, if you want to have a durable career as a marketer, we don't care online, offline, you have to understand what you're trying to influence and that's the human brain.</p><p>So that, to me, this is foundational </p><p>Guido: [00:19:41] stuff. Yeah. Often what I see going wrong with what, when people talk about children, for example the book is fine. And the theories are fine, but it's not as random. It feels sometimes it feels a bit random just to just, okay, we need to do social proof or we need to do at the uncertainty or at scarcity or whatever.</p><p>And it's not fair for us to figure out where the issue is where people are getting stuck and could be because of their behaviors, how the brain works and then apply something that's compensated for that. We'll fix that. </p><p>Tim: [00:20:14] Yes. And I think that's another issue I have is from the behavioral economics side or the neuro marketing side.</p><p>There's all these like tips and tricks and wheels of persuasion. And here's a thousand tactics you can use to basically manipulate me. But there's no. Common through line through any of it. And so I'm trying to explain the why and say, this is a result of evolution and there's many different layers to it.</p><p>So it's an ambitious book in the sense that it, like you said, covered neurochemistry sleep, memory, learning, language, culture, gender differences are highly social natures. But you kinda need to retrace that whole arc to see. What, where those unconscious shortcuts are coming from, which stage of evolution is really impacting that or causing it if you will.</p><p>Yeah. Then it becomes much more coherent instead of just a bunch of tactics. </p><p>Guido: [00:21:08] Exactly. Yeah. And yeah, it doesn't, there's no shortage of tactics in our field. </p><p>Tim: [00:21:15] No, everyone's got a blog post with the top 10 ways to manipulate </p><p>Guido: [00:21:19] people. You mentioned the economy. When we talk about the primal brain w would it be similar to Conoman system one?</p><p>Tim: [00:21:29] Yeah. And again, making a technical, but the way that I look at it, there's the reasoning brain, the neocortex, the one that has access to language. And would you consider conscious thought? But most of your life is on autopilot. There's massive amounts of information coming at you every second, just even right now, you're listening to me.</p><p>You're feeling the pressure of the chair on your butt. The relationship of all of your joints and space, which is why when you eat something, you don't stick the fork in your head by accident, right? There's all this information coming in at 99.999%. That is ignored because it doesn't have survival value.</p><p>But it's happening automatically. That process never stops. It never gets tired. Contrast that with conscious thought, asking for our conscious attention is really hard as a marketer because the scarce resource and we conserve it and we get tired later in the day and we don't make good decisions. So all of that conscious stuff is a completely different thing.</p><p>And people think that. Rationality is the ultimate human thing, right? Oh, if we could only take those irrational passions and emotions, then we'd all be like Mr. Spock and making perfect decisions. That's actually not a good view of humanity. 95% of what we're doing is subconscious. And so let's understand that part </p><p>Guido: [00:22:49] better.</p><p>Yeah. And it doesn't necessarily have to be better to make a logical decision. Those emotions. I have served those as well. They are there for a reason. You basically all your parents, your grandparents, and the whole lineage that you have, they survived because they have had those instincts.</p><p>Tim: [00:23:05] For billions of years. In fact, you said, instead of making a logical decision there, let me be super clear. There is no such thing as a logical decision. I mean that literally there've been brain damaged. People had certain parts of their brain disconnected or not working. And what we found from the neurosciences that you can't make a logical decision.</p><p>The emotions are what the side. So logic gives you options. Here's 50 things you could do right now. And emotion quickly and says, okay, these are the ones that matter. I either hate this or I love it. I've have a strong emotion. And that's how decisions get made. There's literally no such thing as a logical decision.</p><p>Guido: [00:23:45] Yeah, exactly. And one thing that I also really liked how you mentioned that the new book is that basically after you're born. &nbsp;You still need to download besides all the physical learning, not to stick your fork in your head. Although my two year old still, I still doubt that you also need to download all the cultural values and that's a really important part of of being human, it takes roughly 20 years to fully do that. &nbsp;And despite having all the, these underlying shared biology that cultural part is really important. Can you give us a couple of examples of those things that, </p><p>Tim: [00:24:25] Think that to understand humans and why we took off on the planet, like when overran it and her about to kill it, I believe is because of our success in transmitting culture.</p><p>That's our big evolutionary bet other animals have two advantages. If they occupy a wide ecological range, they adapt physically to that. So squirrels run have rotating ankles so they could run down tree trunks, or some of them have wings, so they can fly between trees. They're adapting to their environment, physically.</p><p>Humans didn't do that. We placed one big bet on culture spread and in order to have these very expensive brains, about three times more expensive to run than any other primate we decided to delay and make compensating kind of effects throughout our body. Our digestive system is smaller.</p><p>Our muscles are weaker. All of that is so we can grow our brain. In fact, Adolescence is delayed. I have two teenagers in the house and they go crazy and hormones kick in and they grow to their adult size and sexual maturity very quickly. That's so you can keep the body small and keep wiring up the brain.</p><p>And so our advantage is the stuff we learn from people around us gives us an edge for our particular environment. It's not physical adaptations. It's yeah. Cultural knowledge. And so because of that, we have all these weird adaptations, like human beings live decades longer than it passed their reproductive years.</p><p>No other mammal does that. And that's so we can spread knowledge and we can, the grandmothers and grandfathers can teach the children. It's a, there's this kind of cultural transmission is the key for us. Downloading things like in the matrix movie, I want to download the program to fly the helicopter.</p><p>Okay, great. As babies we're doing that by watching people around. </p><p>Guido: [00:26:12] Yeah. Yeah. You don't see other species doing things like public speaking and that. That's was </p><p>Tim: [00:26:17] really well that too. Yeah. Language is definitely helps in all of this. But it's culture spread that makes us human and that, that has some good and bad implications for tribes and the values that we hold and co competition among tribes.</p><p>That's definitely part of our psychology. </p><p>Guido: [00:26:34] Yeah. Yeah, no. Interesting. I wondered came from your book. I think it was dominance versus prestige. Dominance is obviously something that you definitely see in the animal kingdom that prestige that's something specifically human. </p><p>Tim: [00:26:46] Yeah. So let's talk about that.</p><p>So they're independent species like crocodiles and fish might spawn a hundred million eggs and hope a few of them survive, but it's not exactly caretaking for the children. You know what I mean? Even birds, they sit on the egg, but feed the little bird, but then you're on your own. Mammals have to survive in Hertz.</p><p>So you have the protection of the group, even though we're individually weaker than most of these independent type of animals. So there's then you have this stuff of like, how do I behave in my group to minimize the social consequences to me, you have bad things happening but still get what I need.</p><p>So there you have like that. The dominant alpha individuals, males, and females, and they get all the food mating opportunities, safety of being in the middle of the herd. So that's basically bullying. Okay. We have a president like that in the white house right now, hopefully for not much longer. So some people can get away with that, but generally we're cooperative.</p><p>And so for human beings to spread culture, you not only have to want to learn and we're incredible mimics. And, but to know who to learn from. And then those people have to want to teach you because I studied martial arts and in the Chinese martial arts, there's this notion of an indoor student. Like you don't really see the good stuff you're out in the courtyard practicing until you're invited years later to be an indoor student after you've shown your willingness to stick it out.</p><p>Karate kid style. So is somebody you have to have, somebody wants to teach. And it gets psychic benefit or survival benefits from teaching and transmitting culture. And that's something other animals don't have. </p><p>Guido: [00:28:20] Yeah, exactly. And shame is not a one, right? That's not something that's also something that you need to develop a one-year-old doesn't really have shame.</p><p>Tim: [00:28:28] There's also something that's an interesting thing. There's a lot of group pressure in the West. We have this mistaken notion that we're individuals. And that my individual happiness matters and I'm so unique and wonderful, but that very notion of being an individual was snuck into our heads.</p><p>We're very much influenced by the people around us and the cultural norms that they're transmitting. And if you don't follow the norms, there's this escalating consequences that happen. We're all enforcers of the rules. In other words, even if we don't know. That there are social rules. We, what they are rather, we assume that we're operating in a world of social rules.</p><p>And so if you break norms, we can gossip about you. It can end your personal relationships. We can deny you economic opportunities. It can banish you. We can even kill you depending on how important the rules are to our culture. So this notion of censorship and shaming other people and getting them to fall in line.</p><p>That's so we can, again, transmit that cultural knowledge more efficiently. Yeah. Somebody in an individual and doesn't listen, they're not a good team player. And so our team versus the other team we're going to lose if we can't spread culture quickly. So we sanctioned people. Including was shame. That's a pretty mild one, but to help with that </p><p>Guido: [00:29:47] culture spread.</p><p>Yeah. I think w in the final part of the book, you also, you give a couple of tips how to unleash your primal brain. And one of them is also to make your group bigger, right? I think that's the tendency is the other way around, at least for me, you'll see. Okay. I have 10 million Twitter followers, but that's not really what we mean here by </p><p>Tim: [00:30:07] getting, by making your group.</p><p>Yeah, certainly I think that at the end I talk about this is more of my wish and my prescription for having our society improve. And you're right. That's attaching to bigger and bigger tribes. You don't think of it as a concentric series of tribes. There's me. There's my immediate family.</p><p>There's my community, my synagogue or church or temple then there's my towns, state city sorry country. The universe or the earth, all living things on the earth besides humans and so on. So what if you have too small of a tribe, if you say I'm only, I only care about my city or my country, everybody else becomes in the out-group and you struggle against them.</p><p>They're the other. And you can see people's stoking fears. Dividing us, these populous kind of leaders, all, not just in the U S but all over the world, and they're playing on the fears of the other and dehumanizing them, making them seem alien. So you have to go out of your way to build bridges and connections and experience things that are the opposite of what you're getting.</p><p>And one of the problems with our age is that in the age of social media, most of us live in little echo chambers, where we just have people that. I think just like us and we, therefore we think the whole world is like that and it's not. And if the center's going to hold together, we have to actively make the effort to understand others and experience other cultures and people.</p><p>Guido: [00:31:37] So what would your advice be? How are you make your inner group there than it </p><p>Tim: [00:31:41] is right now? It's not about making your group bigger. It's about willing spending your time with other people. So yeah. For example in the U S right now, the black lives matter movement is because of the injustice in our criminal justice system is very popular and people say I'm not prejudiced against black people, or I have a black friend, as well.</p><p>Like I remember one time distinctly, I was in junior high school and when went on a family trip to Washington DC and large portions of Washington are largely black. And so we went to the main mall, the Smithsonian and so on. And then we went a few blocks off the mall to go to a pizza place. And it was really odd for me to be surrounded pretty much only by black people.</p><p>And then, so I try to Turn that around and say that's what black people must feel like in a room full of white people. And it was uncomfortable for me, and for no particular reason, if I spend a lot of time in mixed neighborhoods, that would be different. And that's my point. When was the last time you talked to someone of a different culture or different religious belief or even things like riding the bus to school?</p><p>A lot of kids in the U S or bus to schools to, so they wouldn't be as segregated. You have to stretch yourself to put yourself in situations that you feel at least uncomfortable and in order to get used to it and feel more comfortable and understand, there are people just like you.</p><p>Guido: [00:33:29] Speaking of of social groups. I think this is a really tough go on. Let me quote from your book. If people become socially isolated, they stop meddling and simulating the feelings of others and </p><p>Tim: [00:33:41] yeah. They stopped modeling and simulating the feelings of others. Yeah, that's right. Yeah. </p><p>Guido: [00:33:46] And now of course we have this pandemic and physical distancing.</p><p>And how do you choose governments and other organizations try to compensate for this? Because it can have long lasting effects. </p><p>Tim: [00:33:59] I'm not sure you can. My point is that we're really hyper social and isolation is the worst thing you can do to someone. I think if we look back on our times and we look at, for example, supermax prisons or somebody in a cage for 23 hours a day, and then they go to exercise by themselves in an outdoor cage for the remaining hour, that's inhumane people literally go insane in that environment because of the isolation.</p><p>So we need human contact. There's no way to compensate for it. 20 seconds of skin to skin contact releases, oxytocin, which is the mother's child bonding, chemical. It makes us feel good, right? If we feel safe and protected, they're in group, there's no substitute for that. No number of zoom meetings is going to fix that.</p><p>And I think you're seeing this crisis in mental health, domestic abuse, depression, especially among younger children who are forming their identity based on their peer group. I have two in the house there they're severely depressed at times. It's no joke. I think, suicides and things like that are a real risk.</p><p>So we are the there's this longitudinal study about kids that attended Harvard and they're South Boston kind of poor cousins, if you will. And they've tracked these people now for 70, 80 years, and they found that the thing that most contributes to your wellness and life expectancy is your degree of social connection that not having that as the equivalent of being a two pack a day, cigarette smoker.</p><p>So don't underestimate the need for social interactions, with whatever your tribe is. Yeah. </p><p>Guido: [00:35:34] Get out the door, </p><p>Tim: [00:35:37] get out the door, go see people face to face. </p><p>Guido: [00:35:39] Yeah. Yeah, exactly. What would be your tips for CRO? So let's get back to that enforce euros that, that are working in a company and want to create a larger support base.</p><p>within that company. Not, everyone's working at a booking.com where we're experimentation is a, the way of living. And that's obviously a topic often mentioned to you in the podcast. How do we create this culture of experimentation and validation? </p><p>Tim: [00:36:07] Okay, now again, culture and culture spread.</p><p>It's interesting. You have to have influencers that seed that. So people that have influenced within the company, one of the biggest mistakes I've seen, and I actually had a client tell me this one's well, CRO is a swim lane. We have. SEO. We have PPC. We have CRO affiliate. It's just stay in your swim lane, and I think if you've as a tactical little activity and we keep talking with words like hypothesis, and again, not one of my favorites and our technical little jargon, we're not going to get a seat at the grownup table.</p><p>All of the management cares about one thing. They speak one language and that's money. Unless we're talking money, they're not going to pay attention unless we're talking to the upper management, they're not going to pay attention. So one of the things that's I've found determined success is where does CRO report in the organization?</p><p>If you don't have air cover from a senior executive is probably not going to work and keep doing your job. Like I said, you'll be employed for life. There's no shortage of crappy websites, but if you want to have access or rather you need access to senior management and they need to think of you as more strategic, if all it is just tactical testing activities and there's no bigger optimization initiatives going on at the company.</p><p>Yeah. There's no way to change it. Yeah. Yeah. I was </p><p>Guido: [00:37:29] talking to to Johnny London the other week for us, for the podcast. We spoke about the topic was mainly about embedding Ciero into an agile environment, but actually the conclusion was if you have an agile environment and you don't do zero, you don't have a proper agile environment because you're not including the user in there.</p><p>And it should be included in the whole process right in, and definitely Nolan swim lanes. It's something you should adopt. Company-wide. </p><p>Tim: [00:37:54] Yeah, but I also, the very notion of agile is tactical. We were doing a sprint, it lasts a week, then we might adjust, then we're going to do something different.</p><p>So it's very on the ground tactical. And what I'm saying is where I've seen it succeed as like my friend, Joe megabyte, he's now the CEO of the mattress company purple. But before that he was the senior vice president. Of optimization at Expedia and he reported to the president of Expedia. And I once did a training day, like presented at their international optimization summit.</p><p>And their goal was to improve revenue by 5%. Company-wide. And it doesn't seem like an ambitious goal, but this is a, they were a $20 billion company. So it was a billion dollars. They were trying to add to their top line. That's a significant activity. And so he reported. Directly, like I said, up to the present, he started with two people, I believe under him and then grew this out and was overseeing all the different optimization groups at their different properties worldwide.</p><p>And they hit those goals and much more that became a driver of the business. But again, you need a strategic view of it. If it's just a tactical activity it's not, it's going to fail because you can't control the business model. You can't control the user experience. You can't control the.</p><p>Communication the content marketing or the email marketing. So if you're just screwing around with UX on the website. Yeah. </p><p>Guido: [00:39:21] And, but you don't necessarily have to start there either. Usually my idea is if you can start a company doing that for the first half year or first year it's fine doing those technical things but prepare yourself for a more elaborate role within the company and try to move up.</p><p>Tim: [00:39:39] That's right. And you should be asking all the hard questions, go to the CFO and say, what's our customer lifetime value. Most companies have no clue until you, you have to pull teeth to get that data. And even if you have to do it based on assumptions, the fact that you're asking those questions is going to make you more influential.</p><p>Guido: [00:39:56] Yeah. Yeah. I once worked for a company that's over 60 years old and I have no idea what they're, what the average customer value was. And it wasn't an online business, obviously because it's six years old. But I'm like, okay, but you're doing this for four, six years. So no one ever asked that question, this question, how has that a thing?</p><p>How is that possible? How do you not know? And of course for was that specifically for that case there was a, it was lead generation. So basically you do a throw in a lot of money at the websites to get more leads, but no one had any idea what the value of a lead was. You can </p><p>Tim: [00:40:31] imagine it that's unfortunately we were laughing, but that's probably a what?</p><p>80%, 90% of the time. That's the case. Yeah, that's a shame. </p><p>Guido: [00:40:39] And I think the final one for me that that's stood out for me for the book, the final tip, I think in the, in chapter 23, 24 then I don't see coming along that much in, in these kind of books is get more sleep. </p><p>Tim: [00:40:54] Oh that, if there's a personal, if you want to have a happy life, sleep is not optional.</p><p>It's daily life support. Here's a thought every animal or insect that lives more than a few days on this planet has some form of sleep. If it wasn't important, it wouldn't happen. It's so if you want to maintain your life, Human beings have a very intensive need for sleep. We shortened our sleep because once we came out of the trees, it became much more dangerous on the ground.</p><p>We have more intense sleep with a lot more REM. Most of that REM sleep is tail weighted in the night. And so if you're robbing yourself of that final couple of hours, that 90 minutes last sleep cycle you're not creative. You're not learning anything, including physical skills. You're miss calibrating social interactions, which is what allows us to be effective.</p><p>So you think people are more aggressive and you get more paranoid essentially from lack of sleep. We've all seen these effects, but we still think that pulling out our phone and looking at it one more time and. Or binge watching, one more episode is the right thing to do. It's not. Yeah. I, my kids moved to a later sleep schedule.</p><p>I just go 10 o'clock I'm going to bed because my body wakes me up around six. That's it you vampire stay up all night. I'm not going to short change my sleep anymore. Yeah. </p><p>Guido: [00:42:10] And it also changes depending on your age rights at the home, how much sleep you need and when do you need it? During the day, </p><p>Tim: [00:42:15] Yeah, kids need more sleep.</p><p>And they are on an earlier schedule, teenagers flip till much later scheduled and even adults, but they still need a lot of sleep and no adults. You pretty much need seven to nine hours a day. </p><p>Guido: [00:42:27] Your whole life. I think it wasn't American. The university did, they said basically before 10, 11:00 AM.</p><p>It doesn't make sense to get students to school because </p><p>Tim: [00:42:37] still school. Right now it's all virtual. So I guess you can call it homeschool, but our high schools just flipped to a later schedule. That's the science, so that teenagers stay up later and wake up later. In our district, that was the opposite high school was the earliest start time.</p><p>7:00 AM. Whereas it was at like eight 30 for the elementary schools. Now they flipped it. So high school doesn't start till nine o'clock and then that's how you get better performance. Yeah, I'm </p><p>Guido: [00:43:03] good. Yeah. The sleep part really resonated with me in my former life. Being part of the national swimming team, we basically had to report on three things.</p><p>It was the exercise that we did while we got into our bodies food wise, the diet and number three was sleep. And yeah, it was sleeping shorter. Definitely what we didn't have any quality scores for sleep, but definitely sleeping shorter, definitely correlated highly with bad performance overall.</p><p>Tim: [00:43:28] Yeah. Yeah, including if you just did, if you practice some skill physical skill, like swimming and you didn't get proper sleep, it won't get encoded. So you didn't get the benefit of the skill. So trying to cram all night for a test is stupid. Just study less and get extra sleep and you'll do better because at least you'll retain that new information.</p><p>So yeah, everybody says, diet, exercise, sleep, it was always a third one. It should be the opposite sleep is foundational, which also. It impacts your diet and your exercise and then everything else is layered on top of it. Yeah. </p><p>Guido: [00:44:01] Nice Tim for the book. &nbsp;Thanks for writing it in the first place.</p><p>I think it's a great addition. &nbsp;What we already have out there. I think a great starting point for digital marketeers. Like you said, that half currently, no ID what you're actually optimizing for. And there's a brain on the other side of that screen that wants to be influenced.</p><p>And but there are some basics that that might help you some basic knowledge that might help you do this. &nbsp;You already mentioned that there's going to be, unleash. XYZ. It's going to be in </p><p>Tim: [00:44:28] health series, possibly. Although, like I said, writing books as a huge task. And I'm just want to get the word out about this one.</p><p>And I think this is, like I said, what the 8 billion of us have in common. So I think it has a pretty wide applicability and the early reviews are all fantastic. In fact, you mentioned Robert Cialdini. He was kind enough to actually blurb the book. On the front cover because he loved it. So I'm very proud of that.</p><p>He and I have keynoted at some events together. He's a professional crush of mine, so that was really flattering. But so yeah, there, there will be other books in the series, but don't hold your breath. I need to take a rest from writing this one. Yeah, </p><p>Guido: [00:45:06] exactly. It seems like you already purpose of this urge to ride because my book actually says corporate rights, 20, 21.</p><p>Tim: [00:45:13] The U S edition is technically coming out in April of 2021. So right now you can get the eBooks everywhere, the audio books everywhere. And if you want autograph copies of the paperback, I have some pre-release author copies that, that I you can get on the website, primal brain.com. But yeah, if you want the U S edition, it's not out till April six, 20, 21, but the Australia and the new Zealanders, get it before us because My friend, Tony Nash runs Booktopia in Australia and their Booktopia additions division published the separate edition in September.</p><p>So if you're an Aussie or a Kiwi, you can get your copy. Now </p><p>Guido: [00:45:52] we'll add some on LinkedIn show notes. People do to order those those </p><p>Tim: [00:45:56] versions. Yeah. Just go to primal brain.com and it has the where to get it information on the site, along with the table of contents and the introduction and the other stuff.</p><p>Exactly. </p><p>Guido: [00:46:05] Tim final question back to the beginning. So we started off talking about you having all this experience for the last 25 years. What is one experience that you are think you have a one insight that you have that you think others. I have not to catch up on yet in industry. </p><p>Tim: [00:46:22] It's still a mindset.</p><p>I think even in CRO, our center of gravity is still inside of a company and mine has always been through ruthlessly advocate for the needs of your visitors. And so if you just, they don't have a seat at the table, they're like, say marketing's got it. Sales has got it. Operations has a seat at the table.</p><p>Your customers don't have a seat at the table. So your job as a CRO is still only advocate for the needs of your customers. If you align their needs and understanding of their needs with your company strategy, that's how you make money. And again, I just fear that we're too much inside of our companies though.</p><p>So get out of your office, talk to your actual customers. You'll learn a lot more that way than by, flipping through your spreadsheets and your campaign analysis. We </p><p>Guido: [00:47:11] opened Google analytics for it 20 times a day. It's not going to give you the biggest insights. </p><p>Tim: [00:47:19] No. In fact, you're a, you're on a single track in your, in you're stuck there </p><p>Guido: [00:47:23] then.</p><p>Thank you so much. And my my final question to you what do you think I should invite to the zero queer podcast for another episode? And what should I ask? Oh, </p><p>Tim: [00:47:34] well again, I think Dr. Cialdini would be my vote, Robert Cialdini and his book is called influence the psychology of persuasion. And that's one of the Bibles in our field.</p><p>He just came out with a new one called Pre-Suasion about influencing people as well. So you might want to invite him. </p><p>Guido: [00:47:54] Yeah, we actually spoke to a boss routers. &nbsp;He re co-wrote a Dutch book. On online influence and they are actually releasing their book together with Jill Dini. And he's also going to try to persuade, they need to do a podcast with me.</p><p>So if we approach it from enough angles yeah. Maybe </p><p>Tim: [00:48:14] yeah, </p><p>Guido: [00:48:14] that would certainly be helpful. My question will be what's going to be persuasive principle number eight. </p><p>Tim: [00:48:21] It's yep. Yeah I reread recently, re-read the the four agreements by Don Miguel Ruiz. And they came out with another book cause like the fifth agreement, it's I didn't get that in the first book.</p><p>So now I get the deal follow </p><p>Guido: [00:48:34] up. It's a little scratch in the first version, but it's still there. Yeah. Yeah. &nbsp;If chilled any, if you go to Wikipedia, if you look at psychoactive biases, there's a, there's over I think six, 700 of them. You can write a couple, but </p><p>Tim: [00:48:46] it's like what? I think the reason that he really liked my book, especially the last part about what makes us human is I talk about our highly social natures, but again, the evolutionary, why behind it.</p><p>So if you can look at his six or seven and you can see from an evolutionary perspective, how they all make sense and why they're so compelling. Yeah. </p><p>Guido: [00:49:04] And that's the interesting part about your. A history lesson in the most positive way. Because then you try, you don't only learn about those tactics, but also why they evolved that way, why it's working that way.</p><p>Tim: [00:49:17] Yeah. And again, you say it as a history lesson, &nbsp;want to be super clear. I wrote this book without any bullshit. When I was done writing a chapter, I just stopped writing. If I didn't have anything else to say, it's designed to be readable. There's no footnotes, there's no end notes.</p><p>There's a recommended reading appendix, books that you might want to look at, but this is designed to be very easy to read. As from the audio book. I designed it to be read out loud. It's hopefully an engaging style. It's not some chore like reading a history book. No, </p><p>Guido: [00:49:47] definitely not.</p><p>No you definitely succeeded as doing that now. Congratulations. Thank you, my friend. Tim, thank you so much for doing this and I'll talk to you soon.</p><p></p>",
  "show_notes": "<ul><li><em>For more info about Tims latest book (available in ebook, audiobook narrated by Tim, and pre-release autographed paperbacks) go to </em><a href=\"http://primalbrain.com\"><em>http://PrimalBrain.com</em></a></li><li><em>For info about his keynote speaking and CRO consulting services please visit </em><a href=\"http://timash.com\"><em>http://TimAsh.com</em></a><em>&nbsp;</em></li><li><em>Video The Birth of Customer Value Optimization: Reveal </em><a href=\"https://youtu.be/6JWrcizBJQQ?t=2644\"><em>https://youtu.be/6JWrcizBJQQ?t=2644</em></a><em>&nbsp;</em></li></ul>",
  "guests": [
    {
      "id": "tim-ash",
      "name": "tim-ash",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "https://youtu.be/vTmRhOa85_U",
  "main_image": "src/assets/images/episodes/unleash-your-primal-brain.jpeg",
  "language": "en",
  "type": "podcast"
}