{
  "id": "visitor-and-customer-survey-insights-for-high-impact-cro",
  "title": "Visitor and customer survey insights for high-impact CRO",
  "description": "CRO Expert Rich Page chats with Sinbar Dube and shares the secrets he uses to draw an incredible amount of insights from visitor and customer surveys.",
  "date": "2025-01-08T20:07:07.493Z",
  "duration": 0,
  "audio_url": "https://chrt.fm/track/D992D/media.transistor.fm/5f15bd42/1022ddb4.mp3",
  "transcript_url": "<p>[00:00:00] <strong>Simbar:</strong> Hi there. My name is Simbar Dube and you're listening to the CRO.CAFE podcast. The show where we give you raw conversations based on real experimentation experience and consistent conversion optimization results. In today's episode, I'm joined by one of the top experts in conversion optimization, Rich Page, which is one of the few people who have been doing conversion rate optimization for more than 15.</p><p>Before writing two books about conversion optimization. He wrote a thesis on usability for his masters. </p><p>[00:00:34] <strong>Rich:</strong> Yeah. So I've always been really interested in improving websites. I used to try to email that some of the owners of websites when I found things, I didn't like. When I was much younger back when Amazon was back in the mid nineties so I've always really been interested in improving websites.</p><p> Then I actually wrote a thesis on usability website, usability for my masters. Which cause it was a fan used blood usability really interesting and has an impact on the usability of websites. And then actually I started to get really interesting into learning what actually happens at websites and how they perform and by using web analytics.</p><p>So I'm one of the books that really got me into that was web analytics scenario. Which was an amazing, real eye-opener book, which was really interesting. Cause I didn't, I'd never would have dreamt that I would eventually write a book in the same series. There's our a D series. But then and then when the other really eyeopening things that I read was a book called call to action by Brian Eisenberg, which that was one of his first books. I think that was need to yeah, 2005. And it was, and that really opened up my eyes to what you can do with CRO and AB testing to improve websites.</p><p> And then the rest is really history. I've got other things that really helped get me into this industry are online marketing. I did a lot of online marketing and started to realize why don't things always work that well. So then you start to realize, oh, is it because of the website?</p><p>So that's not really helps. And I'm related really well to CRO. </p><p>[00:02:21] <strong>Simbar:</strong> Okay. So was it called conversion rate optimization or there was a different name? </p><p>[00:02:27] <strong>Rich:</strong> That's a very good question. It was more about AB testing back in those days. Yeah. And CRO term got big ironically my book or I called website optimization because it wasn't that term was more popular than the CRO in the day.</p><p>So my publisher decided they would be better to call it website optimization. And the problem is that then confuse people that thought that was. So it changed summarization. And then that CRO term has finally become a bit more widespread in the industry now. Which is conduced </p><p>[00:03:05] <strong>Simbar:</strong> before you got into conversion, optimizing.</p><p>What were you doing to pay the bills? What was helping you pay the bills? I was doing online marketing for a couple of businesses and which was really interesting doing things like Google ads, SEO and other types of online marketing. And then I started to want to know exactly the performance a bit.</p><p>[00:03:32] <strong>Rich:</strong> So that's how I got into being a web analyst. And then. Started that role. And then I then realized, oh I want to know I'm not, I don't want to just do reporting. I want to actually give insights into, okay. This is what I recommend based on what I've seen. You need to improve X, Y. To fix those issues where you know, that people are dropping off at a certain page, or they're not getting to where they're supposed to do or they're abandoning the checkout.</p><p>So that's what really, that's the path that really took me into CRO. And I think it's a good kind of, I think it's hard to really. Get straight into CRO without having some kind of background in those some people talk about statistics a lot, for example it's useful, but I think being a web analyst is actually even more important and having that mindset of trying to analyze what could be wrong to come up with the ideas, to improve in the.</p><p>[00:04:36] <strong>Simbar:</strong> You have been doing this for more than 15 years? I think you're one of the odd years in conversion rate optimized. How many new websites do you think you've optimized so far? </p><p>[00:04:46] <strong>Rich:</strong> Yeah, it's a good question. I've been doing many website audits. I've been, I don't know, hundreds in the last 15 years, all the way from when I used to work for Disney was one of them.</p><p>I was their manager of reporting and analysis. When I started to get into AB testing and CRO for them to bigger clients like Vodafone, when I was working at Adobe. And then all the way to through smaller e-commerce companies, smaller software as a service businesses. Yeah I've worked for hundreds of different types of businesses as well.</p><p> Hundreds of probably getting on 500 different types of websites. They don't mean to just, this is my real passion. </p><p>[00:05:42] <strong>Simbar:</strong> There are different kinds of conversion research techniques, but you specialize on customer and visitor severe. I was always using web analytics and to come up with insights for better website improvement ideas.</p><p>[00:05:58] <strong>Rich:</strong> But I really discovered that if you get into this conversion research and do things like visits to serve. And customer surveys really well, the forms of goldmine of insights and website improvement, ideas that work much better than just relying on best practices, which don't often work for websites because every website's unique, every website's different.</p><p>Companies out there focused on that. Too many people just chase those quick wins and the they're disappointed when they didn't work. What's because if they're not listening to your audience and understanding what their needs and doubts and hesitations are and what they're really having issues with and want to have improved, then you're chasing.</p><p>Yeah, you're barking up the wrong tree almost, and you're not going to have as big impact from what you're doing there. Yeah that's how I've got into really doing this and specializing in and then it's and it's fascinating. It really is. </p><p>[00:07:06] <strong>Simbar:</strong> Yeah. It's a fascinating thing for sure.</p><p>And I think people tend to misunderstand a lot of things about conversion rate optimization are a lot of aspects, but when it comes to. Customer envious to surveys. Do you think that's also the case? </p><p>[00:07:23] <strong>Rich:</strong> Yeah, I think whenever I initially see, I want to do these surveys to my clients or I talk about them along them.</p><p>A lot of people think of these surveys as being like product surveys that are just asking about what did you think of the product or what did you think of. Your customer service which are a pretty dry topic. And obviously the people who are completing them don't really care about them.</p><p>They usually 50 questions long. They take you way too long to answer. So there's, there is some kind of negative connotations with those, whereas the types of vision customer services that work well for in CRO are more to do with improving the visitor experience. So trying to get feedback on what they were doing online, what they liked, what they didn't like.</p><p> So those are really important things that the differentiation and misunderstanding about those servers. And also a lot of people think that these visitor surveys, because so many people are starting to do them, but they're not doing them very well. And unfortunately they make the mistake of popping them up immediately, which is crazy if you think about it, because if you've just arrived on our website, you're not going to have, not only are you going to be annoyed by seeing.</p><p> You, you won't even have any of had any time to use the website to give any good feedback. So that's why I think the surveys get a bad rep. </p><p>[00:08:50] <strong>Simbar:</strong> Yes. I'm one of those people who thinks that pop-ups in surveys can be annoying and distracting sometimes. So how do you come up with a survey that is more appealing and less annoying is the best way you can take it balance between.</p><p>Less annoying and more appealing. </p><p>[00:09:09] <strong>Rich:</strong> So yeah, this is the surveys. What you really need to do is you need to, first of all, get around that point of when to ask them using pop-up survey. So what you would do is you. Make that appear generally after a couple of minutes. And ideally you want to make it show only after they have seen a product page or a service page or a pricing page or something that would indicate that they are, they've got quite far down their journey.</p><p> Don't leave it up to the checkout point. Obviously you won't get somebody. And there any way to give you that information. So that's going to be really important. And then one of the other key things is the not only the questions you use. Cover later on, but how are you even asking for this feedback?</p><p>Because I, this is probably another thing that you probably are annoyed with is that when people may have run these business services previously, they may have a not incentivized it because, and therefore not got many varying responses. So give. On it like, oh, that didn't work. I tried, it didn't work.</p><p>Or they they will offer we will give a five, whatever it is, five pound, $5 incentive. If you complete this survey or they will say when a hundred pound or when a hundred dollars or whatever you have a chance to win it now. Neither of those work particularly well, because often people will just fill those surveys in to try to win the incentive.</p><p> I've seen in the results. It's oh I really want to win the survey or mean that I can finally buy this this prize. I thought of the idea a couple of years ago to change that, to be instead of saying we, you can win you have a chance of winning actually changing that to be.</p><p>To see if you give us the best and most useful feedback to us, you could win. And this prize, which actually makes them work harder and give better feedback. And it makes it really cuts down this kind of crap of visitors just responding yes or no kind of answers. And really I've got some amazing detailed answers.</p><p> So that to me is one of the biggest improvements that anyone can make to their surveys is how actually, how they're popping up that question to get people interested and setting up that right to expectation of what they need to do in order to try to win it. So that works extremely well.</p><p> And then some other things for actually setting up the visitor survey. I talked about when it should show and then the incentivizing it, but you you also what else was there? I would also offer a kind of a gift certificate either to your own website or if you are, if you want to make it even more broad, you could offer like an Amazon gift certificate, $50 works well, depending on the budget I've gone to have had clients who've gone up to $250.</p><p> One time for the best. Which is what the best. And if you think about it, you're probably spending hundreds per week per even per day on Google ads or something. So this is a drop in the ocean of, in comparison to the insights you'll get from it. So try to get as much as give it the, as the higher you get the more responses that you will get.</p><p> And then, because you really need it really nice to at least need a hundred responses from this visitor survey to be able to get enough insights to, to to get enough feedback to work with. So that's what I really recommend. And then customer surveys, or just talk about setting those up quickly.</p><p>The key difference with that is that you need to email this survey to your customers, and it should be slightly different than than the visitor feedback visit. The feedback really should be like five racial questions. Again, I'll cover those in a minute of what they should be. But they're more to do of that.</p><p>Getting that quick first impression. And asking them some of the things that might be causing them problems or not understanding, whereas, so yeah, customer, so customer surveys are different than visitor surveys because they really tried to get that feedback from the people who have purchased. And it's really important to do that because you'll help understand what nearly stopped them from purchase.</p><p>That is one of the key things that you need to ask the customers, because if you can figure that out then and address those issues on your website maybe they didn't trust you or they couldn't quite do something or you didn't have enough information, then you can fix your website, address those issues and to stop other people.</p><p> Potentially not purchasing just like this person, just like our customer, nearly didn't purchase. So it's really important there. And then as we were saying, yeah, this will be longer than your visitor survey. So this is a survey you want to limit to five or six questions just as to be short to the point where this can be a bit longer 15, 20 questions don't go like 50 questions or something.</p><p>Ridiculous for us. On some of these surveys out there that you're just get such a high drop off rate towards the end and people just get annoyed and give up. So that's the real differences between the customer service, but they're both really equally important. So business surveys will you'll get the people who haven't purchased yet, who will have.</p><p>And put some feedback, whereas customers they've already bought. They've been through the whole journey and purchased, so they will actually have just as good feedbacks. They can tell you as I said, what nearly stopped them from purchasing. </p><p>[00:15:36] <strong>Simbar:</strong> Okay. So when it comes to customer surveys and customer interviews, I believe that the quality of feedback and insights you get.</p><p>From your customers is determined by the quality of questions that you ask them. So meaning that if you ask them garbage questions, you're going to get garbage insights or garbage feedback. So do you have a specific questions that you normally ask your customers questions that guarantee quality?</p><p>[00:16:05] <strong>Rich:</strong> Yeah. Yeah, sure. Because I've been doing these, so now I've worked out what questions of what seem to get better results and better insights than others. One of my favorites at the moment for visitor surveys is what doubts or hesitations do you have about this? And that's good because it will really help understand if there's any trust or credibility issues.</p><p> Like that maybe they don't know who you are well enough for you. Don't you're not showing social proof or other things, those all you'll get some good answers there which will help them. By the way, when you're in the beginning of the survey, you should always ask people to be to be honest as possible and to give any suggestions for improvements because you don't want people to just be nice.</p><p>That's the worst thing, even with user tests, as well as like you just getting people who. Just polite and oh yes, this is great. Oh, I would have purchased. Cause you don't care about that. You almost want them to see bad things. I prefer it when they do. So that's really important too.</p><p> I mentioned in in the introduction to the survey, when you're asking these questions, So that's one, that's a really good question for visitor surveys. Another one that works really I've learned is there anything stopping you from purchasing, writing? Similar to the pressure and just mentioned, but this is really like perhaps they have just tried to find something that they couldn't find and don't know the answer to it.</p><p>Therefore perhaps they're trying to, they can't find out how much it is for shipping or they can't. They don't understand about the return services or they don't understand how the free troll works. Whether they're going to get billed us some point, all those types of things or perhaps they even find they found an issue on your website, like maybe there was something broken.</p><p>So that's why that's a really good question then. For another really good question to ask is, and this is trying to help understand your customer ideal customer in, in. And a bit broader terms asking what are the key factors that influence their purchase decision when they're buying something like that?</p><p>Because once you know that it may be very different than what you think it is. So if you think that it's the quality and actually. And they care more about price. Then maybe you want to adapt your messaging to mention that a bit more clearly, or perhaps they want the like with clothes, they want something that lasts a long time, rather than something that doesn't last very long that can give you some really good insights there, but all these are much better than just simply asking.</p><p> What do you think of this website, which are very broad, very do you have any issues with it? You need to almost frame them in this different way to try to get them to give that answer to you. That will give you the best feedback. </p><p>[00:19:27] <strong>Simbar:</strong> I liked that the examples you gave open-ended questions and they give customers enough room to express themselves.</p><p>But when you ask a customer or visitor, what doubts do you have on this website? I think that's more of a leading question that assumes that they were doting something on your way. Yeah. It is a good question, but the way I think about it, like it, it would be very rare for someone to come on your web.</p><p>[00:19:53] <strong>Rich:</strong> And purchase immediately without having any reservations. Everyone was always going to have some kind of doubt or hesitation. So don't think about being negative in that sense. And if they've already got down to that path of giving you feedback, they're probably quite interested in the product.</p><p>If people don't like your product on learn like your website, they're going to be gone immediately. So you would already factored out those kind of. </p><p>[00:20:24] <strong>Simbar:</strong> Okay. Suppose one of our listeners has an e-commerce website. How often should they launch a survey? And is there like a specific moment that they should learn?</p><p>[00:20:36] <strong>Rich:</strong> Yeah. So that's a very good question. So this is the survey you, I suggest doing this probably. First of all, if you haven't done it before, do it now go and do these questions. I offer services that help you come up with these specific questions, because it will allow those questions I've given, just talks about are very good general questions.</p><p>There are very specific ones. You're going to want to ask for your particular type of website that you see it's important that you get that right. First time. But then, so you need to launch that. Get, as I said, a hundred responses, do some analysis, be amazed at the insights that you'll get use those as ideas for AB testing.</p><p> And if you've got enough traffic, that is and then. Or just website improvements. If you don't have that luxury of having enough traffic to do a lot of AB testing, and then once you've done that, I would always recommend doing a follow-up perhaps in six months time, depending on how much you've get to improve.</p><p>So if you've if you've improved a significant amount in three months time, or I've already launched a major redesign, do it again. Because it's always important to get that feedback anytime you launch anything major. So as I said, first time, do it. If you've never done it before, then maybe once every six months a year.</p><p>And then also anytime you launching a new website or anything, major launches, and then with customers what I would do is I would do email it to them. And again, do it as soon as possible go back at least a year's worth of customers. If you go back much further, you or your website is probably could have already changed quite a lot.</p><p>So they may, and they may not remember using your website. So if you go back more than a year, you won't be as useful. But ideally you want to send that out to get that customer list and email it to. Give him a good friendly email, a good subject line to increase the chances of them reading it and opening it.</p><p>And then again, the incentive, same principle there, you may want to, I always just giving a higher incentive to these customers, customer service and the visitor. And then what you would do is you would do this automated after you've done that initial batch to catch the way over the last six months worth, you then would need to automate it.</p><p>So every time every after they've purchased, depending on if they have to wait to receive it, that you would send that survey whatever a week later via an email marketing automation. Which is obviously critical to try also to help and get them to come back there. It's so what's well for adding into an email automation so that every time someone purchases you get this, and then you just check.</p><p>Well, a list of survey responses from your customers whatever, every couple of weeks to see if there's anything really interesting in there. And so that's the best way of doing it. It's an ongoing process. The customer, certainly the customer serving.</p><p>[00:23:54] <strong>Simbar:</strong> Okay. Let's say that you have launched this at via, right? To what extent should you trust the responses? Sometimes they believe that what people say is not what they really do. Is there a way that you can try and improve the quality of response? </p><p>[00:24:11] <strong>Rich:</strong> Yeah, that's a very good question. And that was alluding to earlier.</p><p> So first of all, you need to change the, instead of just saying you have a chance to win it, it should be the person who gives the best feedback or most useful feedback. And you can tell, and while you're reading it, the people have. I have just rushed. Cause they the people who do spend time and really thoughtful, you'll start to see patterns in the feedback that you're getting.</p><p>And you're like, oh yeah, that kind of that person said that in a similar way over there oh, yeah. If we combine those two thoughts together, we could do this. So you're doing that will naturally. Yeah, weed out that people who are just eager to please and trying to win that contest.</p><p>And then as I was saying, when you're introducing the survey, you need to be saying things like, please be honest with your feedback, give suggestions and tell them, look, we're not just looking for praise and nice things. This is, we want you to be as honest as possible. We're looking for.</p><p>Constructive feedback. What we can improve if you don't mention that. Yeah. That's also gonna make people think they want it. They shouldn't be a lot of people are too nice. When they're in particularly the English, when they're. Feedback I've seen it's very oh yes, sorry to mention it they're very nice us a bit more direct for a fund, but in, in the so that's why it's always good in particular in the UK to ask this please be honest, don't worry about if anything is negative.</p><p> We're looking for the most useful and honest best feedback that will really help. </p><p>[00:26:10] <strong>Simbar:</strong> Okay. Okay. Let's just shift gears a bit here. We've chatted a lot about customer surveys. Do you have other techniques that you use to gather conversion research insights besides customer service? </p><p>[00:26:25] <strong>Rich:</strong> Yeah. Yeah that's a good, that's a good question.</p><p>Cause these customer surveys and just the surveys are are very important parts of commercial research. And in my opinion, you can't do effective commercial research commercial, which was actually went out here. There's also some other really high-impact ways of doing commercial research. The other one I always highly recommend is user testing.</p><p>So when you ask them. Similar questions you've got them on your website. You can actually ask them to do things, go to particular pages. You can guide them to parts that you. Particular feedback on. So that works really well setting up, but unit need to ensure that your target audience is it matches the user test is using democratic screen of questions.</p><p> To ensure that they are, that match your target audience. That is something get at least five years of tests on mobile fireball on desktop ask them similar types of questions. The other thing you can do is even at the end of it, you can ask them what other, please go to Google and try to find another website similar to this.</p><p> And they will go and they will give you an ask them for their feedback on another one. Just in the same way in the customer survey you another good question for that would have been did you consider nearly buying from someone else? And why did you nearly consider that? And if you get answers from that, then it will help you realize, okay, they've got that service or they've got this guarantee or they've got that messaging or content that seems to be missing.</p><p>That's really important. I was just you can do that with user testing. So you've got moderated user testing when it's. Where you can actually ask them specific questions. And if if they end up re interested in one particular page, as you can make the, you can dig deeper as you go.</p><p>But most common way of doing it is unmoderated. If you know where you, you set the questions in advance, and then they do it on their mobile phone, and then it gets sent to you with their audio and recording of the And answers, which gives again really good. And the other good thing with that is it will help you find bug fixes.</p><p>So business services sometimes they'll point out things that are broken, but quite often they won't have noticed them yet. Whereas on a full journey user test on your website or a mobile app desktop, they may uncover issues particularly interesting if they're using a like a mobile browser, maybe they're using like Samsung internet, for example, rather than using safari or Chrome, which may make you see oh, wow, look that's broken.</p><p>I shouldn't be like that. So also it's also really good for helping understand what could be broken because the other interesting is thing conversion rate optimization is you've got to fix the broken things like fix broken shit first. Cause if you don't do that, then even getting these ideas and insights from your customer customers via conversion research won't work as well.</p><p>If you've, if you're fundamentally got something not a good user experience that, that isn't. Detected very often. So that's why I use the testing. I would always highly recommend that and it will. Can we work well with, in, in combination with visitor and customer service? I highly recommend them.</p><p>And it's to me is really exciting and a really eyeopening, and I guarantee you that if you do it and you haven't done it before and you do it well, you will be like, wow, this is amazing, but better than any other kind of research I've ever done before, you will quite often see that. Particularly if you haven't done this.</p><p>[00:30:39] <strong>Simbar:</strong> Yeah, we have talked about how often this event should be launched the kind of questions that should be asked and how to improve the quality of customer. Let's talk about what you do with the feedback that you get from the customers. Suppose you get about 500 responses. What's next? </p><p>[00:30:56] <strong>Rich:</strong> Yeah. Very good question.</p><p> First of all with the business server, you can, I would actually stop it after 200 cause that will give you a good amount to analyze that you'll get a lot of patterns through that and a good cross section. Responses. So you don't really need much more than 200. You can always run it again after you've made it more improvements, but once you've got those what you need to do is you can use things like word clouds to pick out key words, but I don't really find them that useful.</p><p>Can I pull up words that are not really that or really that like shipping or delivery okay, it's one word on its own. Doesn't really give you much insight. But the best thing that you need to do is what's called like codifications. Of the types of insights you're getting. So whether it's an issue, whether it's a suggestion, whether it's a fix those are major categories there.</p><p>Then you would also do categorization by the page of that. It's. For the homepage, what are the major issues due to create a spreadsheet and write down those issues? Try to come up with the most interesting ones and list them down separately. And also the amount of times each is mentioned because that is also important to see if something gets.</p><p>50 times then that is going to be really important for you to address that in particular. So you use some kind of quantitative analysis in there as well, but don't just discard something. If it's only been mentioned once, because some people they may have not noticed it, or may not have even thought that it was an issue, but it actually isn't.</p><p>So that's why it's important to look at every response and spend S like good five, four or five hours to, to review the answers. Sit down with your team, review them with them and really then convert that into, excuse the pun into ideas for improving your website. And then you would then prioritize those depending on what page it's on.</p><p> How likely impact you think it's going to have on improving your work. And if you've got enough traffic, maybe test them. </p><p>[00:33:35] <strong>Simbar:</strong> Nice. Nice. This has been very insightful for our listeners. What do you think should be like the main takeaway from this episode when it comes to customer service, if they'd like maybe two or three takeaways that they should like grab from this </p><p>[00:33:56] <strong>Rich:</strong> episode.</p><p> I would say, first of all, get out of the mindset of the kind of dull, boring corporate product orientated surveys, and think about it in terms of visitor experience and customer experience. And then also the number one thing that will change everything is asking for the giving a higher incentive, like a hundred dollars or something for the best or most useful.</p><p> Cause you'll see all of that crap that you've when you may have done surveys before oh, this is just full of people saying yes or no, or like wanting to win the prize that will change the entire way of the results you get. But then ultimately if you don't ask good enough questions. That you won't get very good insights.</p><p>So we all it's not just a simple question of setting up a survey. It's like knowing what to ask, which is what I've come to learn after doing these so many times and how to ask it. Those are the key things with visitor surveys and the customer surveys, but don't give up if it doesn't. You can always increase the incentive try $50 to begin with.</p><p> You increase it to a hundred, again, it's peanuts and comparisons to value that will bring insights that will be will bring an, and it will work. Obviously if you've got very little traffic, it's going to be a problem. And there are other tools that you can use, like usability. You can actually try and find your target audience and usability hub and set up sub a mini survey.</p><p>Then the problem is they haven't been on your website. Really. You can show that you would have to show them their website in the usability hub and hope that the demographics are right, but then it's not anywhere near as good or reliable as getting visitors that are on your way. Yeah. But yeah, if you don't do anything else this week do this, because it will be very enlightening and we'll open your eyes to like how visitors, what they really think.</p><p>Great for proving to maybe your boss, doesn't like something done in a certain way or wants it done his way, or there's a fundamental way of in your business of doing something and you don't want to detract from it, but if you get this feedback enough of it all adds up, it will help you optimize your business as well as your web.</p><p>Okay. So that's all to me, conversion optimization is website related, but the bigger picture is business optimization where you know, making sure that your products, your customers love your product. The shipping is great that they come back again. Yeah, creating new products. It's all really important.</p><p>[00:36:55] <strong>Simbar:</strong> Okay. One of the things I usually ask people who are way ahead of me in terms of experience in conversion optimization is about books. What books are you reading now? But that's a good question. Books. I haven't read anything in a while. I find the problem with books is. By the time they've been written particularly with website techniques and stuff.</p><p>[00:37:23] <strong>Rich:</strong> I can speak from experience that I was lucky because it only took me about nine months to write my book and they published it pretty quickly. At the time they w they didn't have a lot of other publications going out at the same time, but then. Basically a year and a half for me to find some, I started writing it to the time it got launched.</p><p> And CRO the techniques grow like in, in the, in my, I didn't write that much about commercial research my robot best practices and AB testing things. But so like when I write a new book in the future, I would. Talk more about commercial research. But now my point here is that I find that with books that unless it's a board topic or a you know, like a marketing technique with a new spin on it or something that something radically different, I don't generally tend to read them.</p><p>I prefer reading articles from trusted sources. Like I'm one of the, one of the really good newsletters that I've liked at the moment is pebble yards, new agency called Spiro. He they've got this really good CRO insight news. I highly recommend that. Very good, very detailed, very different, highly recommend.</p><p> Looking at that one and where I get my, most of my value is being part of slack channels. There's so many great slack channels out there now where if you don't, if you want to get feedback from someone on their opinion of it, or if they've done it before that has really been tremendously helpful to even more than re them reading.</p><p>Book or even some of the courses out there. Again, PEPs CXL courses at the Institute is excellent. Highly recommend that. But yet books not so much, but if you are looking for the basics and you're very new to CRO, then. So you can read my book is quite old now, but it does cover the basics and the central is very well.</p><p> Yeah. And one of the other books that definitely recommend though, that gets talked about a lot is the influence by Robert CLD. Yeah. Yeah. Where it talks about the six major factors of persuasion things like social proof, urgency scarcity. That was a real eye-opener to me. And to start to use those techniques online because they've worked very well.</p><p>So if you haven't read that, I'm sure many of you have gone and read that it's a very good book. And it would get you thinking things in slightly different way. And then there's a draft web analytics books. Avinash Kaushik of managed Kaushik has done the web analytics 2.0, book old now for 10 years old, but still very relevant, still got amazing content in it.</p><p> He's got great news that he's got this great new it's like a VIP newsletter with, you have to pay for. She's got some real great nuggets in there that you can't easily get elsewhere. He's got free versions still, but definitely recommend that one as well. So yeah that's what I would say for him for recommendations to try to learn and CRO.</p><p>[00:40:58] <strong>Simbar:</strong> Okay. So for some of our listeners, when to connect with you, they want to recharge to you, where can they find you? </p><p>[00:41:06] <strong>Rich:</strong> You can reach out to me on LinkedIn I'm on there. Definitely. Or you can come to my website, rich-page.com. I'm not sure offering at the moment free 10 minute commercial reviews of any page of your choice or just somebody to do a quick recording.</p><p> And give you my initial thoughts about that. Is it often a good way of understanding what potential you have? So come check that out. As well, I'll include the link for.</p><p>[00:41:37] <strong>Simbar:</strong> Yeah, I'll make sure that I'll have the link in the transcript for these hips. </p><p>[00:41:42] <strong>Rich:</strong> And then I've also got a good blood post on medium that talks about all these different visitors, survey questions. There's and customer service questions. So definitely recommend checking that out. </p><p>[00:41:55] <strong>Simbar:</strong> That's all for this episode.</p><p>Thank you rich for taking attempt to share your knowledge with us and especially thanks to everyone listening. If you enjoyed this episode and your leg to help support the podcast, please share it with others. Post about it on social media or leave a rating and a review to catch all the latest from me.</p>",
  "show_notes": "<p>In this episode, they discuss: </p><ul><li>What’s the role of visitor and customer surveys in CRO? Why are they important?</li><li>Is there a thing or two you think people misunderstand about these surveys? </li><li>Let’s start with visitor surveys - how do you set them up? </li><li>How are they different from customer surveys?</li><li>Do you have any favorite questions you like to ask in a survey? </li><li>How often do you think customer and visitor surveys should be launched? </li><li>To what extent should you trust responses because sometimes, what people say is not what they do? How else can you improve the quality of responses? </li><li>What other techniques do you use to gather conversion research insights? </li></ul><p><strong>Resources: </strong></p><p><em>Books:</em></p><ul><li><a href=\"https://www.rich-page.com/my-new-book/\" target=\"_blank\">Website Optimization: An Hour a Day</a></li><li><a href=\"https://www.amazon.com/Landing-Page-Optimization-Definitive-Conversions/dp/0470610123\" target=\"_blank\">Landing Page Optimization: The Definitive Guide to Testing and Tuning for Conversions</a></li><li><a href=\"https://www.amazon.com/CALL-ACTION-Bryan-Eisenberg/dp/078521965X\" target=\"_blank\">Call to Action: Secret Formulas to Improve Online Results</a></li></ul><p><em>Articles:</em></p><ul><li><a href=\"https://richpage.medium.com/the-best-visitor-feedback-questions-for-improving-any-website-7c95449e32cc\" target=\"_blank\">The Best User Feedback Questions for Improving any Website in 2021</a></li></ul><p>‍</p>",
  "guests": [
    {
      "id": "rich-page",
      "name": "rich-page",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/visitor-and-customer-survey-insights-for-high-impact-cro.jpg",
  "language": "en",
  "type": "podcast"
}