{
  "id": "why-humanizing-data-especially-in-times-of-less-human-contact-is-so-important",
  "title": " Why humanizing data, especially in times of less human contact, is so important",
  "description": "We learn how EEG data can give you behavioral insights and why it's important to humanize your data.",
  "date": "2025-01-09T14:36:18.243Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/eeb78b20/3af477bb.mp3",
  "transcript_url": "<p>Eltine: [00:00:00] My name is Eltine and currently I'm responsible for the experience and insights at braingineers. Which means that I focus on the experience of brain engineers as a company, but also the experience of what we deliver in terms of the research and the insights and the translation of those insights into actionable.</p><p>Things are really insights that can be used by companies to put in AB testing processes or whatsoever. &nbsp;So yeah, that's what I'm focusing on. And I've a background in social psychology. I did a masters in social influence and attitude change, so I'm very much interested in. The behavioral side of of the changing behavior.</p><p>And related to that, I also data, digital marketing education. &nbsp;Making sure that I could combine the psychology side with the digital. </p><p>Guido: [00:00:50] Yeah. Did you start off in a job doing psychology and digital together </p><p>Eltine: [00:00:54] or. No, actually not. I started off in a, it was more a data related job.</p><p> And after a while, I I was in contact with the digital side at that point as well. But I figured that I, I saw there wasn't a big future in it. And so much opportunities because at that time we're talking about 12, 30 years ago or so there wasn't really much.</p><p>Digital at a mature level. So I was like, okay. These over there, especially for the psychology side in in </p><p>Guido: [00:01:26] it's. Yeah. In psychology education at that time I'm fairly familiar with that, then usually it didn't have anything to do with internet. </p><p>Eltine: [00:01:33] It. Exactly. So that was actually already my frustration during a university, because it was also very much directed at health behavior, which by itself is really good changing behavior in a health environment.</p><p>But I was more interested in the commercial purposes and the, yeah, I w I started working in a company who wasn't a dedicated to two D did. But eventually I was like, okay. I'm going to move towards that digital side, because that's where my interests </p><p>Guido: [00:02:04] are. Yeah. And now it's a brain engineers.</p><p>What kind of clients do you typically have or are there certain verticals that you guys are catering to? </p><p>Eltine: [00:02:13] It's very it's very broad our client base, which we're very proud of actually differs from retail to e-commerce financials. Government. Yeah. A lot of difference names also telecom.</p><p>Guido: [00:02:27] Yep. Okay. And what kind of research are you guys performing for those </p><p>Eltine: [00:02:31] lines? Yeah, what we what we do is we do neuro usability research. I guess most people are familiar with regular usability research and our method differs from that regular usability testing because we use EEG.</p><p>Which is mostly known as a medical device, but we use it in a commercial setting. So we have a headset that's actually useful in terms of their the medical ones you need to gel and everything on your scalp. It's not nice </p><p>Guido: [00:02:59] to have. I don't have to shave my hats if I'm a participant </p><p>Eltine: [00:03:03] in that.</p><p>And if you want to, but we actually, we identify Stu but yeah, we use EEG. And also where it differs is that during performing a task, so a participant, a user gets a task to perform. There is no interaction with the researcher, so no thinking out loud principles and no guidance. Walking through of a user flow or asking questions in between it's a completely in silence.</p><p>And the reason why we do it is because we measured a subconscious experience instead of the conscious experience. So we were really interested in what happens on a subconscious level and EEG helps to measure that subconscious level through emotions and Yeah, we've created our own emotion detection algorithm, which makes it possible for the EEG to measure the electrical activity within the brains, translated into three emotions in an online environment.</p><p>Guido: [00:03:55] Yeah, the very practical question. These gaps, you need to have participants on location. Otherwise you cannot put a cap on them. So how did you guys do this last half year with all </p><p>Eltine: [00:04:06] that's going on? Challenges? Of course we, I guess it was like six or seven weeks. We couldn't do any testing. &nbsp;In our lab we have a lab in our office.</p><p>During that time we had some how do you call it? The external users where we set up a tests situation. They were able to do research for us because they knew how to play CEG on their head and et cetera. So that was during six weeks. So it was remote testing in a new way.</p><p>But now after There, there have been changes. So we follow the guidelines from the the RFM or what's it called? And the MOA. And now what we do is we actually have all the hygiene. Situations going on within our lab as less as possible contact with our users. So they do come in our lab.</p><p>We keep distance. So the only time that we actually have contact with the participant is when we're standing behind him or her and placing the EEG on the head of the participant. So we're actually way less in contact with the user is as compared to a hairdresser. </p><p>Guido: [00:05:11] Yeah, exactly.</p><p>Good. A good way to fix it, and just to be able to continue to research. So for those not familiar with EEG research, so how does this relate? To online behavior, how can I, as a company improve my website using EEG </p><p>Eltine: [00:05:28] data. Yeah. So we look at emotional experiences and especially we're interested in the why of behavior.</p><p>Companies might have a lot of data regarding dropouts or regarding funnels and conversions, but they might not know why, what the reason is. People are. Going through the funnel or leaving that particular flow and we're are focused on getting to that answer. So the reason for the behaviors, so what is really happening here?</p><p>Why is it happening? And what we do through the use of EEG is we measure their emotional response which might differ from their rational response, because. We know from our psychology backgrounds and that a lot of behavior or all of the decision-making takes place on the subconscious level.</p><p>And we strongly believe that if you want to optimize your user flows, that you also should take into account subconscious behavior and not only focus on what users are telling you, because they might not know what they're doing or understand why they're doing specific things in a digital environment.</p><p>Guido: [00:06:31] Yeah I think our industry colleague botch crits always says that basically your conscious brain is just the passenger and trying to explain whatever decisions that your unconscious brain is making. So the unconscious is really important in, in making those decisions. But if I remember correctly from my my psychology backgrounds it's mainly the amygdala is that is emotional center of the brain.</p><p>But EEG and that's emotional center. They make lies in the center of the brain, but the EEG measures everything that's on the outside of the brain because it's not non-invasive. And so how does that translate to what's happening at the outer level of the, of </p><p>Eltine: [00:07:09] the brain. Yeah. So it's the activity.</p><p>So if the amygdala fires neurons, there are also other parts within the brain that become active. So in what EEG does measure the activity of which Parson brains are going on and off, so which become active and what we did by creating our own emotion detection algorithm. So we measured. The, so we brought users in a situation where they would be frustrated or that would be happy.</p><p>And then we would measure which parts of the brain would be activated. And therefore we made a relationship to which parts of the brain was responsible. And it's an, a dimensional skill from from zero to one with chances &nbsp;of the visibility of that specific emotion. </p><p>Guido: [00:07:52] Okay. So do you have to calibrate it for each person?</p><p>So if we first have to calibrate something for one person seeing, okay, how are, how do they respond to. Certain emotions and then look at a websites or is that very similar for every person? </p><p>Eltine: [00:08:07] So it's qualitative research. And yes, we do calibrate that. That's a very good question, actually, because we at our office, we will use to have, we used to have some limited parking.</p><p> When participants would come in they, there was a chance that would be frustrated due to having to search for a spot for 10 or 15 minutes. So obviously that is frustrating. What we do, we conduct the baseline measurements prior, before we start the actual test just to make sure that we know what they're what their baseline of emotions is so that we know them whenever they start interacting in that.</p><p>On that website or within a journey, we know that the response of the brain is related to the stimulus that they're they're re interacting with. </p><p>Guido: [00:08:48] Okay. That's fair. And you've, I think you've been using this tool for about two years now. Did you develop the brain peak tool? What have you learned </p><p>Eltine: [00:08:57] so much?</p><p>Guido: [00:09:00] In general </p><p>Eltine: [00:09:00] terms, yeah. We're going to start well, yeah. &nbsp;Conduct a lot of research in, on a weekly base. We perform four to five tests and each test is obviously unique by itself. Some are more in a broader sense focused on getting in size and otherwise others are really specific as well.</p><p>Even copy and understanding what the impact of specific sentences on a particular page are. &nbsp;But in general What I see at our clients is that they are amazed and very much interested in what's happening on that subconscious level, because obviously everyone has an opinion and everybody has ideas.</p><p>And in order to really validate what's what. What the worth of it is and what our it's a good idea. You should start testing, but just by asking people what you think of their, of an idea, you will not get that right answer probably, or let the complete answer. I think that's the most important take out at least for what I hear from our clients that they're like, okay, this is a dimension that &nbsp;we should really take into account when, because &nbsp;it's so much related to human behavior and understanding human behavior.</p><p> And if you understand human behavior, you're already more capable of optimizing. Yeah. </p><p>Guido: [00:10:15] And are those companies usually using this as a way to validate like a new functionality or new designs or existing designs or yeah actually all of those. </p><p>Eltine: [00:10:28] Yeah. &nbsp;W we actually do a lot of prototype research as well.</p><p>So being in a development stage and just wanting to verify where they stand &nbsp;and whether it's a good idea. So prototype testing but also so also in live testing. So when it's already online we do benchmarks. So a lot of zero measurement, one measurements as well competition.</p><p>So if one of her clients wants to see how the competition is performing in relationship to how they are performing, then then we're also capable of doing it. It very much differs. And what we see is that quite some clients use it for CRO purposes obviously really get insight into how to optimize even further for conversion, but also are doing research related to service optimization, which is.</p><p>Different because if the goal isn't by itself or real conversion, but you also want to know what their experience is. &nbsp;And because it relates to loyalty and everything retention and stuff, but yeah. So yeah, we see a balance happening over there, which is for us really interesting because.</p><p>Especially now in times where everything's very much directed towards online you can really make a difference by creating or giving the user and experience instead of just giving, showing a flow, which might work. But hasn't really got that Oh, this is nice or, Oh, that's surprising. That's the, yeah, it gives a good experience.</p><p>Guido: [00:11:51] Yeah, exactly. And, but this research is usually I can imagine it's usually used as any or user research to point out where in this case, the biggest frustrations are, or at least the biggest emotion in general, are you still need to validate the solutions, right? You still have to figure out what the best way is.</p><p>I can imagine that if something is highly emotional, highly frustrating It can still be beneficial to you actually, when you point out something. &nbsp;Some basic principles in psychology when someone is frustrated and if you can make it hurts, people might be extra motivated to, to fix something.</p><p>So it can actually help to be emotionally more engaged or frustrated </p><p>Eltine: [00:12:30] drive. Yeah. Yeah, it is. But the frustration that we measure is mostly related to not being able to reach your goal. And therefore it's, </p><p>Guido: [00:12:40] that's usually a bad thing of course </p><p>Eltine: [00:12:42] websites, but so that's one of the three emotions that we measure, but the other one is attention of the other.</p><p>One's our attention and joy. And it's also an interesting one because. Attention by itself. Doesn't have to be a bad thing because a lot of attention means a lot of cognitive activity, a lot of cognitive load, but that can be interesting in a flow just to, to make sure that people really processed the information that is, that has given there.</p><p>Yeah, frustration. As being able to reach your goal isn't really positive. But then on the other hand, joy is related to being able to reach your goal. And therefore, very interesting too, to also have a look at, not only look at the things that are going wrong or might need optimization, but also what is in effect working.</p><p>And I think what what's, what is unique to our mythologies of we're able to really pinpoint. Even on the sentence level or element level what's going on the page. So instead of &nbsp;starting AB testing, because you might think it's over here or they might interact with this section and that might be an issue.</p><p>So we think we should optimize there. We can really pinpoint, on the, on a specific page, these elements are working just fine. They generate joy and these elements are frustrating. So if you start AB testing, you should start focusing on these elements in order to really specify where are the opportunities.</p><p>Guido: [00:14:06] And the pinpointing has on you, you combined EEG with like eye tracking </p><p>Eltine: [00:14:09] data. Exactly. Yeah. So I turned it out. We have a screen recording, so we also have mouse tracking, click tracking so we can really see where users are looking what they are doing when they experienced certain emotions.</p><p>And what we also do is during the research, there's no interaction with the participants, but afterwards we show the participants their own. Recording. So their own screen recording, and also already with the emotions with the emotion graph down below in which there are significant emotion points highlighted.</p><p>And what we do then is we asked the user, the participants to provide us with some feedback on those specific, significant emotion beaks in order to really have a a conscious. Part of feedback related to the subconscious experience. Yeah. </p><p>Guido: [00:14:56] Yeah. W like I just said with the example, &nbsp;conscious mind explaining what the unconscious is doing.</p><p>So there might be a bias in there, but that's of course, a great insight that you can then again, use to to yeah. Create new versions of your websites and rerun those and see if those emotions stay or go away </p><p>Eltine: [00:15:14] or, yeah. Yeah, and definitely, and what's interesting is sometimes if we had we had one research, I believe it was two weeks ago in which eventually the feedback of the users was red or positive at the end of the flow.</p><p>But they directed it towards the brand itself. But if we look at that experience throughout the flow, there was at specific points, there was so much frustration going on and there were actually some use. There were really annoyed and a lot of attention asking parts of the site in in combination with frustration, which is a bad thing.</p><p>But in the end they rated it positive because they were very much directed and they were loving the bread. And that's, what's interesting by, so for that particular client, because they then were able to really see that, even though the Ray thing at the end of a flow might be red or positive a conscious level, but the experience by itself might not be </p><p>Guido: [00:16:08] That's a great way to, to measure brand effect that effectively the effect of the brands rights.</p><p>If you can just run the study with basically the same website or same stimuli or whatever it is, then just replace the brand with something famous versus. Something unknown. See what the effect of just the brand is. </p><p>Eltine: [00:16:26] Yeah. Yeah. Very interesting. And also for them in order, when they would now start, they're now starting to to do the optimization process and they're thinking of retesting eventually and to really see what the impact then is, because if they already have such a good brand loyalty and brand experience if they can also make that.</p><p>Their online experience similar to the brand experience that the whole experience of the of the product and the brand by itself goes up. Yeah. So </p><p>Guido: [00:16:56] very interesting. And yeah, you just already touched upon customer experience or you wanted to talk about humans using data. So &nbsp;why is this an important topic?</p><p>Eltine: [00:17:06] Think especially now, because we're all almost all of us are working from home. So we have little to no interaction with like physical interaction with our colleagues and also less interaction in general, because if you would be in an office you would interact instantly in there. Come something I'll be like, Oh, that's a good idea.</p><p>Or there's a little more creativity going on. So I think that is something that's missing right now. And I think it's also related to, if you are in the field of optimizing online experiences it. I look at CRO as something that should be a sort of culture. So I guess you've talked about it earlier on in your podcast as well.</p><p>Culture of experimentation. So we look at that as well. So it has to be. &nbsp;Carried out throughout the organization in order to be really successful. And now, because of all the limitations in our physical context, it's also relating towards the CRO process and their optimization. So if we only again start looking at Play numbers and okay, people are dropping out or people are not going to dispatch or they are on this page, but we do not know why that is happening and what their actual behavior is.</p><p>We are missing out so much. Relevance opportunities to to really optimize. And also because there's a lot of shifting going on towards online sales right now. Read some articles in in some news items last week with some indications of. We think that people are going to buy even more.</p><p>In 2021 online are really much focused on on buying stuff online instead of doing it offline and therefore it's even more important to take that human beings in account because. In the end, it's human to human interaction. So we are on one half of the funnel and they're on the other side of the funnel.</p><p> And sometimes I think we forget that we are still human beings in need of context, in need of some human experience. And yeah. That's why I think it's really important to really take that human part into data </p><p>Guido: [00:19:10] as well. Yeah. Yeah. I was talking to the organizers of the chiro ward. We also talked about the cultural of spreading that culture of of CRO and they were actually, they were saying, so especially this year normally with, when you, when in the Wars now you showed it at the offers I mean you go to the canteen and do a little speech or something that you've won the award.</p><p>But this year that's not. Something that happened. So it was a diminishing effect of they won the awards several companies, but it's the effect is a bit less within the company, the effects less in sharing that with the whole company. Because now you just, you send out an email, we want them to award.</p><p>Or maybe &nbsp;you shared at your, a small team meeting, but it's not a company wide thing anymore. Because everyone's sitting at home and I can imagine that's happening for a lot of things in those companies. Yeah. </p><p>Eltine: [00:20:02] Yeah. And I guess seeing is believing rights and, or at least experiencing is believing.</p><p>So visibility is everything. So are you have to show what the results are and show yeah. W what's really going on and I think that's even harder. Yeah. So yeah. </p><p>Guido: [00:20:18] At companies that are using your research and trying to bring that inside the company how are they working on this?</p><p>How are they trying to embed this in their company culture? </p><p>Eltine: [00:20:29] So they tried to take it into their process of first year old. So I'm really focused on what their quarterly goals are or year long goals and make it into an end, like integrated into their program. &nbsp;For those that have already have a program.</p><p>Guido: [00:20:46] And adding, so adding neuro marketing to the whole research all the research options that they have, is it usually easy for them to explain that to their colleagues or do they really need to dive into it and really explain, okay, this is actually important that we should be doing this or.</p><p>Eltine: [00:21:00] Yeah. Yeah. It's not always easy. I've experienced. &nbsp;So what we hear is that so regular usability testing, which by itself, I think it's a good way of also getting insights. But it's a very well-known way of doing research and some might argue that even in the traditional way of doing research and I think that there are more.</p><p>There's a lot of innovation going on, on, on research. &nbsp;We see that the companies have sometimes a hard time explaining and really getting people Interested in why this is relevant as well, because yeah, that's another method of doing research and we already have so much data, so we don't need more data sets because we already have &nbsp;some challenges too, to make sure that we look at all the data that we already have.</p><p>Guido: [00:21:46] Yeah, but is it useful data though? You can have tons of data in Google analytics or big query, but yeah. Yeah. And </p><p>Eltine: [00:21:54] that's actually &nbsp;the conversation that we're having with the alongside, with our clients, if they need to explain it to other departments, we try to show them the worth of it.</p><p>So w and I think &nbsp;the most easiest way of explaining it is that we try to. Take w we take the subjectivity out of the, of qualitative research. So you have quantitative data, you have call it quality data. But with qualitative data, it's always a discussion of how you're interpreting it. And by using EEG and by measuring brain activity, you take a lot of subjectivity and interpretation out of qualitative research.</p><p>And I think that's the number one argument for them to use and to really show that there's there afterwards there w we also don't use like big reports that people have to. Read and read, and then it ends up in a draw. We use a emotion analytics dashboard, which also makes it more easy to interpret.</p><p>Guido: [00:22:50] Yeah. Yeah. For me it maybe that's my bias as a psychologist or user researcher, but I also find it way more challenging to find optimization areas. When looking at Google analytics than just doing user research, it's it feels so much easier. And especially the combination is very powerful.</p><p>If you just do a course overview of of Google analytics and see where people are getting stuck. No that down and then do user research to find out, okay, why are people getting stuck there instead of digging through a 20,000 Google analytics reports trying to figure that out it's for me, it's way, at least a way easier.</p><p>And because of it's way easier and faster. The cells are cheaper to do just random user </p><p>Eltine: [00:23:32] research. I think the magic is in the the combination of both, right? You need quantitative data in order to see what is happening, where, but you need qualitative data to understand why it is happening.</p><p>And for example, what we saw happening, there are a few cases. I believe in last quarter that there were specific pages of a flow of one of our clients who weren't performing the way they expected it to be so a lot of dropouts happening over there. But what we eventually saw that by doing neuro usability research, we saw that the issue by itself wasn't on that specific page, but it was already two pages earlier to that page.</p><p>So yeah. And if they would only focus on their Google analytics, it will say, okay, we need to optimize this page where people are they're leaving the patient. We need to automize it in order to make sure that that we enhance everything. But by really looking at why was it happening?</p><p>They, they could understand that the actual issue itself was already. Starting to work two pages earlier to that point. And by optimizing that they were eventually able to limit the Trump outs on the page to page later because they knew it already started irritating earlier on in the flow.</p><p>So it was a buildup. Yeah, </p><p>Guido: [00:24:48] exactly. And even broader than just the bachelor, usually when I'm walking for new clients, you can start the first year with fixing all the well-known low hanging fruits, but after a while, you usually start to figure out okay. But the problem is not necessarily on the website.</p><p>It's it might be the brand that you have. People just enter the website with a completely different. ID of what you are or the campaigns that you run set a completely different scenario up for you and different expectations of those customers. Then they land on the websites. Yeah. I cannot necessarily change the website in a way to completely change that, that brand image that they already have or customers, or maybe &nbsp;the delivery of the product is actually a problem.</p><p>And people do buy there once, but they never returned because you have a shitty. Maybe shitty products or shitty delivery or shitty customer service. Me tweaking things on the website is not going to fix that. And that's why it's important to, to combine all those different research methods. I think if you just get stuck in Google analytics, for example, like you just said, yeah, you can see the least optimal page there, but is that really </p><p>Eltine: [00:25:51] the problem?</p><p>Exactly. Yeah. So yeah, I think that the combination is a. It's so relevant in order to really look at a customer experience as a whole, because that's also, I think that has also changed in the last few years as when a few years ago it was more focused on like single pages or optimizing specific.</p><p>Elements or tools on within within a website. But now I think more and more companies are looking at from a more customer experience, point of view. So really swimming out and looking at the whole process and also taking offline into into account, which is relevant. Because, yeah. And that's an effectiveness of </p><p>Guido: [00:26:35] advertising.</p><p>Yeah. I think it depends a bit on how And how big the company is now present. They are, do they also do TV campaigns, for example, or radio campaigns, that kind of stuff.</p><p>Eltine: [00:26:48] It shows the relevance of the whole culture arise of when we need a culture of experimentation within companies to really make sure that if we want to optimize everything related to company goals, we should look at a customer experience. Point of view. </p><p>Guido: [00:27:03] But it's not something once you're a specialist has gone, they're just going to fix, so do you do companies usually, I only use the neuro-marketing as a starting point to see.</p><p>Okay. Where do we need to focus in the whole journey or do they already have a problem? Like they, they looked at Google analytics say, okay. &nbsp;Our checkout is a problem. Let's focus do newer neuro research on the checkout. </p><p>Eltine: [00:27:24] Yeah there for, so when we have a new clients most of the time we advise them to start with testing their most important sales journey, for example and do it on mobile device and a decimal device to really see what both experience are because they can deliver.</p><p>Enormously. &nbsp;That's most of the time of starting points, but yeah, w we also work for clients who do at least 10 or 15 tests with us a year. And they even test new propositions, so new idea, new product. &nbsp;It depends, but yeah we normally advise to do &nbsp;measurement at the beginning of the year and one at the end of the year, to make sure that you also take into account the most important user for your most important journey and to really see where you stand and how you're optimizing throughout the year, because.</p><p>We all know that we optimize little things and they can have big impact, but we w we also have to have some sort of zero measurement and a one measurements are really see okay. On overall. How did we perform in what are we thinking? Because that also helps in order to keep everyone aligned and really make sure that all the departments within a company see what the impact is of what they are doing.</p><p>Guido: [00:28:40] Yeah. And especially when you repeat user research, you get some kind of a benchmark or value or your own website with your own customers. It is performing. And then, yeah, it's also easier to test new stuff. That's not live yet. So you don't have &nbsp;the big data sets of bows, how users are behaving, but you can just test MVPs and benchmark that or shut it off against the benchmark that you already have.</p><p>Yeah. Yeah. So are you also working with the university of Amsterdam, all non emotional score emotion score? So how's that work? </p><p>Eltine: [00:29:11] We just started working with them a couple of weeks ago. And it's a specific girl case. &nbsp;Or core so to say of the ma master students it's called real-world case studies.</p><p> As we w we started out with with discussing how our psychology education was related to the real world and digital </p><p>Guido: [00:29:32] basically lacking all of that. Yeah. </p><p>Eltine: [00:29:34] Exactly. And at least the university of Amsterdam is doing a good job in my opinion, because they're now really looking at real-world problems at companies digital that are related to digital.</p><p> Yeah, but that started a few weeks ago. And we are, we were already working on an emotion score or so for example you have the system usability scale, which is used within our field and MPS. So net promoter score, obviously well-known but what we think looking from.</p><p>Psychological perspective, looking from the way we conduct research it, it doesn't really take into account the subconscious experience. So it's rating based on your conscious experience. And we already talked about is we know that it lacks the Infor the information that we would really want to know in order to.</p><p>Really optimize even further. And we're now working on an emotion score that takes into account the emotions that we measure in relationship to the experience of the total flow of a website. And when we can really make it a score S as compared to an MPS. So then you have MPSS and you would have an emotion score.</p><p>And I think that would be a. That would be great if we were able to do</p><p>Guido: [00:30:50] so how would you measure it? </p><p>Eltine: [00:30:52] Yeah, that's something there that we're actually now working on. So I cannot really answer that. We're looking at different things, but where we definitely want to take into account the emotions that we already measure.</p><p>So joy, frustration, and attention, and see how they relate to, for example the amount of Like eye tracking. So a pupil dilation, for example, but also the fluctuations within your eyes. If you're looking at the screen so scanning, scrolling behavior and really see if we can classify that based on literature.</p><p>So because they are very much focused on relating what they w the, this emotion score towards the science that is already there. </p><p>Guido: [00:31:32] Okay. &nbsp;But it wouldn't be as easy to measure with a simple survey. I can imagine. No, </p><p>Eltine: [00:31:38] that was new an MPS. And if you want, I would like now, because then again, we would be focusing on the conscious experience and yeah.</p><p>You want to also have a subconscious experience in it? So exactly. </p><p>Guido: [00:31:51] Yeah. Very cool development. I'll be looking forward to that. So do you think those are students working on the, on that this college here sorta probably be finished before summertime? </p><p>Eltine: [00:32:03] It has to be finished by the end of this year, at least &nbsp;the whole plan and the setup.</p><p>And then I guess early next year, we'll start implementing it. Or maybe even already in a sort of pilot phase. We are, we're thinking about implementing it later this year if it's there already. But we do not have the result yet. So it's renter. We're speculating on how to. Implement and when to start implementing, but these are at least the ambition, so yeah.</p><p>First quarter next year it would be wonderful if we would have the emotion score. </p><p>Guido: [00:32:35] Yeah, we're to go well, Tina, thank you so much for giving us a, an intro into into neuro marketing and what you guys are doing in this in this area. What can you tell us about the some developments in the coming 12 months or whatever?</p><p>What are the things you guys are working on or improving on? </p><p>Eltine: [00:32:49] Yeah. &nbsp;Are now working on a licensed model because quite some companies already owned their own UX research labs and have their own UX researchers working. And we want to focus more on the technology. So making it a puzzle for companies to start using our methodology themselves, because now what we do is we do the testing.</p><p>We have the hardware to software, in-house but we want to facilitate that companies can do this themselves and really implement all other types of presets that they already have. And yeah, make their own UX neuro lab. </p><p>Guido: [00:33:25] You were suggested by our previous guests Dave Powell from TomTom to talk with you who do you think we should invite for us Euro?</p><p>Both guests. Yeah. </p><p>Eltine: [00:33:34] I thought about it and I actually had a few names that came up into my mind, but I think was particularly interesting to talk to is Rick whole thing. He's responsible for ethics. And actually we work together. It's grow books. You you are familiar with them.</p><p>And we did a great we combined our research and our way of working. We did did an amazing stuff for them with. With amazing results. And I think Rick would be very happy to tell you about them itself insured. &nbsp;They developed a shoe finder already before last year.</p><p>And they started optimizing it beginning this year. And what obviously happened due to the whole COVID situation is that people were getting more and more interested in in. &nbsp;Running because that's one of the things that you can still do when the gyms are closed and everything.</p><p>So the relevance became a, in just a few months, extremely high. And we started working on a project with them and Crow books together. And we combined the, our psychology efforts because Chromebooks also works from that perspective. And yeah they made an amazing thing. So I think he will be happy to talk to you about it as well.</p><p>Okay. </p><p>Guido: [00:34:46] And my final question. So if there are listeners here that want to stay up to date and things, neuro Mark thing, or the descriptions that we spoke about, are there any books or blogs or other resources sources that you can recommend? </p><p>Eltine: [00:35:00] Yeah. &nbsp;Always personally I'm very much a fan of the system, one system, two thinking, I think that's basic literature that you should be </p><p>Guido: [00:35:12] The CRO Bible. </p><p>Eltine: [00:35:13] Yeah, it is. That's a good word, actually. It is. Yeah, it is. &nbsp;Yeah, that one specifically just </p><p>Guido: [00:35:20] reread it. Let's say that </p><p>Eltine: [00:35:23] reread it. I am also a fan of Natalie. Nah. Hey, I'm not sure </p><p>Guido: [00:35:28] how to pronounce her last name. </p><p>Eltine: [00:35:32] Ah, how great. Yeah, I think I sh I think she's great.</p><p>And I think she was one of the first also one of the first females who was actively out there promoting web psychology. &nbsp;I'm a big fan of her and her books. Are really interesting. Also very easy to read, even if you don't have a background in, in psychology or digital. It's.</p><p>It's really nice. Materials read. Yeah. </p><p>Guido: [00:36:00] Yeah. I think already 10 years ago she she basically claims the title of the web psychologist. She wrote it, she wrote a couple of of books Let's see if I can find </p><p>Eltine: [00:36:11] what's it </p><p>Guido: [00:36:13] called, but that's a new one, right? Website branding for small businesses.</p><p>Eltine: [00:36:20] Yeah. Could be, yeah. </p><p>Guido: [00:36:23] Yeah. She has her ethnic of booklet, but hopefully she'll be able to join us for a podcast episode. So then I'll ask her, I, maybe there's a, I think he's probably writing a new book too. &nbsp;I'll ask her about that, but Eltine thank you so much for joining me for an episode. And we'll talk soon.</p><p>Thanks for having </p><p>Eltine: [00:36:42] me really. Bye-bye bye-bye.</p><p>‍</p>",
  "show_notes": "<ul><li><a href=\"https://braingineers.com/brainpeek/\">Brainpeek</a></li></ul>",
  "guests": [
    {
      "id": "eltine-van-der-veer",
      "name": "eltine-van-der-veer",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "https://youtu.be/8Xbdb2gELus",
  "main_image": "src/assets/images/episodes/why-humanizing-data-especially-in-times-of-less-human-contact-is-so-important.jpeg",
  "language": "en",
  "type": "podcast"
}