{
  "id": "why-cros-should-think-as-a-venture-capitalist",
  "title": "Why CROs should think as a Venture Capitalist",
  "description": "We discuss Strategies for Navigating Through Tough Times and how CROs can deal with companies asking us to optimize when there isn’t even a product/market fit.",
  "date": "2025-01-08T20:07:07.493Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/8ee604b2.mp3",
  "transcript_url": "<p>Guido X Jansen: [00:00:00] Sean is a serial entrepreneur and venture capitalist and the cofounder of growth X and growth Academy has successfully grown dozens of early stage companies across a wide variety of products. And markets is now committed to working on building startups. Ecosystems and developing the next generation of leaders for the innovation economy.</p><p>Sean and I discussed some strategies for navigating through tough times like these with COVID-19 and talk about how zeros like you and me can deal with companies asking us to optimize when there isn't even a product market fit. My name is &nbsp;and welcome to Shiro cafe, the podcast where I show you what the behind the scenes of optimization teams and talk with their specialists.</p><p>About data and human driven optimization, and implementing a culture of experimentation and validation. This episode, faith is made possible by our partners. SiteSpect content square, fertile comb, online dialogue. Welcome to Shiro cafe. And thanks for having us in your lovely garden. I noticed on your LinkedIn that you do a lot of stuff.</p><p>So how would you describe what you do? </p><p>Sean Sheppard: [00:01:19] So personally, my background is I'm a serial tech entrepreneur, a venture capitalist, educator. and now I spend most of my time working on, building content and curriculum for the growth X ecosystem of startups, accelerators, incubators. students and businesses that leverage the growth X Academy to re-skill and upskill their workforce to work in tech, and generally help build startup ecosystems around the globe, working with countries and companies on everything from commercializing new innovations to bringing the best of Silicon Valley to where they are to help develop economies and create jobs and, eliminate the brain drain.</p><p>Seeing their top talent, leave their markets and come to Silicon Valley when they can stay home close to their customers and their families. </p><p>Guido X Jansen: [00:02:14] And so besides working in your lovely garden right now, how has COVID-19 impacted your business or your client's business? </p><p>Sean Sheppard: [00:02:23] it's interesting, I have four different constituencies and the first is the startup community, three different portfolios of over 43 companies.</p><p>And they're all very much focused on capital right now, either, raising it, making it or conserving it. So it's very stressful for the early stage companies that are very fragile. so we're working with them on tactics and strategies to conserve capital. increase their runway and figure out ways of generating revenue.</p><p>Now under these conditions, there's are our corporate clients that are all in triage mode. They're not thinking about innovation. They're thinking about survival for the moment. They're trying to just adjust to the work from home economy. they are, thinking and asking questions in the meantime about what the future might look like for the next six to 24 months and how this is overall going to impact and change their business.</p><p>Our government clients are still moving forward. I'm trying to figure out how best to support their systems. and then there's just the community at large, which is, folks like yourself that are reaching out for. thought leadership and content. And so I'm doing two to three interviews, podcasts, articles, webinars, almost daily.</p><p>When normally I would only do one or two a week. I've got a house full of college age kids that are all taking their classes online and feel like I'm running a dormitory. but, but everybody's being impacted, and there's prefers. There's there's the personal and the professional.</p><p>Really? How do you respond as a person to these kinds of situations? number one, and then number two, professionally, what do you do about that? personally, I think, the rules of life just remained the same, which is, it's not how you act. It's how you react when things are difficult that really define you.</p><p>and, I'm encouraging everyone to. go back and rethink reimagine, and possibly even reinvent everything about themselves and their lives and the things that they care about. Start with your core values and your physical needs, and work your way out to what's best for you, your family, your community.</p><p>there's never been a better opportunity. I don't think in my lifetime. And probably like you, I've been through many of these crises all the way back to 1987 economic collapse through the.bomb.com era through nine 11, which I think this is most similar to in that it's going to permanently change a lot of, things about how we interact and go through the world.</p><p>and of course the 2008. Economic crisis. And, so I think it's a great opportunity for everybody to take stock of their life. Think about that they care about, maybe get more focused back on the things I think that matter most, which are, your own personal individual health and wellbeing, and that of the people closest to you.</p><p>Guido X Jansen: [00:05:11] Yeah. Is it also something that you see those startups do or do you see new startup initiatives focusing on that side? </p><p>Sean Sheppard: [00:05:19] startups are typically groups of very small teams, right? And because they're small teams, you're really dealing a lot more intimately with the individual psyches of the people than you are necessarily their product and their market in these instances.</p><p>So there's a lot of coaching, a lot of mentoring, a lot of support that's very similar to the personal aspects of it. but yes, once we get past and through that, then it's time to get creative, right? It's time to it's time to use this time to figure out how to stay on the field long enough to survive this.</p><p>Because I don't believe that it's the strongest that survive in these tiny kinds of situations where we're not talking about, moving humans through force. or violence or war in a traditional, since I think the ones that are most resourceful will survive, that doesn't necessarily mean have the most resources, but be the most resourceful.</p><p>Can you open your mind up to disruptive and new and interesting and different ways of thinking, of creating of actively listening to your market to find ways that you can solve. Immediate needs for them right now. And that's particularly challenging for four companies in the nice to have worlds or the nice to have markets, where something isn't a genuine need, but it's more of a want.</p><p>And, and whether they do, whether they pursue that industry, cause it's their passion or their belief or their expertise or whatever motivates them. The reality is that in economics? times like these, the nice to haves are usually the first thing to go. so how do you operate in that world?</p><p>how do you stay alive during these times? and so we're having </p><p>Guido X Jansen: [00:07:00] yes. And the students is that, the, bread making machines are hard, a high on the list for a must haves. And, things like bathing suits are high on the list of national Hess, right? </p><p>Sean Sheppard: [00:07:11] It's about physical needs, right? Everything begins and ends physical needs in these kinds of, in these times.</p><p>Guido X Jansen: [00:07:17] Yeah. And, interestingly, so you say, it's about how you react, and our resourceful you are as a company. Are there any examples that you see around you, how companies, maybe surprise you how resourceful they are and what they do, during this time? </p><p>Sean Sheppard: [00:07:29] Yeah. I can talk about some, without naming names in my own portfolio, in my own world.</p><p>we've got some companies that are thriving as a result of what's going on because they provide. Technologies that are really around, distributed work environments, live streaming, for example, or they might be in the, in the modern e-commerce mail-order kind of subscription businesses.</p><p>and last mile delivery services. the ones that aren't in those worlds are really I'm teaching them how to reorient themselves around key problems that their customers have right now that they might be able to solve regardless of whether or not they have a product to solve it. So can they take on a service mindset and uncover true needs?</p><p>That they can solve for right now because they know it well, or they have the bodies to do work for somebody that doesn't necessarily otherwise have the budget to do anything that would be a fixed cost rather than a variable cost or how can they help their corporate clients through these triaged, moments that I'm talking about, where in the C suite, they're talking about two things.</p><p>All right. How do we keep our, how do we keep our employees? around and productive and paid, minimize the pain and mitigate the risk, while rethinking what life's going to look like when we come out of this and what can they do to contribute to that? it's really about having a sound market and business acumen around the area that you serve and then taking on that human to human approach.</p><p>Yeah. What can I do to help you right now? </p><p>Guido X Jansen: [00:09:08] Online dialogue?</p><p>does that a specialist?</p><p>A team</p><p>and ultimately this year salmon Mecho &nbsp;social websites, sales funnels, and customer journeys for Mia info, China online dialogue. Have you already seen companies completely missing out on this or missing the boat on how to handle this? </p><p>Sean Sheppard: [00:09:44] I do. I see a lot of companies and in panic or immediately taking knee jerk, reactions of cutting everyone and everything.</p><p>I see them not providing, psychological, mental, emotional support to their people, the way that they should, it's times like the crisis is when you always see this, right? leaders, the right kinds of leaders emerged and the wrong kinds of leaders pardon the French here, but show their ass.</p><p>Yep. and when you see that you see a direct impact, I had a conversation yesterday with a very dear friend who was a very senior. C level executive in one of the largest tech companies in the world and certainly in the Valley. And we all know the name and I'm not going to name it because you could probably narrow it down to about five or six companies.</p><p>We'll leave it there. And he's struggling, with the fact that he is a, he's a manufacturer, hard charging, very direct blunt person. and he's always run production and buyers that are operated that way. And now he's got people freaking out and he, that the fact that they're freaking out frustrates him and his frustration is coming out because he's the kind of person, probably a lot like me, where when you're down, you just get more focused and intent and determined.</p><p>and a lot of people aren't like that. In fact, most aren't. So he's frustrated easily with those people. And he's expressed that frustration publicly and it's caused real problems. And now he's trying to figure out how to deal with it. And a lot of it is him learning how to grow in that area of his life and not react quickly.</p><p>Guido X Jansen: [00:11:25] Leaders and managers are, I imagine, need a whole different skill set data these days. That they're not used to using or having </p><p>Sean Sheppard: [00:11:34] they do because everybody, for many of them, it's been good times for close to a decade. Yeah. economically speaking, even though depending on, worldview, but for the most part we've been moving in the right direction, economically commercially for, good seven, eight years.</p><p>Yeah. everybody has their challenges. We haven't nobody's facing anything like this in quite some time. and many of the people in the workforce, especially in the millennial generation, haven't experienced this in the workforce. They've experienced it in the household, growing up, seeing their parents struggle through the Oh eight thing.</p><p>and I think that's shaped a lot of who they are and how they think and their behaviors, why they're not buying houses or getting married or creating fixed liabilities or a credit card debt. they're saving money. I'm very impressed with a lot of those things. They experienced that, but yeah, they haven't themselves dealt with that, this kind of scenario.</p><p>Am I going to have a job tomorrow? and even if I don't, there's no other jobs and I can't leave my house, all of those things together. It's a real challenge. Yeah. So leaders, managers, anybody who's responsible for anyone else they need to step up right now. and they need to, reassure people.</p><p>They don't need to blow smoke, but they need to reassure people that we've been through these things before in our history. We, this too shall pass. We will get through this. And I know that days feel like months and years sometimes, but we'll come out the other side of this. And one of the reasons I'm encouraged by it is our economic crisis right now is self-imposed.</p><p>This isn't driven by a weak market. Yeah. There's strong demand out there. And I think that demand will come back. Certainly the longer we're in this situation, the more challenging that will be. but I do believe that there is pent up demand out there. It will come back. I just saw some data yesterday, that, cruise ship bookings in 2021 are on the rise.</p><p>In the last few days. Yeah. And so that, so who takes cruises? That's baby boomer generation people. And they're typically pretty conservative. And if they're starting to see that things will be quasi back to normal by then that's a good sign. </p><p>Guido X Jansen: [00:13:56] Yeah. And the health are also things that are over. I can imagine that a lot of people are, we'll try to make up for things.</p><p>That's right. taking an extra cruise, extra holiday or, </p><p>Sean Sheppard: [00:14:03] yeah. And I think also I'm already seeing. People, on the corporate side, corporate officers and some major financial institutions are realizing like I have one really good friend. Who's a C office. I have two good friends at two of the largest banking, financial services firms in the world, two of the top five, and both are saying the same thing.</p><p>They're both been very pleasantly surprised with their ability to triage their way into a distributed work environment within weeks. Their activity is through the roof on top of it because everybody's. Moving money and dealing with the situation. and then on top of it, they're actually seeing productivity in the work from home environment, be much better than they expected.</p><p>And now they're having conversations about, do we really need all this office space in downtown? in downtown San Francisco, people are getting along fine. there's still people emotionally and mentally ready to crack. Don't get me wrong. and great leaders are aware of that. And they're in tune with that.</p><p>They have a high emotional intelligence and they're addressing it. And they're engaging people in ways that they hadn't before. I just had a conversation yesterday with a good friend of mine. Who's literally running his two day offsite that scheduled every year, he's running it virtually.</p><p>They're going to behave as if it's the thing and they're still going to do it because people need it. </p><p>Guido X Jansen: [00:15:24] Yeah. And, yeah, you spoke about this on another podcast too. So if, if people are interested in that, the marketing transport guest, you spoke about strategies for navigating through tough times.</p><p>We will definitely link to that one in the show notes. just shifting topics a bit. what I often see is that when companies start with optimization, with this podcast is about, of course, a hero. I see that a lot of Ciro's people working in CRO usually. I think it's a much broader term should be much broader applied to this.</p><p>This is not just optimizing buttons on our websites. but it's often, the website definitely where it starts, where people start optimizing, of course, because you have the data over there. but when I see it, a lot of colleagues of mine, in this hero world, find themselves in a situation that they're asked to optimize a websites, while there.</p><p>Actually it's still now product market fit. And I know you've spoken about that before. So what would your advice be for sheroes that find themselves in such a situation? So I was trying to, or being asked to optimize something that doesn't actually have a broad market fit yet. </p><p>where to start.</p><p>Sean Sheppard: [00:16:35] So there's two ways. There's two ways to answer this question. So if you're a CRO being brought in to an organization where the expectation is that you are to optimize what already exists, that assumes a lot, That assumes that there's standardization already. So I think about it in terms of these there's this kind of, four there's four phases to a funnel.</p><p>There's, there's ideation, there's creation, there's standardization, and then there's optimization. You gotta start with an idea. Then you've got to, then you've got to execute on that idea and then find something that's predictable. All our product market fit in order for standardization to even be a thing.</p><p>And then from there you can start to optimize. now that's a holistic overly simplifying it, but that's really how it looks. So if you're being brought into an organization to optimize, and you ha and you don't agree that there's standardization yet, then you better have that conversation before you're brought in.</p><p>Because otherwise you're going to end up with misaligned expectations and I've got this other formula and I like to call F equals Z minus our frustration equals expectations minus results. </p><p>Guido X Jansen: [00:17:50] Yeah. </p><p>Sean Sheppard: [00:17:50] Yeah. If you don't, if someone's hiring you, paying you, investing in you to optimize and it's not ready for optimization, you need to tell them the truth because otherwise you're setting everybody up for failure.</p><p>And I see that all the time. I see an overwhelming majority of what's called a bad fit higher in these environments and early stage companies in particular, where they don't have product market fit being where someone's assumed that it already exists. And oftentimes the worst culprits are the founders, the hiring teams, not the person being hired.</p><p>Like I don't see CRS coming in and selling people on the idea of optimizing something that is that's not ready to be optimized. I see founding teams selling CRS on. Yeah, no, we've got all this shit figured out. You just need to come in and optimize every step and stage and exit criteria in the funnel and the customer journey and the full life cycle.</p><p>and then focus on iterating, based on that data. when the reality is that 80 to 90% of this time, this stuff is incomplete. There's a lot of, there's a lot of leaks. There's a lot of unknowns and things that we thought we knew that we didn't know. and any CRO who's been who's with any amount of life experience can identify with us.</p><p>It's not what you thought it was when you walked in the door. </p><p>Guido X Jansen: [00:19:07] Never. </p><p>Sean Sheppard: [00:19:09] And then you've got to do the one step forward, two step back. Thing. So the question that I think the most important question is do you need to do your due diligence as a CRO first, put your investor hat on because I've been an operator and an investor.</p><p>And what I've learned about being an investor is that my operational experience makes me a better investor. And my investor experience makes me a better operator. What do I mean by that? View yourself as a CRO, as an, as a VC, somebody's asking you to invest your time and expertise and resources in a task or an activity inside of a company.</p><p>So you better make good, gosh, darn sure that you are a good fit for the thing, not just culturally with the people, but that it's at the right stage. And that what you're being told is in fact the truth. and I would, I encouraged CRS to require their own period of discovery before they make any sort of promises about what it is they're going to do, even if it's contract basis as opposed to a permanent basis.</p><p>but if you don't have an opportunity to dig in and understand what the current state of affairs looks like, then you could be putting. the entire opportunity at risk and it certainly may not be any fun. So that's the corporate, that's the one where, you're walking into a situation that isn't what you thought it was.</p><p>Guido X Jansen: [00:20:39] Becca uninformed ends our beta test that happy Oak lost from the beginning of flickering, a very artist. He did come through. The key test was not to be included and I'm positive test tells that no Tyler's JIRA. Albeit convert comes our beta testing software. The smart insert that about any flickering of &nbsp;five gifts, Nella support fee, 24 seven chats.</p><p>The health would go by and, but dive is the last release was 15 Kia carbon positive. If you do this yourself, you have a knife and the fork and the</p><p>I do feel that, heroes are, very well skilled in, in, in, into ways of finding out that product market fit they're already skilled at using, while looking at a lot of data, using that to ultimize experiences. doing user research, that's kind of stuff. So how, even as a, maybe someone trained or skilled in CRO, how can we move forward?</p><p>How can I still help that company find that product market? </p><p>Sean Sheppard: [00:21:40] So they've got, everybody has to agree. Number one, the product market fit is a thing and that, and then it's defined by when the resources you have to fulfill demand are now, No longer adequate, that the entire sales process, from, from the top of the funnel through pricing discussions, through onboarding, implementation, and use, start to get a lot easier sales cycles shorten.</p><p>and if you're not seeing that. And you're not seeing a situation where if I just throw more resources at this will scale in some, by some measure. then, then you haven't gotten a product market fit yet. So number one, you got to understand what it means. Agree that it's a thing, define what it looks like for your organization together.</p><p>and then recognize that what you're looking for on the path to product market fit. the two most important things. Aren't revenue, they're time from your market and the truth in the form of that feedback as real time as you can possibly get it. and yes, some of that certainly touchless data-driven analysis.</p><p>That's, that's looking back. but a lot of it is in real human to human custom development. I can't tell you how many times I've seen conversion rate guys and girls, extend their path to product market fit by over using their tools and their technology. And under-utilizing the opportunity to have live insightful, realtime relationship oriented feedback sessions with individual users of every given profile and circumstance and channel and method and means.</p><p>and testing and experiment environment that they, that's offered to them. And I don't mean traditional focus groups or Google form surveys. genuine insightful discussions with user interviews that are developed by UX professionals that understand how to do user interviews.</p><p>if you have, if you don't know who Laura Klein is, you need to learn. if you haven't read the mom test, you should read it. You need to understand how to ask questions that get you the truth. And if you can do that, you can get there a hell of a lot faster and cheaper than just running people through your funnel.</p><p>so that's one area that I think is really important. I think the second is that I think CRS have to recognize their stage relevance, and the people that they work with also have to understand their stage relevance. Are you really good at going from zero to one? Or are you better at one to end?</p><p>are you somebody who co who's better at some certain amount of traffic or revenue, with a certain amount of team and resources already in place? Or can you create from day one, can you embrace ideation and creation to get the standardization, or are you more of a standardization and optimization person?</p><p>Because I think sometimes CRS put themselves in a bit of a, a corner. With the term with the turn optimization. Oh yeah, definitely. Yeah. and I think, you can be a CRP just as much as you can be a CRO, which is conversion rate professional, you'll leverage what, how to behave and what you know, how to do around conversion rates, to get a job done.</p><p>conversion rate standardization creation, and ideation are just as important as optimization. </p><p>Guido X Jansen: [00:25:01] Yeah. And, sorry to grow. Thanks. you guys have a market acceleration program and that helps companies find that product market fit, right? </p><p>Sean Sheppard: [00:25:09] Yeah. it all started about six, seven years ago, myself and my partners were all serial entrepreneurs.</p><p>Turned investors started frustrated investors because our companies weren't succeeding. Not because they couldn't build products, but because they couldn't build their markets. and then right around the same time, roughly give or take five, five years or so you had this fundamental shift in the market where it became really, it became cheaper and easier to build and launch products than it ever had been before the call it the age of applied technology, where it's never been easier or cheaper to get products to market.</p><p>As a result of salsa, never been more difficult to get traction for them in the market. Yet, most founders were very much focused on their product. And so we just tried to solve our own problem first, which was how do we help our companies find product market fit? So we built a program and a specific methodology that became a private accelerator just for the companies in our portfolio that we call MXP or market acceleration program.</p><p>That's centered around a framework that's designed to do three things. Find the truth about where our product fits in the market, if it does at all, and what to do about it, create a functional learning organization out of the team of people responsible for that, recognizing that we have limited time, money, and resources to find our truth.</p><p>And then ultimately where's the business model. Can we find predictable, profitable, scalable revenue in some way, shape or form along the way? And if you can do those three things, you can find product market fit. And we do it across these three traction based model. and they're all, they're not based on revenue.</p><p>They're based on traction and have very specific goals, focus areas to execute against and then desired outcomes. But the number for one outcome we're always looking for is that truth. And then we're looking for pattern recognition around the truth. So it's an experimentation framework, but it's designed to be for learning because revenue comes from getting the time and the truth you need from your market, so that you can validate and iterate and pivot if necessary, 80% of funded companies fail in the tech game and 80% of the reasons they fail have to do with markets and people, not with their products.</p><p>And so a big part of what we do is try and level the playing field. So that the tech people who forever have ruled Silicon Valley Allie in the age of developed technology, which is what it used to be, which is when deep science would win, regardless of behaviors, because it was very unique and defensible that in the age of applied technology where it's easy to build stuff and copy things, you have to create market development expertise and focus on that just as much as you focus on product development.</p><p>And that means. Conversion rate optimization is a huge part </p><p>Guido X Jansen: [00:28:05] and you also have the growth X Academy and it's actually something people can just follow a line, right? People can just </p><p>Sean Sheppard: [00:28:12] originally we started with our w with a campus in San Francisco, inside of our offices and people could take fully 12 week fully immersive programs working on real projects with real companies in growth, marketing growth, hacking UX design, thinking, data science, entrepreneurial selling.</p><p>and our MSP market acceleration program. And then the demand came from, from a global audience that we want this and we want it online. So we started to move everything into a, into an online environment. And then we have licensing partners around the globe. Governments and accelerators and incubators and other universities that are, delivering the programming, in their markets.</p><p>Guido X Jansen: [00:28:52] SiteSpect beat veiled and unique testing professionals, Nazi and product recommendation, all bullshit SiteSpect to server size. This is on the tax office Kips for doing optimal performance. . The SiteSpect approaching 80 minutes for tagging, I think cons of flicker effect Dave and days aren't back and forth with the</p><p>pain impact have open debate Testa and</p><p>and that's a, that's also program for people not necessarily working on zero sales, but also for sales and business, that fries. </p><p>Sean Sheppard: [00:29:31] That is correct. It's the whole idea is to cover. I want to build an army of market developers, right? I want to build an army of people who can help great product focused teams find product market fit.</p><p>Yeah. </p><p>that's my purpose at this stage of my life. </p><p>Guido X Jansen: [00:29:48] Yeah. So I can imagine a couple of zeroes thinking, Hey, I should, I know some colleagues I can send over. </p><p>Sean Sheppard: [00:29:53] Not only that, they can leverage them as interns. they, because, they work with, 70% of their education is experiential.</p><p>They get to work on real projects with real companies, the companies get free, help. They, the students get a portfolio of experience. and there's a big focus on their career and their mindset. And, the four pillars of the Academy are mindset, mastery, career, and community. We want to give people a growth mindset where they can be alerted all and not a know it all.</p><p>We want them to know that they can master anything with deliberate intent and practice. We want them to focus on a career. That's going to not just be, make them happy and satisfied, but be meaningful. And we want to create a community of mentors and companies and employers and alumni that will all be there to support them in those efforts.</p><p>And we think that's the future of education and the innovation economy. </p><p>Guido X Jansen: [00:30:46] Do you see more people focusing on self-development in these times or, people too busy managing their households? </p><p>Sean Sheppard: [00:30:54] Boy, I hope they're trying to take some time to develop themselves. it's always been in my natural nature. I'm a voracious consumer of information.</p><p>and I usually look outside of the disciplines and practices and I look more fundamentally into sort of base human behavioral stuff and try and figure out how to apply that in my craft. And I do I watch and read and listen and collaborate with all the thought leaders in sales and marketing and UX design and data science and startups and venture and education.</p><p>And I love and appreciate all of it. But I also look for, the thought leaders in genuine human behavior and trying to learn and understand who we are and how we behave and what we can do to be better, because I don't believe that there's a difference in the innovation economy between personal and professional development.</p><p>You develop yourself as a person, you're going to develop yourself as a professional. </p><p>Guido X Jansen: [00:31:50] Exactly. It can be any, anything you work on, especially during these times. That's right. Sean. Thanks so much. It has been a pleasure talking as you. my final question. So you also do contributions to the post, so what's your next article gonna be?</p><p>Sean Sheppard: [00:32:04] So I'm working on it now I'm thinking about, what's the big idea. A is be the title and I'm actually going to be doing a five part webinar series on it as well for connection Silicon Valley. If people want to go, to connections, Silicon Valley, Google that, or go to the website, sign up for the webinar, but it's about how companies can either the next big idea, and then execute to find out whether or not if that idea is, Is the right idea to commercialize and monetize.</p><p>And it's a very practical, approach, towards execution because most innovations fail for the same reasons. Most startups fail. It's typically a lack of product market fit, and it's typically the behaviors of the team and lack of differentiation and timing in the market. And so right now, big companies are all thinking about how can I deliver a digital.</p><p>Experienced akin to my current analog experience in the age of COVID. so we're going to help them figure that out and that'll be my next piece. </p><p>Guido X Jansen: [00:33:08] We'll, we'll be linking to that. If it's a, when it's published, we'll add that to the show notes. Also publication. Thanks so much. I would say have a lovely day, stay safe.</p><p>Good luck with, running. your student dorm at home, talk to you later. Bye bye, Sean, thank you so much for the interview. I really enjoyed your carton, our talk, and I wish you the best of luck with all that you do. And that concludes episode 16 off season two of this hero Fe with Sean Shepherd from growth X, and there's always the show notes.</p><p>It can be found on our website it's hero.gov. Hey, although we start out as a ditch podcast, we are putting out more and more English content. If you want to skip all the ditch content. Please go to sera.cafe/english to see an overview of all our English episodes and to subscribe, to get notified about new English contents.</p><p>Next week, another English episode, where I talked to designer and developer and optimize our by show, he runs his own agency Corvus hero, and we discuss automating parts of your Shiro workflow. So you can keep focusing on the parts of the job lock to you then, and always be optimizing.</p><p>‍</p>",
  "show_notes": "<p>Sean is a serial entrepreneur, venture capitalist and co-founder of GrowthX and the GrowthX Academy. He has successfully grown dozens of early-stage companies across a wide variety of products and markets. He’s now committed to working on building startup ecosystems and developing the next generation of leaders for the innovation economy. </p><ul><li><a href=\"https://gxacademy.com/\" target=\"_blank\">GrowthX Academy</a></li><li><a href=\"https://growthx.com/mxp-series/\" target=\"_blank\">GrowthX Market Acceleration Program</a></li><li><a href=\"https://marketingtrends.com/episodes/strategies-for-navigating-through-tough-times-with-sean-sheppard-of-growthx/\" target=\"_blank\">Marketing Trends Podcast episode with Sean about strategies on how to navigate through tough times</a></li><li><a href=\"http://momtestbook.com/\" target=\"_blank\">The mom test</a></li><li><a href=\"https://www.connectionsiliconvalley.com/\" target=\"_blank\">Connection silicon valley</a></li></ul><p>‍</p>",
  "guests": [
    {
      "id": "sean-sheppard",
      "name": "sean-sheppard",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/why-cros-should-think-as-a-venture-capitalist.jpeg",
  "language": "en",
  "type": "podcast"
}