{
  "id": "why-empathy-is-probably-the-most-important-skill-for-any-cro-pro",
  "title": "Why empathy is probably the most important skill for any CRO pro",
  "description": "Today we learn why empathy is probably one of the most important skillset for any CRO professional to develop.",
  "date": "2025-01-08T20:07:07.493Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/0d11143e.mp3",
  "transcript_url": "<p>Guido X Jansen: [00:00:00] Today we are going to discuss why empathy is probably the most important skill for any syrup professional. And we'll be doing that together with Tiro specialists, Armani of law from the UK. </p><p>Amrdeep Athwal: [00:00:20] My name is Kelly ulcer and welcome </p><p>Guido X Jansen: [00:00:22] to Shiro cafe. The podcast where I show you the behind the scenes of optimization teams and talk with their specialists about data and human driven, optimum, and implementing a culture of experimentation and validation in case you missed it.</p><p>In the previous English episode, I spoke with Yogi girl. Yes. AB testing statistics. And you can listen to that episode on the shearography website or in the book best active listing with right now, this episode of shearography is made possible by our partners. Find spec all on influence Institute square and all my dialogue.</p><p>Welcome to season two, episode 31, a warm welcome to the cafe. And can you give us a short introduction of your journey into Syria? </p><p>Amrdeep Athwal: [00:01:04] So I actually started off in direct marketing, 13 years ago now. and we used a lot of the same principles in CRO. And then in terms of data analysis, in terms of testing EMR campaigns, testing direct mail campaigns.</p><p>So it was a natural evolution for me to move to digital. And so about eight years ago, maybe moved to digital, started doing but analytics then obviously . insights and insights led to how can we improve the user experience? And so then I became a CRO about the same time as well. I think that actually my first day doing web analytics, my first project was a CRL project for a large cosmetic surgery company.</p><p>And, so yeah, that kind of got the, got me into it and. Funny enough. That very first project was, was my biggest, one of my biggest results to date. I think it was like 420% uplift in the main conversion rate of the page. So yeah, that got me hooked. I was like, Oh great. And, chasing those triple digit puppets, but they are few and far between I've come to find a, it's usually 5%.</p><p>rather than, 400% </p><p>Guido X Jansen: [00:02:18] and your rights are how no one has actually done a study in CRO or, but it'd be, we all have different backgrounds, and end up doing experiments. </p><p>Amrdeep Athwal: [00:02:28] Yes exactly. I always say to people here now landed in my dream job. Cause my favorite thing when I was in school was science and my favorite part science was running experiments.</p><p>Cause I love Jenna you'd have an idea. You test out. Sometimes it works. Sometimes it didn't, you always learn so big at the end of it. And so then, now I get to do this. And no one pays me to do it. So I'm like, if all I could, if all I could do is come up with ideas, run experiments, or there I'd be very happy.</p><p>but unfortunately there's, so there's a lot of other things that come along with working in organizations. You don't just get to play with experimentation all day long. </p><p>Guido X Jansen: [00:03:04] So w what kind of work do you do right now? What are you working on? </p><p>Amrdeep Athwal: [00:03:07] currently, so I'm a consultant, so typically I will come in work for a company from anywhere.</p><p>Three months to about nine months, sometimes shorter, sometimes a bit longer. come in. Basically say, this is where your current, experimentation program is. This is where you want to be. How do we get there? And that might be a new post, a series of skinning, the staff, new tools, new ways of working, while it takes currently, I'm working for a notch, electronics distributor, one of the largest in the world, I think in a billion.</p><p>Dollar turnover annually and very large owned by an even bigger group based out of the U S is about 20 billion in turnover. So yes, it's probably the largest eCommerce tire work group today, 43 countries and, millions of visits a day. Very large B to B commerce, which is not one I've done a whole lot of previously.</p><p>So that's been a little bit of a learning curve also as well as, really electrical engineering products and our multimeters and instead of scopes and, a, And I know about fashion products working on fashion sites that are about domestic steam, as well as by using consumable sites.</p><p>But I don't, I'm not an electrical engineer. I don't not, I don't know one more to meet promoter. I don't own a set of scope from motivator, et cetera, I think wants to do with voltages. But, so it's yeah, it's hard to optimize a product, nothing about the challenge. </p><p>Guido X Jansen: [00:04:41] Was he often come in with teams, dads don't do any experimentation at all.</p><p>I want to start with it or is it more like improving teams that are already. Experimenting with getting stuck somehow. </p><p>Amrdeep Athwal: [00:04:53] Yeah. So she used the teams that are already doing thumb experimentation, but they, they want to grow faster. They want to do more experiments, more wins. They want bigger wins. I've done a few where they've do zero experimentation and.</p><p>I think the time lag between, I think they think you can start, as I mentioned tomorrow, what is that? no, you've got to get the tool. You've got to get all the data, You've got to get all your tracking and panting, Because how are you going to measure everything? how are you going to optimize it?</p><p>The, you can't mention it. yeah. There's so much work that goes into it. And you could be there six months or say, Malware, registrar testing, because you've got the data in the store, you've got all your trucks, you've got a tool that works or you think it should work. And you've got the necessary skills in house to actually build test, because if you haven't outsourced everything, then that's probably an equally.</p><p>Either. And if, relying on a consultant is only going to be there for a few months, then what happens when you go, who's going to take over the reigns and a lot of the time I've, you go away, you come back and check on them again later. They're like, what happened? Oh, we had no one to look after it, so we didn't do it.</p><p>It just didn't really work for us. It didn't work because we didn't carry on. </p><p>Guido X Jansen: [00:06:02] I wonder, do you, why do people hire you? So what's their initial reason of hiring you and then. And then second step. I can part of the question, when you started working for them, what's actually the bottleneck. what do you find was actually the issue that they are, that they're struggling?</p><p>Amrdeep Athwal: [00:06:20] I think people ha CRO same as the higher STRP for SEO people. They want more traffic. Yeah, people, they want more revenue from that traffic and that's essentially it. They wanted a better conversion rate. we're converting at 3%. We want 5%, current, 5% are going to be compared to 10. </p><p>Guido X Jansen: [00:06:37] So you say just fire your SEO person and your conversion will go up less.</p><p>Yeah. </p><p>Amrdeep Athwal: [00:06:43] I've actually started, if all you cared about and it was a conversion rate, that was that right. Let's exclude all the bounced visits. There you go. That's 50% increase. There you go. That's simple way to do it. but yeah, so it's revenue, it tends to be, they want you to increase the revenue.</p><p>it's different client clients. Some clients are, I want my year on year revenue to be increased. I want my profitability to be increased. I want, and it depends what they're trying to detach. Cause you know of the situation where someone's. God business that we wouldn't get for a few years, they're looking to sell and retire to which case they needed to make as much revenue as possible.</p><p>They don't really care about profit. They're like, great. we'll do incentivization and we'll do discounting. We'll do everything we can do to drive as much stuff as possible. But the books and the companies are like, you know what? This can be. The side business that I wanted to be my full time business.</p><p>I needed to make profit as much as possible. So it's a, it's very different, but yeah, it's at the end of the day, it tends to be, they want more money in one shape or another. I think the biggest bottleneck for a lot of organizations is, they've heard the term, they know it's about running experiments, but they don't how'd you get started, they've tried maybe changing the button, color changing image, and you're like, Oh, it didn't work.</p><p>I think happened Cause. Yeah, you're just testing random things. You don't have a hypothesis, you don't have any data. You don't have UX, you don't have user research. All you've got is a tool and George's changing things around them and, cross your fingers. Now, the best words, AB testing CRO is follows.</p><p>The scientific presence for is that you need to have. A theory that you are testing out. If the test doesn't work, then that showed you that theory is incorrect. So there's a, either a gap in your knowledge, or you've disproved as something works at some point, you know what? It should be orange. Okay. You tested it out.</p><p>It didn't work. you proved that you're watching, shouldn't be orange. You can say that. And having the best color of your buttons is no, you haven't. so I think there's that the biggest gap I sent is that the users, who wants to start optimizing. They just don't know where to start on how to do it, Don now the best way to do it.</p><p>they lacked probably some of the rigor that they should be when they're running tests or, all the bad stuff we know about stopping tests early, not having enough sample size, not having enough conversions. And yeah, it's a learning curve. It's a massive learning curve to get them skilled, to understand, why you follow this best practice.</p><p>Why do you. That's how things so rigidly, why do you say, look, this is 88%. Surely we could just leave it running for the week and more competency, but that's not what you do. And this is why you don't do that. so it's, I think that's the biggest bottleneck hide find is that it's a lack of knowledge first.</p><p>And then once you have the knowledge, it's the resource and students can build the test. Who's going to curate the tests. Who's going to analyze the results. he was going to implement the windows on my site. cause most times, the dev teams are already stretched to capacity and then you ask them to do additional work on top of what you're doing.</p><p>Ask the QA is to distal Dwayne of tests, which can, test can break things so easily when you inject your drops. so I think, yeah, to me, the two bottlenecks, the beginning is the knowledge gap. As it's going on. It's that resource to actually get things built to lie and liars implemented. That's for me, whether the two issues tend to be time and time.</p><p>Again, every organization I've been to </p><p>Guido X Jansen: [00:10:12] lack of process, or they have the tool, they know we have a tool, so it should work. I've just start randomly throwing stuff at the tool. And I hope something sticks, but unfortunately it doesn't work always </p><p>Amrdeep Athwal: [00:10:25] well in my work now. And it depends how bad the site is.</p><p>Cause sometimes you would come to a fire truck. Yeah. Yeah. It's such an fine start again. I can't optimize, I can't optimize it, but really just redesigned the whole thing care. There's a basic wire wireframe. Just put that library will guarantee you that will be what you've currently have, but those kind of guys are few and far between a lot of the times it's, they're, they've been testing for a while.</p><p>They might have hit the local maximum and it's we need to change the design because you've got 10 compete together. And so we're trying to be above the fold. that can't work. so you need to change the way their whole look and build the site is to, and incorporate your learnings.</p><p>And what is the most important thing to have that right </p><p>Guido X Jansen: [00:11:06] place marketing mergers have suffered. And the sheriff for AB testing has been impacted too, if you want to keep that thing to enterprise standards, but save 80% on your annual contract, you can consider it. Oh, fertile to go with their summer release.</p><p>You can take advantage of full stack and hybrid </p><p>Amrdeep Athwal: [00:11:24] features, </p><p>Guido X Jansen: [00:11:25] strong privacy compliance, no blink </p><p>Amrdeep Athwal: [00:11:28] and </p><p>Guido X Jansen: [00:11:28] enterprise. Great </p><p>Amrdeep Athwal: [00:11:29] security. </p><p>Guido X Jansen: [00:11:31] Feel good about your smart business decision infest. What you save, backing your CRO program. Check out www adult's over it. Let's go slash 2020, and you already mentioned the knowledge and skills.</p><p>And, so that's a nice segue into our main topic of today because there are a couple of weeks ago, you, you told me, or you mentioned that, that empathy is probably the most important skill for any CRO. So please enlighten us. </p><p>Amrdeep Athwal: [00:12:02] Yeah. So a lot of CRL people, I know like myself start stuff. as analytics, started off with data kind of mindset.</p><p>I read a article. I. Scientific paper that was released. I think it was 2012. Yes, 2012. And what they found was that by doing MRI scans and looking at people's brains, when they were using them perfect parts of the brains, the analytical parts are switched off and vice versa. You cannot do both at the same time.</p><p>You cannot be analytical. You cannot be empathetic, which is why things like, a conman. Can trick a smart person. He makes you empathize with him. Once you start empathizing with him, then your analytical reasoning goes out the window. So one challenge for reason goes out the window and you're like, Oh yes, I believe him.</p><p>But you have no reason to believe. Ms. Story is full of holes. It doesn't make any sense, but you're empathizing because you're empathizing is when you're over now as a CRO person. What you're trying to do is you're trying to. Convince the user to take an action that you would like them to do. So you need to be able to empathize with them.</p><p>Think what they're thinking, feel, what they're thinking, have an idea of the problems. Now. I'm not saying we should be con and trick people into doing stuff that is against the self-interest. No, obviously that'd be unethical. But what I'm saying is, yeah, we need to be able to think and feel like they do otherwise.</p><p>How can we try to steer them in what. Potentially the best for them and potentially what's best for the organization, your work. So this is why I think empathy is probably one of the strongest skills, but it is also one of the hardest ones to use because if you're constantly looking at data and you're constantly looking at user research and being quantitative and qualitative and they are, I understand why that is.</p><p>I see this distinct issue is a problem, distance that a problem statement, or, I can, I've got all this information great. But. How is that user actually feeling, what are their frustrations at each point? how does that actually feel? And there's a few little tricks that I've developed the chubby.</p><p>And one of the ones I always use is, when you are doing some analytical piece of work, don't try it to do your empathy part at the same time, take a break 20 minutes, come back and say, get all of that data. What is your as a theme and what is this group of users field? Why would they be seen in this?</p><p>why would they behave? So segwaying back to our previous conversation, the first project I had was for NCRO was for a cosmetic surgery company. And they asked me to look at their. Restful when patient services. And I was thinking, okay, looking at all the data and looking at what groups of pages are the best engagement.</p><p>And there was one set of pages that had far higher engagement than anything else. And that was the pages about where the hospitals were that did the search. And I thought to myself. that's strange. Why is that then? And then I started reading more about the company about, what made them different from their competitors.</p><p>And one of the key differentiators was that the fact that they had their own hospitals out across the country where you could go. And get your surgery done. And 90% of the UK population was in 30 minutes and I thought that's really important. if I was having surgery, regardless of BNI is cosmetic and actual, I wanted done hall just in case anything happens.</p><p>Family's close by. So come see me, et cetera. I'm not going to have to travel too far. So yes, it's really important job. these hospitals close to where you are. So the simple test I did was a little a call to action with a end of it, which had the little pins of all the hospitals. So people could see all of these are all across the country.</p><p>There's one right next to where I am. and we put that across the site, and this is the experiment that had led to it. A 400% increase. The user has actually gone to the signup page and inquiring about as much surgery and about a hundred percent increase in. He's is actually filling that format. So it wasn't just the next step that up, it was the whole journey and yeah, completely smashed out of the path, but it wouldn't have happened, if I can prevent that user, and that user process.</p><p>And the only way I did that was first time, the data then coming as they can. What does that data actually mean to the user? Why are they behaving? And I think that's why, if you don't have that empathy, he can't generate that for your user. you can burn all the numbers you like, but all you're going to get is what's happening, where it's happening and how often is happening.</p><p>You're never going to get to that. Why </p><p>Guido X Jansen: [00:16:43] what's your favorite, ways of gathering, the more qualitative side. of data on your users, on what they are getting stuck with. there's, this is a great example where you show people the information, whether it's really conscious or not, but the information that they want to know at that time, how close is it?</p><p>How far, or how far is it? so what are your favorite methods or tools to gather this data? </p><p>Amrdeep Athwal: [00:17:08] I love web analytics telling me where things are happening or what stuff new cause that really helps you to focus down because my example, I shot, I said previously, if I had not. Gone down and found the, those pages.</p><p>I couldn't find out, why is this happening? So I think that's what you gotta do is find some user behavior. That's different clients and segment and our set of pages that have much different. Yeah. Changes in KPIs to the rest of the site. Once you find that segment, that group of pages, that group of users, et cetera, then you need to go off and get that one.</p><p>So some of my favorite ones know recording in a scene app we're actually uses of doing on the site. I love heat maps to see where they're picking, where they, trying to click, but there is an active, and surveys are good if they're done correctly. But one, I think. The top one for me, the one I found always most helpful is moderated user testing, because you can access the users.</p><p>This is, why are you doing this? Why, how would you feel about this now? Why wouldn't this work? And I think once you've got all those bits of data, then it, all of those bits of information, and then you understand the feel and how they use it. Do you empathize with them then? It's also about looking at.</p><p>The compactors competitive research is one. I also love as well to find out, This is what the client is doing. This is what everyone else is. Where's the differentiator. How does that solve my user's problem? Once you can do that, you can use that in the news that, the way to use distinctive feeding, you can find out the areas that potentially are.</p><p>Separates you from the rest of them, then you can try to fix those years. Probably. yeah, I think. Main tools. I think ones that most people know about. And, but yeah, I think moderated user testing is probably the best one for me. I think it's just, especially, if you can get, your user profile really tight and you can find this exact type of user, I want, I've even had the case where now worked with a CIA C.</p><p>E O of a company. And he told me, no, this is not a problem. That's not why I use this camera. And then you're actually going to ask 10 users and they all say, yeah, I hate this. So on, this is a big issue for me. And then he was like, Okay. How do we fix this? and so there's no more trying to convince them because you're not just a consultant, but customers are telling these guys what's wrong.</p><p>And I think that's really powerful is when the customer is saying, Hey, your images, I can't see the, to the material on the model or, one of your competitors has video. I can see how the material so I can see is it going to be right for when I go out, my friends. so it's really powerful to get that information, get that in front of the people who make the decisions.</p><p>Guido X Jansen: [00:19:53] Yeah. That's one of the most valuable things coming out of user research. those recorded the videos of frustrated users, combining those in one, one frustration video, and sending that to two managers. And, they quickly want to fix things. Yeah. So what we're talking about empathy, and, of course there's a in, most people are at least familiar with IQ, but there's also our EEQ.</p><p>So for the people amongst us, the more analysts that actually want to measure this is something we can measure all of our cells. We can there's, there are E Q tests out there. If you Google for those will, you, across a couple of them. We want to have more and more empathy, with the users, to improve our work.</p><p>So why do you think, or why, how can they, how can we, develop our empathy? How can we become better at this? </p><p>Amrdeep Athwal: [00:20:41] I think it's, the only way to empathize with your users, statute feel some of their frustrations. And I think one, the key thing that I always do is do what you use to do, but don't just do it once.</p><p>Do it 10, 20 times. I once had to find a intermittent tracking issue in the checkout. In both me actually going all the way through the checkout here in confirmation page and asked you that 20, 30 times, the one day, the things that weren't annoying me, five, 10 times were really good, maybe 20 or 30 times.</p><p>so then I was thinking, actually our users aren't as familiar with the website as I am. So what annoys me after 30 times is what annoys them after the first call. And that's when you quickly start taking tests. That's really bad. That's so annoying. I hate that. Why do I have to do this every time like that as you get used to the foibles of your website, because you have to enter the address in this way.</p><p>Otherwise it doesn't work. No. Why should that be like that? Why should you have to enter your postcode in without a rat spaces? Because every other website caters for it, not, you find tricks to make your website work after you've been using it for a number of. Days even, or weeks, but users you're coming there for the first time or users.</p><p>You don't use your website by 8,000 a day. And like you do aren't wherever all these tricks, aren't where all the different features and products, you try doing it the way they are doing it. So you use your, you just session recording to say, this is how they are entering in different products.</p><p>one item at a time when I to buy one item at a time, rather than using a bulk upload to generate 900. It gets really annoying. Why aren't they using the poker platoon? Because they don't know everything it a certain way in the navigation. There's nothing to tell them that it's there. Here's this great peach that does exactly what you're trying to do, but yeah.</p><p>Can, when someone is entering in a hundred different products and searching for them one by one, you can flag up, Hey, did you know. If we put this great upload tool, you just paste everything in your list. Then you can add it all into the car at one goal, rather than searching one by one.</p><p>and it's, we forget that our users. Art experts or our website. We assume everybody has the same math knowledge that we do. And I think that's why, empathy goes very closely with one of my big things in Seattle, which is clarity. Everything should be as clear as possible. you shouldn't have to.</p><p>Think about what the next step is, what happens if I click this button, how do I do this? It should just be there. It should just work right this time. It should work exactly how you want to do if I'm tabbing through the site that should work too in our might not be using in my mouse because I've got to take my hands off the keyboard.</p><p>That's how you got to do it. You've got to make it as good for every user as possible. And the only way you can do that is. If you try to do things the way they do it, if you try to mimic their struggles, I think mimicry is a really powerful way to increase empathy because by mimic actions, you can start, build up.</p><p>the empathy to them because you're actually doing what they're doing. Get, literally walking a mile in their shoes, which is the saying that comes along with empathy </p><p>Guido X Jansen: [00:23:52] for over 10 years. Now, all my diet of advisors about evidence-based conversion optimization with a focus on data and psychology.</p><p>We see that analyzing data and recognizing customer behavior results in a better online dialogue with your clients and a higher ROI </p><p>Amrdeep Athwal: [00:24:07] that team </p><p>Guido X Jansen: [00:24:08] of strategists, analysts, psychologists, and UX specialists. Gathering valuable insights in your online behavior of your visitors, gather with you optimize the difference elements of your Ciro program.</p><p>We designed expert reviews, AB test and behavioral analysis. For more information about their services, go to Oman dialogue besides looking at the, at your website and basically becoming your own customer as a business. What you're saying. </p><p>Amrdeep Athwal: [00:24:34] Yeah, </p><p>Guido X Jansen: [00:24:35] essentially. So besides your, the website, would it be other ways of developing your empathy?</p><p>Amrdeep Athwal: [00:24:40] Yeah, so some of the, pork into customers is really great. I think if you can get into the mindset, that's what empathy is literally is. Can you feel the way. Let's do, so one way is to mimic their actions, usual website. They can post them. The other way is to actually find out as much as batch customer as possible.</p><p>Cause if you can stand who they are and what drives them, what motivates them. So the classic one is customer personas. If you have really good customer personas then yeah. that is your empathy right there. That is who they are. What are their struggles? What are their pain points? What are they trying to do?</p><p>What could hold them back? So that's a really good way to develop empathy, be, have to think and feel as customers. If you have a, everyone or your user types on the site, then you have. No, that's a shortcut to get in there. I think that's something that people miss with music is they've tried to build a use of someone, very, very task focused.</p><p>Rather than this is what the use of feels. This is what frustrates them. This is where the lack of knowledge is. So I might be, let's take myself. If I am buying something on behalf and engineer on my current clients website, I am not an engineer. I do not know if this one part is the same as that part.</p><p>All I have to go on his apartment. But so if you show me five products, when I search for that part, which one's the right one, one of the same partner, but they might do the same thing. I don't know that because I'm not the expert on that, but the engineer that is my user's chocolate, that is my pain point.</p><p>That is how I amplify it, empathize with that user. But the only way you find that out is by understanding what they're doing, why they're doing it. And like I said, it's really good customer user research that builds up some really strong someone is well, massively help you cook that. Timed down to understanding and empathizing because you've got your right there.</p><p>You've got really solid. let's see the eyes of my brothers brought the book founded by Saunders, great book. And I saw only about 70 pages as well. So you can read it like an hour, and that tells you how you should build your personas, why they're so important because. As soon as you start building dollars, bam, you can empathize instantly go, right?</p><p>This is John he's the CEO. This is what his issues are. This is James, the engineer. This is why he isn't sure that this is, Tom buyer. This is what he says, this is why he's thinking of bidding, but what might make him stop? But I think, yeah, really good. someone has a massive shortcut to the </p><p>Guido X Jansen: [00:27:14] empathy.</p><p>Sirens are a nice way to put yourself in someone else's shoes. And that's what empathy is about. You need to, be able to imagine how it is to be someone else. So basically you need to tune down your own feelings and your own, opinions about stuff and be very aware of the biases and how others might think of or how others might see stuff.</p><p>So putting yourself. maybe, in uncomfortable situations with people that think differently than you, or think differently about certain topics, that's going to help you thighs with more and more people's thing. Yeah. But from their perspective, it's a different situation now. I clearly remember, before starting my study in psychology.</p><p>someone thought so most psychologists not. So I did, applied cognitive psychology. Was which more usability aside then? Of course the more, no I'm part of psychology, clinical psychology. I spoke to someone and he said, yeah, it's weird when you start you doing, psychology cause of the empathy part also because before you studied psychology or if you don't haven't, read into psychology at all, when you hear about someone doing really bad behavior, like you hear about, rape crimes or, all kinds of bad behavior.</p><p>normal people will say, Oh, that's horrible. Put them in jail. and that's never talked to them again. if you studied psychology, you would say, Hey, that's interesting. I wonder about his childhood. What do they do? What's happening to him? Why is he doing his relationship with his mother?</p><p>Amrdeep Athwal: [00:28:44] Yeah, exactly. And it's cheap and you start to </p><p>Guido X Jansen: [00:28:47] empathize. I said that might be a bit too much. </p><p>Amrdeep Athwal: [00:28:50] Yeah, my wife had this, we had this similar arms being upstairs. You're watching a show about psychopaths and I was like, the psychopath isn't doing something bad per se, because obviously they might go and cause about serial killers.</p><p>They might be going back to people, it's. To him, it's not malicious. Cause he has no empathy with his victims. he's not doing it to her, he's doing it for his own selfish needs. So yes, it's very, it's a very selfish thing he's doing, but he, he lacks the ability to feel them relax it most.</p><p>That's why he's doing these kinds of things, as well as the bad childhood, the bad upbringing, et cetera, some genetic component as well. But, yeah. You can't judge a psychopath by it, normally moral standards because it doesn't apply to them. We have not templatized the people. We feel bad if we hurt them.</p><p>And I say, They lack that. So of course, if you lack that self control mechanism, you're potentially going off the deep end. So although there are some very successful psychopaths do really well or, hedge fund managers, surgeons, military people. And it's, I think the upbringing massive X big difference.</p><p>Guido X Jansen: [00:30:02] One of my favorite tools to, and to instill a bit more empathy in people is. talking about, cognitive biases or teaching them about that or just having them read about it. Cause it's well, I think it's, most people find it's fun to do because it's a confrontational. So with your own thoughts or your own decision making processes working, but also helps you, think about, Hey, he is doing, or he or she is making this decision.</p><p>Oh, Hey, I've read about this bias. it might be that. Yeah. </p><p>Amrdeep Athwal: [00:30:29] And something I tried to take train into my teams is how do you spot confirmation bias? Because everybody wants to find stuff that proves that. So when you look at test results, for example, that it's really easy to find the KPI that your test optimized, or find a, a segment where I did really well.</p><p>But actually if you haven't predetermined that then yeah. You're, you are just. Pulling into the confirmation bias trap. I just find that works. I think it goes back to an earlier time because that, when you're committed to organizations that you find happens a lot because they don't have that process.</p><p>So then the confirmation bias is in full effect, then, I'll hold my hands up to as well. I still fall guilty to this as well. I felt lucky, I've planned out my chest and said, my KPI is at the basket of my secretary KPI it's quarters. I have not talked to my AOV. I'm not poked my room near.</p><p>So when I see AOV of revenue go off, I'm like, ah, I really want to call the test and that, but no, I can't because I'm already aye. it's really Siki and it's really hard because when you are invested in something, you really want to prove that yes, I got it. I want that way. And you want that endorphin from a big resort.</p><p>And, so this is why, yeah, it's massively hard to combat from these biases because they're so ingrained into our psyches. They're like mental shortcuts, aren't they? So you know this as a. But it was like hands meant to show up shortcuts to cut down on thinking that it's something that the human brain is hardwired to try to avoid is to cut down to thinking you be very </p><p>Guido X Jansen: [00:32:01] emotive.</p><p>Yeah. Thinking is really expensive for your brain. So it wants to save as much energy as possible. </p><p>Amrdeep Athwal: [00:32:08] I think I've read somewhere that your brain needs is something like 20% of your calories, even though it makes up about 4% of your body weight. But I was like, wow. The brain is such a hungry machine.</p><p>Guido X Jansen: [00:32:17] It's like a T 20 Watts, a light bulb. That's the energy equivalent of your brain. Yeah. </p><p>Amrdeep Athwal: [00:32:22] Yeah. So it's, it's massively diff massively difficult to avoid taking, mulching responses. And this is why going back to the empathy is. We think everybody's behaving analytically. I'm going to choose this product because it's better than this product, but actually emotionally, I want that one because it looks nice.</p><p>It's going to fit better on my coffee table. that's the motive, but a standard school, we see people are behaving and purchasing and they're being emotive. So if you can't get inside the mind, how can you then apply to that behavior? because that. stereo might pitch in very nice to decor, but it's not as good as this lovely silver one.</p><p>did you also know it could be a black, but if all you care about is, Hey, look, this has got 500 Watts. This one's already got 10 Watts. but they really liked the color black and they can't see how to change the color on the 501. They're not going to do it. So this is why I said, if we don't get into the emotive part, find what drives you, what has bacon, what is helping them to make these decisions, these mental shortcuts, these emotional responses.</p><p>Then you can't optimize that if you're literally only going by data, when you go to my information, if you want to stay in their box. Purchasing decisions and it's combined set &nbsp;user behavior </p><p>Guido X Jansen: [00:33:43] by spec offer say worldwide unique AB testing, personalization and product recommendation solution sites, paperworks to service sides without any tags or scripts, which guarantees an optimal performance.</p><p>The SiteSpect solution eliminates delays and the chance of any flickering effects. And this approach also ensures that the current and future brows, stretcher rules like ATP and ATP, don't make an impact on your AB testing and personalization </p><p>Amrdeep Athwal: [00:34:10] for more info, </p><p>Guido X Jansen: [00:34:10] visit &nbsp;dot com and developing your empathy.</p><p>It's a double at short. It also works inside the company that you're working for, when presenting those results. And I've made this mistake many times myself by presenting the data. And then not taking into account more emotional, part of the story. And then people rejecting the most incredible, AB test results because they didn't believe in it somehow, or it didn't resonate with their, their emotions around it or their beliefs around it.</p><p>And then, rejecting, Whatever I came up with. so that's, like I said, it's double at short. It also works developing the empathy. It helps you, within your own company or as a consultant, the company that you work for, internally to become a better, become better as you grow. </p><p>Amrdeep Athwal: [00:34:56] Yes. I think Claire, we very much, the buzzword for the last few years around data has been storytelling.</p><p>and what is our story? Our story is what's happened. It's about to journey. you start off with the antagonist, the protagonist, they go through some kind of adventures. Eventually they get to the other side and they get the just reward for following the right path. what is a journey?</p><p>it's a roller coaster of emotions. You need to have highs and laws and you need to be able to take your user in this case. Whoever you're pitching your test results to, which is why, I started off my career because I'm very analytical, just showing here's a bar chart is a table. This is the data on tie.</p><p>I'm going to play soul clever people. People just didn't get to. Nike said, I'm not so sure you might need to double check that one, but then you start telling the story. And say hi, so we have this idea and then we did this user research and then we went and, we went and got the salad and we spoke to, I use the snow.</p><p>Yes. I really hate you when this happened. So we would post what's the best way to do we try these different approaches and you take them through that whole journey and you walk them through every step of it. Step by step. Eventually they get to the, get to the promised land and then you realize that and they're like, Oh yes.</p><p>Great. Yeah, I can totally see all the different bits of that. And you've led them through and walk through. And you've told them the story about all the trials and tribulations, all the failures that you had in T bunch, they got white one because, as you people, we tend to just say, Hey, these are the winners.</p><p>And we don't show you that the 10 tests the last to get back. But if you got to show those happy new year, Your, your, product holders and the you CEO's through that journey and show. This is exactly how we got there. These are the trials and tribulations. And how can you tell that story about, or the bad stuff as well as the good stuff?</p><p>Guido X Jansen: [00:36:47] Exactly. Please. Don't forget about it, people. so thank you so much for taking us through your, thoughts about the empathy. w what are your, what are the things you are going to do in the next 12 months? What are you working on? </p><p>Amrdeep Athwal: [00:36:58] yeah, I think to the, I'm working with my current client at the end of the year, and optimizing their sites across the three main regions, North America, Europe, and APAC.</p><p>so we've got a very full. That's in psycho and they've just moved into working agile. So that's really good as well. So helping them with agile ways of working and, personally myself, I think, getting to lock down, hopefully going on a holiday at some point. luckily yeah, in January.</p><p>And then obviously the last time it happened two months later. So at least my having a holiday yet. and my daughter's looking back to going back to school in September. So that would be, yeah. In terms of work next year, we'll see, I'll find it with the client, worked in the industry.</p><p>I've been doing some work with the crap COVID-19 initiative of getting CRL people and being given away an hour of the time as a time, but we could, etc. So working with a few organizations or with an SEO company in Holland, and help them out and gave them some bias. Some also worked with some, A financial services company is donating my time when, cause I thought it's, it's a difficult situation.</p><p>Everybody needs to improve the conversions. Everyone needs to try to make more money, less traffic. most people Amazon's doing really well. I see share prices up 50% year on year. so Jeff Bezos is doing very well for himself. I think he's increased his net worth by about 50 billion down. someone's doing good.</p><p>Okay. But I think there's a lot of people that are struggling. So yeah, I'm trying to do a little bit more of that. Trying to give more back to the community. I was really looking forward to going to commercial tow in November. my favorite conference, I've been in the last four years in a row, but, I don't think it's going to happen this year.</p><p>I'm not managed to go to any conferences. This dad wants to encapsule, but, that's a big shame for me. </p><p>Guido X Jansen: [00:38:58] Yeah. We, what goes on the crap initiative for COVID-19, force heroes. And now if you want to listen to that one, we will link to that in the show notes. And as a final question, any bullshit, like the tip to our audience?</p><p>Amrdeep Athwal: [00:39:12] Yeah. So I've got a couple, I think one was by Nate silver, if you don't know Nate silver and he wants five 38, it's a website that analyzes sports politics and to the science, very data heavy. and he goes into his books is called, I believe he's called and the noise, the signal that is sent by our town.</p><p>Do we separate the signal, the insights from all the noise that we have, you have so much data. You have too much of it. How do we get. What's right now is that action equals to a different examples of where this lack of ability to separate by noise as close to the issue. So I haven't seen from, the big housing market crash caused by or the overleveraging of the banks to, September 11th to, to other bits as well.</p><p>So he walks us through the science as far as involved in, how do you separate noise from data, which is what's the role of people is really important to come back for me. You're essentially trying to do. What is an actual result and what is just noise? so yeah, that's one of my favorite books that I probably read we about once a year, just cause there's so many nuggets in there that it's hard to function for the role.</p><p>Guido X Jansen: [00:40:27] We'll definitely link to that book in the show notes and more. Thank you so much for joining us in the rock face podcast. Thank you very much. Love to talk to you soon and have a good day. Bye bye. Which concludes season two, episode 30, one of this hero cafes, both guys with AMR, Dave Atwell. If you're interested in promoting your production of services to the best heroes in the world, </p><p>Amrdeep Athwal: [00:40:49] at least they can look at </p><p>Guido X Jansen: [00:40:50] zero.cafe/parking lot to see how we can collaborate.</p><p>And although we started out as a ditch podcast, I can fully understand that you want to skip all the district gobbledygook, please go to zero dot &nbsp;English episodes and to subscribe, to get notified about</p><p>next year, which episode, isn't it. Two weeks in which I talked with expo and founder of experimentation zone, ADA Davis. And in that episode, Ruby talking about. I leveling up your user research and a why and how you can make creativity, a priority process book to the next episode you optimize it.</p><p>‍</p>",
  "show_notes": "<ul><li><a href=\"https://www.convert.com/blog/business-strategy/optimize-for-consumer-confidence-survive-recession/\" target=\"_blank\">Consumer Confidence: The KPI Your Business Should Optimize For In This Pandemic</a></li></ul>",
  "guests": [
    {
      "id": "amrdeep-athwal",
      "name": "amrdeep-athwal",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "en",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/why-empathy-is-probably-the-most-important-skill-for-any-cro-pro.jpeg",
  "language": "en",
  "type": "podcast"
}