{
  "id": "je-startup-sturen-op-kwalitatieve-data",
  "title": "Je startup sturen op kwalitatieve data",
  "description": "We leren hoe ze bij het B2C bezorgplatform Instant kwalitatieve data verzamelen en dit inzetten om continu hun dienstverlening te verbeteren.",
  "date": "2025-01-10T20:38:14.578Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/3191ece7/7c7403d1.mp3",
  "transcript_url": "<p>Guido: Ja Rick leuk dat we je hier in het café mogen ontvangen. ‘Instant’ is jouw eerste startup en ik ben dan wel even benieuwd wat jouw ervaring is die jij op hebt gedaan tot nu toe en hoe je dat nu inzet bij je startup. </p><p>Rick: Ja Guido, bedankt voor de uitnodiging. Altijd leuk om dit te doen. Ik ben de laatste zeven jaar CMO geweest van snelgroeiende startups. Ik heb vaak de commerciële kant gedaan, van bedrijven die vaak klein zijn begonnen en daarna snel zijn doorgegroeid.</p><p>In 2013 ben ik begonnen bij Helloprint, een platform voor drukkerijen die eigenlijk verschillende drukkerij faciliteiten uit heel Europa combineert met de vraag van consumenten.</p><p>toen ik daar begon waren we daar met zijn zevenen. Ik denk één van de beste founding teams die er bestaat, een heel sterk team. Daar ben ik verantwoordelijk geweest voor de commerciële afdelingen marketing, sales en accountmanagement, en heel snel gegroeid in vier jaar tijd, van bijna niks naar 60 miljoen euro omzet, dus dat is een hele mooie reis en ik heb ook heel veel kunnen leren. </p><p>Toen ben ik in 2017 begonnen bij United Wardrobe, een tweedehands marktplaats voor fashion vooral voor vrouwen tussen de 15 en 25. Daar heb ik afgelopen jaar gewerkt, ook enorm veel geleerd, enorm veel zin gehad maar uiteindelijk was het begin dit jaar tijd om daar ook weg te gaan. Dus dat is een beetje wat ik gedaan heb eigenlijk. </p><p>Guido: Ja en je hebt natuurlijk een kindje gekregen in December, dat doet je je carrière evalueren..</p><p>Rick: Ja nou, een kindje krijgen, dat zou jij ongetwijfeld ook beamen, zorgt ervoor dat je alles, maar letterlijk alles nog meer in perspectief komt te staan. Voor mijzelf legt ook nog wel de druk wat hoger op alle andere dingen die je in je leven hebt. En wordt het al zonde als je daar ook niet het maximale vanuit haalt omdat je altijd een alternatief hebt en dat is namelijk met die kleine zijn. Dus kun je van de dingen die je toch moet doen, namelijk werken, iets maken die je heel leuk vindt om te doen, dat zorgt ervoor dat ze heel erg leuk zijn en dat je er heel veel energie van krijgt. En dat is best een hoop veranderd inderdaad, het heeft ook wel de druk op alle andere delen van het leven verhoogd en ook de last een stuk omhoog gelegd.&nbsp;</p><p>Guido: Ik heb nog een vraag over wat je net zei, je zei net, en ik benieuwd of je dat ook hebt toegepast bij je nieuwe uitdaging. Je zei dat bij Helloprint dat jullie hadden een beetje de perfecte startup team. Waarom was dat de perfecte team en hoe zag dat eruit? </p><p>Rick: Ik denk dat de basis van dat heel sterke founding team was dat er een hele goede persoonlijke match was tussen de personen die erbij waren. Alle skill sets waren in dat team aanwezig. We vulden elkaar goed aan. Maar ik denk vooral dat heel veel met elkaar samen werken en ook heel erg elkaar de waarheid vertellen wanneer het nodig was maar elkaar ook aanvullen en heel veel snelheid maken. En dat was denk ik de kracht waarom Helloprint, zeker in de eerste 3-4 jaar enorm snel is gegaan en enorm veel stappen kon maken.</p><p>Guido: En daar ben ik wel benieuwd naar hoe je dat nu hebt toegepast bij wat je nu aan het doen bent natuurlijk. Maar voor dat we het daarover gaan hebben, hebben we wel wat context nodig natuurlijk, wat ben je begonnen? </p><p>Rick: Ja, samen met mijn compagnon Dex, zijn wij twee weken geleden ons bezorg platform voor versspecialisten in Den Haag gelanceerd. Dus kan de klant al zijn versboodschappen bestellen in één keer, dus ook van meerdere winkels tegelijk. En dan nog dezelfde dag bij hun thuis bezorgd krijgen met een tijdvak van een half uur. Dus kan je een stuk vlees van de slager bestellen, stukje vis van de visboer, brood van de lokale bakker en een stukje kaas bij de kaasboer en dat nog dezelfde dag bezorgd krijgen. We zijn eigenlijk een soort combinatie van Marqt met een ‘q’, Thuisbezorgd en Picnic. Je hebt de hoge kwaliteit van producten van de Marqt, de snelheid en flexibiliteit van Thuisbezorgd dat je het kan hebben wanneer en waar je maar wilt en door dat we wel bezorgingen kunnen combineren, dus mensen moeten een klein beetje vooruit plannen, hebben we de operationele excellentie van Picnic in feiten. En dat maakt het model al heel sterk, dat we drie grootmachten hebben en daar een soort van beste combinatie van te maken dus daar heb ik veel vertrouw in. Heel veel winkeliers gesproken, heel veel klanten gesproken, heel veel industrie experts gesproken en iedereen is eigenlijk lovend en nu is het dus mogelijk te laten zien dat het daadwerkelijk een goed model is en dat is heel leuk, en ook heel erg spannend.</p><p>Guido: Ja. En hoe ben je in vredesnaam daarmee begonnen? Want er is sowieso wel wat concurrentie op deze markt natuurlijk. Je noemde al drie partijen die daar misschien op lijken. Volgens mij zijn er ook wat andere supermarkten bezig met hun eigen bezorgdiensten, wat ook verder uit te breiden naar vers en dat soort dingen. Dus hoe ben je begonnen bij het ontwikkelen van dit concept, dat je dacht ja waar zit dat gaat nog in die markt? </p><p>Rick: Ja, zeker dat is een hele goede vraag en het beste antwoord daarop is een heel lang antwoord want er is best een lang proces geweest, hoe we daar gekomen zijn.</p><p>Guido: Je hebt onderzoek gedaan! </p><p>Rick: Het begint altijd bij jezelf als ondernemer, als je iets nieuws wilt beginnen moet je altijd beginnen met in jezelf kijken en goed van jezelf begrijpen waar je een hoop interesses hebt zitten en waarin je het echt voor je ziet dat je de komende tien jaar mee bezig kan zijn. Dat is denk ik belangrijk om mee te beginnen. De onderzoek die we gedaan hebben was heel diep naar de markt te kijken. Dus alles lezen over de markten, precies begrijpen hoe bepaalde concurrenten werken, precies weten wat er gebeurt in elke markt, precies weten wat de sterktes en zwaktes zijn van bepaalde concurrenten. We hebben heel veel mensen gesproken, wat ik zei: tientallen lokale winkels, tientallen consumenten, potentiële klanten, tientallen industrie experts. En dan is het soort van een puzzel leggen met alle informatie die je hebt en hopelijk komt die puzzel uit en zo niet, moet je dan misschien wat puzzel stukjes vervangen of aanpassen of uiteindelijk op zoek gaan naar een andere puzzel om te maken. Dus dat is een beetje hoe we hierop gekomen zijn, door heel diep te duiken in de markt. Je hebt heel veel verschillende modellen en dat is eigenlijk te vergelijken met het probleem van lokale winkels nu en van consumenten en wij moeten kijken hoe we dat kunnen oplossen. </p><p>Guido: Maar je had vast wel een bepaalde idee al over hoe je bedrijf eruit zou zien of wat jullie zouden doen. Hoe kwamen jullie bijvoorbeeld bij vers producten? Stond dat al vast dan van tevoren? Of hebben jullie gewoon met zijn tweeën in een café gezeten en dachten ‘wij gaan samen een bedrijf beginnen, we hebben geen flauw idee wat, we kunnen autos verkopen, we kunnen verzekering gaan doen, we kunnen vers producten doen’ &nbsp;of was dat iets verder ingekaderd voordat jullie begonnen? </p><p>Rick: Tot op een bepaalde hoogte wel maar tot een bepaalde hoogte ook niet. Toen we bij ons zelf heel erg van binnen zijn gaan kijken wat ons nou echt interesseerde maar ook waar we wel goed in waren en misschien ook wel beter dan de anderen. Toen kwamen we al snel uit dat we een hoge interesse hadden in On-Demand delivery markt. Ik ben op zekere hoogte enorm lui en hou enorm van gemak en zie daar enorm veel kansen voor de personen zoals ik en die heel graag zouden betalen voor iets wat ze niet zelf willen doen. Of dat nou boodschappen zijn of iets anders laten bezorgen of huishouden of wat dan ook om dit te laten doen op het moment dat je het nodig hebt. Dus daar is het eigenlijk begonnen, waar we heel veel interesse in hadden en toen zijn we dieper gaan duiken in hoe die markt in elkaar steekt. Hoe steekt die markt in elkaar in Zuid-Oost Azië? Hoe steekt die markt in elkaar in de VS? Wat zijn de Europese spelers die daar in actief zijn? Wat doen ze wel goed, wat doen ze niet goed? Waar voelen we ons heel erg mee verbonden? Waar liggen misschien nog wel kansen? Zowel voor een lokale winkelier waar we een bepaalde actie hebben, als natuurlijk voor de klant, als ook voor ons businessmodel uiteindelijk, want uiteindelijk moet het wel uitkomen en genoeg marge zijn om genoeg te schalen.</p><p>Guido: Ik vind het wel mooi dat zo’n idee geboren uit luiheid, dat zijn eigenlijk de beste ideeën denk ik?</p><p>Rick: Ja en misschien is het dat ik heel erg van gemak houd, dat is een betere benaming dan lui.</p><p>Guido: Hoe kan ik het mezelf zo makkelijk mogelijk maken?</p><p>Rick: Misschien tot op een bepaalde hoogte ook luiheid, hoor.</p><p>Guido: Dan heb je zo’n idee, dan heb je wat onderzoek gedaan, enkele weken geleden hebben jullie jullie eerste launch gehad, en hoe hebben jullie toen bepaald waar je begint? Wat is dan MVP (Minimum Viable Product) die dienst die we live kunnen zetten?</p><p>Rick: Ik denk dat het belangrijk is, in plaats van wat onderzoek te doen, heel veel onderzoek te doen. Ik denk dat we bijna de earnings call vanuit Thuisbezorgd met hun aandeelhouders konden doen, toen de nieuwe kwartaalcijfers uitkwamen. Zo goed kenden wij hun model, de cijfers en groeicijfers. Dus we hebben wel bijna weken aan bijna studeren, was het, om in de markt te duiken, precies weten wat de marges zijn in bepaalde segmenten, wat operationele doelen zijn, en daar notities van maken, samenvattingen maken, samenvoegen, en een soort van puzzel leggen. Ik denk dat het heel belangrijk is om heel diep onderzoek te doen, maar op een gegeven moment als je vanuit het onderzoek en door met veel mensen in de markt te praten (klanten, winkels, experts), en de puzzel ook gelegd, dan is het belangrijk om snelheid te maken. Dan is het belangrijk goede beslissingen te maken wanneer dat kan, maar snelheid is dan nog veel belangrijk er dan de juiste keuze maken. Als je veel snelheid kan maken in aanhouden, aanpassen, feedback krijgen en daar weer van te leren. Dus wij hebben ervoor gekozen om in [. &nbsp;] te beginnen, daar hebben we een hele kleine analyse voor gemaakt, dus één straat waar heel veel winkels zitten die heel goed aangeschreven staan. De wijken daaromheen hebben een goed gemiddeld inkomen en zouden goed passen bij deze dienst. Het is geen analyse van dagen of weken geweest. We hebben daar wel wat tijd aan besteed en heel snel de stap gemaakt om een keuze te maken, een product te bouwen, in de markt te gooien, klanten te krijgen die betalen, daarmee te praten en van te leren.</p><p>Guido: En dat gaat dan vooral over waar jullie kunnen leveren. En inhoudelijk de dienst, hoe hebben jullie bepaald wat jullie gaan aanbieden?  Rick: Die allereerste puzzel hebben we gelegd op basis hoe goed we de markt kennen en wat de eerste klanten zeiden. Dan stel je een aantal hypotheses op hoe je denkt dat het werkt. 80 procent van die hypotheses zijn fout en moeten een klein beetje of heel erg aangepast worden. Daar hebben we keuzes in gemaakt, snel gelanceerd, gekozen te starten met een website, 10 winkels in dat gebied aangesloten, zo snel mogelijk producten geupload in de database, een shopje gebouwd op Shopify, daar alle producten en winkels in gezet, de markt in gegooid en gestart met wat promotie. Toen begon het eigenlijk pas en hebben we veel feedback gekregen van klanten. “Ik wil kaas bestellen en ik kan dat alleen als groot stuk bestellen maar juist het voordeel van een lokale kaasboer is dat ie het altijd in stukjes snijdt.” Hele logische dingen waarvan waarschijnlijk zelf achter zou komen als zes tot negen maanden tijd zou besteden om dat onderzoek te doen. Maar we weten ook vrij wel zeker dat je er sneller achter komt door gewoon te lanceren en dat dan van klanten zelf te horen. </p><p>Guido: En hoe verzamelen jullie de feedback van klanten nu? </p><p>Rick: We hebben de regel dat alle feedback die we krijgen moet binnen 48 uur opgelost worden, 80% van de feedback die we tot nu toe hebben gekregen hebben we binnen 24 uur opgelost, dus eigenlijk iets sneller. We doen alle bezorgingen tot nu toe zelf zodat als we de spullen hebben opgehaald enerzijds in de winkel zijn en kijken hoe dat proces gaat en of dat efficiënter moet. We zien dan wel wat mis kan gaan met bezorgen en zeker het goed houden van vers producten van hoge kwaliteit moeten we zorgen dat dat lekker samen komt. Maar eigenlijk is het vooral als we bij de klant thuis komen vragen we altijd of we de boodschappen in de keuken of ergens anders moeten neerzetten en dan proberen we eigenlijk zo lang mogelijk bij de klant te blijven hangen om zoveel mogelijk vragen te stellen over: hoe die ons is leren kennen, heeft ie met andere mensen in de omgeving erover gesproken en hoe vonden ze het dan en wat voor woorden gebruiken ze, hadden we het beter moeten doen? En zo voort. </p><p>Guido: Heb je dan echt een vraaglijstje bij je waar je vinkjes in zet of hoe doe je dat? </p><p>Rick: Het gaat wel een beetje op gevoel en dat gaat met de flow van de klant, ik denk dat het belangrijk is dat het wel heel natuurlijk gaat. Maar soms komt het voor dat we 45 minuten bij de klant thuis blijven hangen dat we dan ook daar koffie drinken met hun en dan eigenlijk de weg vinden om de volgende bestelling te plaatsen. De waarde van dat soort gesprekken, om echt te snappen: hoe doen ze boodschappen bestellen, hoe ziet hun dag eruit, hoe ziet hun week eruit, op welke plekken in hun leven is onze service belangrijk, ja dat is zo waardevol, het is niet in geld uit te drukken hoe waardevol deze inzichten zijn in deze fase. </p><p>Guido: En voor luisteraars om een beetje een idee te geven wat voor producten jullie allemaal verspreiden, jullie hebben verschillende collecties of categorieën op jullie website staan: vis, vlees, maaltijden, groente en fruit, brood en banket, kaas, chocolade, koffie en thee, wijn, voor bij de borrel en cadeaus. De laatste is een beetje een vreemde eend in de bijt toch? Is niet vers, of zijn het verse cadeaus? </p><p>Rick: Dat is een goede. De cadeaus zijn nu in feiten de cadeaus die bij de vers specialist liggen. Dit was precies een stukje dat één van de klanten aangaf, ze had haar vers boodschappen besteld, veel klanten bestellen ook de verse maaltijden die tegenwoordig bij alle vers specialisten &nbsp;liggen, maaltijden zoals spaghetti, stamppot, pasta met vers vis, dat soort maaltijden die eigenlijk veel gezonder zijn dan een wat vettere hap van bijvoorbeeld thuisbezorgd, en heel veel klanten vinden het heel fijn dat wij de boodschappen kunnen bezorgen maar normaal ook dat we iets leveren als een soort ‘eten-boeket’ dat ze het die zaterdag mee kunnen nemen naar een verjaardag. </p><p>Guido: Dus jullie leveren die wel bij diegene die het koopt zeg maar en niet bij diegene waarvoor het cadeau is. </p><p>Rick: Ja klopt, dus we bezorgen het niet aan de ontvanger van het cadeau, dat is wel iets wat we in de toekomst zouden kunnen doen maar in dit geval, geven we het aan de gever van het cadeau die het vaak meteen bestelt met boodschappen en maaltijden en ook meteen gelijk een cadeau wilt geven in de vorm van een doosje bonbons of een thee-boeket of iets wat daarop lijkt. </p><p>Guido: Ja en jullie zijn nu een paar weken live, wat heb je allemaal geleerd en aangepast? </p><p>Rick: Gigantisch veel, zoals ik zei we leggen onszelf altijd de druk op om altijd binnen 48 uur de aanpassingen doorgevoerd te hebben. Bijna op elke dimensie hebben we gigantisch veel geleerd van hoe je contact moet hebben met de lokale winkels en versspecialisten en daar merk je dat alle contact veel beter wordt als je twee of drie bestellingen minimaal per week hebt. Omdat je gewoon wat vaker in de winkel komt, zij zien dat je er bent, zij zien dat je extra omzet brengt en ze denken ook ‘ze zijn nu drie keer per week in de winkel, misschien over een paar weken is dat misschien wel tien keer.’ Dus het is belangrijk ook voor ons dat zij zien dat wij daar langskomen. Dat is een heel belangrijk inzet dat we elke wijk waar in de toekomst gaan lanceren, we zorgen dat elke versspecialist die meedoet zo snel mogelijk op die drie tot vijf bestellingen per week zit. En dan kunnen we stappen maken om het beter in te richten samen met de lokale specialist. Aan de kant van klanten zijn het vaak wat kleinere dingen zoals cadeaus kunnen geven van een boeket van Simon Lévelt kunnen bestellen, kaas, in blokjes of plakjes bestellen, een bepaalde hoeveelheid van een buitenlandse kaas dat je in plaats van een halve kilo maar 100gram bestelt. Maar ook diepere inzichten in hoe mensen boodschappen doen, op welke momenten ze zelf naar winkels toe gaan op zaterdag bijvoorbeeld dat mensen het leuk vinden om even wat bij de slager te halen of bij de visboer of de groenteboer of bij de kaasboer en dat het doordeweeks heel erg druk is, en zeker in combinatie met de sluitingstijden van de versspecialisten, vaak tussen 17u en 18u dat het best wel lastig is om boodschappen lokale te halen na je werk. Dus de inzichten gaan van heel praktisch tot heel alles wat er in de winkel gebeurt. </p><p>Guido: Zoals in het begin van elke startup, dit klinkt nog niet heel erg schaalbaar, hoe gaan jullie het schaalvaarder maken? </p><p>Rick: Dat is een hele belangrijke vraag. Met dit model zouden we op een hele grote schaal moeten opereren, binnen een paar jaar zouden we overal in Den Haag, overal in Nederland en overal in West Europa moeten zitten. Wat we eigenlijk dit jaar al de stappen moeten zetten naar een grote gedeelte van Nederland. Aan de operatie kant moet daar dus heel veel veranderen. Nu halen we de producten op in de winkel zelf en leveren we daarna op naar de klant toe. We zullen uiteindelijk per wijk, bezorg gebied, wat we een network noemen. Dus waar een paar versspecialisten bij elkaar zit en de wijken daaromheen bediend kunnen worden zullen we iets moeten opzetten waar de versspecialist aan het einde van zijn werkdag de producten en de bestellingen kunnen brengen. Wij bepalen wat in de hele bestelling de plan moet worden en dit beschikbaar maken voor die koerier die het gaat bezorgen. En die koerier kan dan meteen tien, vijftien of twintig bestellingen ophalen voor één gedeelte van de stad en daar in één keer de bestellingen bezorgen. Dus die warehouses die worden enorm belangrijk om ervoor te zorgen dat zowel het krijgen van de producten van de versspecialisten schaalbaar is en dat de koerier zo efficient mogelijk, zo snel mogelijk de bestellingen kan brengen, dus dat is een hele belangrijk punt voor de operationele kant. </p><p>Guido: En kan ik dan als ik hier in Amsterdam zit in de toekomst iets uit Den Haag gaan bestellen? <br>Of omgekeerd? Of is het altijd lokale? Hoe gaat dat werken? </p><p>Rick: Ook daar laten we het over aan de vraag van de klant. Ik denk dat het bijna altijd van lokale aan lokale zal zijn maar ik kan me ook voorstellen dat je in de toekomst van lokale naar nationaal gaat. Bijvoorbeeld als er een hele grote vraag is voor de mosselen van Neeltje Jans, die niet uit Amsterdam komen maar die wel een bepaalde kwaliteit keurmerk hebben dan kan ik me voorstellen dat voor bepaalde producten die binnen die definitie vallen dat we die van lokale van nationaal gaan leveren. Ik ga er wel vanuit dat het grootse gedeelte lokale naar lokale is. Dat je dan de beste combinatie hebt van: het is heel vers, maximale flexibiliteit en snelheid van de om het bezorgd te krijgen en dan kunnen we heel goed doelen op een lokale schaal omdat de afstanden van bezorgingen dan heel klein zijn. </p><p>Guido: Ja en dat hele bezorg-netwerk dat bouwen jullie ook zelf of haken jullie in op een bestaand iets? </p><p>Rick: Het komende jaar gaan we dat niet zelf doen omdat we volledig de consumenten en winkel kanten willen ontwikkelen waar genoeg tijd en energie gaan kosten om dat heel goed te doen. In de toekomst zullen we een systeem maken om dan met of vaste medewerkers te gaan werken of met meer het Deliveroo model of UberEats model met freelancers te gaan doen. Van dat laatste zijn we niet een hele grote fan door de druk die je dan op freelancers legt. Wij hebben het voordeel dat we het een stuk efficiënter hebben ingericht en zouden daardoor hopelijk uiteindelijk met vaste medewerkers kunnen werken die we gewoon goed kunnen trainen, goed zijn voor het bedrijf en heel goed snappen wat we doen en welke hoogkwaliteit producten we leveren. Alleen hangt dat wel een beetje van de markt en van de klant af. Terwijl de klant €4,95 blijft betalen voor bezorging dan denk en hoop ik dat het uit kan. Zien we uiteindelijk dat de bezorgkosten om laag moeten om een grote deel van ons doelgroep te bereiken, dan wordt dat een stuk lastiger. </p><p>Guido: Dit is een CRO Café podcast, de meeste mensen proberen experimenten te draaien, hoe gaan jullie daarmee om? Want je had natuurlijk in het begin nog niet veel data. </p><p>Rick: We hebben weinig kwantitatieve data en we doen wel onze best om zoveel mogelijk kwalitatieve data te krijgen. Dit is natuurlijk iets anders en dat is in een andere schaal. Maar uiteindelijk kan je ook bepaalde hypotheses ook goed toetsen aan de hand van kwalitatieve data. Dat is denk ik belangrijk om te doen in deze fase. In deze termen denk ik dat onze P-waarde wat hoger zal liggen dan bij andere partijen die groter zijn en veel meer data hebben. Dus we zullen ook vaker fouten maken omdat we beslissingen maken op basis van kwantitatieve data die bij lange na niet statistisch goed is op kans niveau. </p><p>Guido: Ja want dat één persoon plakjes wilt in plaats van blokjes dat wilt niet zeggen dat iedereen dat wilt. </p><p>Rick: Nee. Precies. Dus in deze fase zijn we heel beperkt op die manier maar in de toekomst wat er veel meer gaat gebeuren, dit is een model wat een grote schaal kan en hopelijk gaat bereiken. En we moeten heel snel toe dat wanneer het basismodel goed genoeg staat en dat zijn we nu aan het aanpassen op basis van kwalitatieve data dat we dan zo snel mogelijk beslissingen met een nog grotere zekerheid maken op basis van de punten van klanten die we binnenkrijgen. </p><p>Guido: Nou mijn volgende vraag, meer over de toekomst, eigenlijk twee vragen in één, waar denk je dat je met Instant gaat staan over twaalf maanden, dat is natuurlijk een lastige want jullie zijn ontzettend agile, de achterkant daarvan, hoe gaan jullie onderzoekmethodes en jullie manieren van werken, hoe zie je dat veranderen in het komend jaar? Om Instant te ontwikkelen. </p><p>Rick: Over twaalf maanden zullen we minimaal in één stad in het buitenland zitten dus we zullen denk ik over een maand of drie naar de eerste andere Nederlands stad gaan en daarna naar de andere grote Nederlandse steden dit jaar. In ieder geval de grote steden in de randstad zullen we dit jaar bedienen. We willen graag nog net voor we de twaalf maanden halen in een grote internationale stad zitten omdat we daar ook gewoon veel moeten leren, hoe die stad werkt, hoe daar de beschikbaarheid en density van lokale versspecialisten is en hoe de klant daarop reageert. Dus die stap willen we snel maken. Als we in een jaar naar die schaal willen dan moeten we ook snel stappen maken wanner we meer kwantitatieve data krijgen, beslissingen maken op het gebied daarvan. Dus aan het einde van dit jaar zullen we zeker een performance marketer of performance marketing teampje hebben staan en een product team. En beide zullen op basis van data en draai van AB testen beslissingen nemen en wat het beste campagnes zijn, wat de beste pagina’s zijn en hoe erop de pagina’s geoptimaliseerd zal worden. </p><p>Guido: En hoe denk je dat jullie dat gaan bepalen, waar jullie gaan uitbreiden, waar komen de factoren komen er allemaal bij kijken? Wat is een goed gebied om naar uit te breiden? </p><p>Rick: Dat is één van de belangrijkste vragen die wij hebben. Ook daar hebben we een paar hypotheses voor. We denken dat het gemiddelde inkomen daar van belangrijk is, de density van versspecialisten heel belangrijk is dus hoe dichtbij zitten meerder versspecialisten bij elkaar? Ook de beschikbaarheid of juist niet-beschikbaarheid van versspecialisten in dat gebied daaromheen. We verwachten dat we misschien wel net zo vaak van de ene wijk naar de andere wijk zullen zien dan in de wijk zelf, omdat juist als je iets mist en het is wat verder weg dat je dan wellicht wil bestellen. Maar dit is iets we heel erg moeten uitzoeken en daarom willen we zo snel mogelijk uitbreiden in Den Haag dat we kunnen zien wat het beste werkt en wat de onderliggende factoren daarvan zijn. Wanneer je in meerdere steden in Nederland en meerdere steden internationaal zit kan je veel beter begrijpen wat zijn de kenmerken en wat zijn de dimensies wat ervoor zorgen dat dit model wel goed werkt op bepaalde plekken en minder goed op andere plekken. Want het zal wel zo zijn dat bepaalde plekken veel soepeler werken dan anderen en wij moeten dan kijken wat die plekken definiëren en laten verschillen van andere plekken. </p><p>Guido: Ja en je zegt je zit nu in één wijk in Den Haag waar de producten vandaan komen. Leveren jullie alleen in die wijk? Want zoals je zegt, afstand speelt wel een rol.. als je er praktisch naast zit dan loop je er misschien wel naar toe maar als het een wijk verder is dan is dat juist de extra incentive. </p><p>Rick: Ja we leveren nu in de wijken daaromheen dus eigenlijk elke inrichting van de wijk waar de versspecialisten vandaan komen. Daar bezorgen we naar toe en daar gaan nu 80% van de bestellingen heen. Dus 20% is in de wijk zelf, 80% is daarbuiten. Dit is denk ik een iets specifieker case omdat de wijk en straat waarin wij begonnen zijn wel echt enorm goed aangeschreven staat in dit hele gebied. Dat zal dan in andere wijken iets minder het geval zijn maar dat geeft wel aan dat het bezorg gebied groter moet zijn dan alleen de wijk zelf. En eigenlijk de drie of vier kilometer om de wijken heen zullen we ook mee moeten pakken. Uiteindelijk moeten we uitvinden wat is nou de perfect balans in hoe groot het moet zijn dat het operationeel interessant is en dat we natuurlijk de klant heel goed kunnen bedienen. </p><p>Guido: En je had het net over dat er in de wijk dan goede versspecialisten moeten zitten, hoe bepalen jullie dat? Gaan jullie alle Google reviews af of zo? Of gaan jullie een week lang proeverij houden zelf?</p><p>Rick: Nou we kregen wel een soort eten mee van de versspecialisten, ze zijn heel blij met ons, zeker als we een aantal bestellingen per week brengen en dan als we aan het eind van de dag een bestelling komen ophalen dan krijgen we best wel vaak een maaltijd mee. Dus dat is een hele mooie benefit wat er bij dit model bij zit. Om in een nieuwe wijk erachter te komen wat de goede winkels zijn gaan we gewoon naar die wijk toe en vragen mensen op straat. En heel vaak krijg je daar dezelfde antwoorden uit en daar maken we short lists van, dan kijken we in google maps wat er daar zit. Dus als je bijvoorbeeld intypt ‘slagers’ dan komen alle slagers in de buurt naar voren, daar maken we een short list van en dan begint eigenlijk ons sales proces. <br>Guido: En die specialisten, waarom zouden die specialisten met jullie in zee gaan?<br>Wat is het voordeel voor hen? </p><p>Rick: Goeie vraag! De wereld is best wel aan het veranderen in een heel snel tempo, waar 1 jaar, 1,5 jaar geleden nog niemand zijn boodschappen online bestelde, is vooral met de intreding van Picnic enorm in een stroomversnelling gegaan. Het wordt steeds normaler om je boodschappen online te bestellen. Alleen merken we dat de klanten enerzijds de convenience heel fijn vinden. Dat is hetzelfde als in de convenience dat in de Albert Heijn alles ligt wat je zoekt, en tot tien uur elke avond in de buurt open is. Maar consumenten missen wel de kwaliteit van de producten van de versspecialisten. Voor versspecialisten is het echter enorm moeilijk om die stap naar online te maken. Het is gewoon een andere skills set en een ander inzicht dan een winkel draaien, klantcontact hebben, goede producten inkopen of zelf maken, en dat in een persoonlijke relatie met de klant te verkopen, om een goed geoptimaliseerde website te ontwikkelen, daar online marketing voor te doen, en zelfs als dat lukt is de vraag hoeveel consumenten uiteindelijk op zoek zullen gaan naar de website van de specifieke slager in een bepaalde straat. Dus het aggregeren van die vraag waardoor je niet op zoek hoeft te gaan naar de specifieke slager, maar naar een platform kan waar je alle versspecialisten op kan vinden, en dus ook al je boodschappen in een keer kan doen van de verschillende winkels, dat maakt het een stuk sterker om die stap naar de consument te maken. De versspecialisten biedt hele mooie producten, maakt daar ook een hele mooie marge op, en is dus ook erg geneigd om wanneer hij een bepaalde kans of juist bedreiging ziet en daar zelf niet op in kan spelen, dan samen kan werken om de juiste stappen wel te maken. Dus het salesconcept gaat eigenlijk heel erg makkelijk. Als we bij een ondernemer in de winkel komen om ons verhaal te doen en te vertellen wat we willen doen en wat we willen bereiken, gaat dat eigenlijk heel makkelijk. We hebben nu een conversie percentage van 75% op de salesgesprekken die we draaien en in die 75% zitten ook de partijen die ondertussen de winkel hebben verkocht, dus ook een paar maanden niet meer bestaan, enzovoort. Dat gaat heel makkelijk om die gesprekken te doen met lokale winkels.</p><p>Guido: En is dat ook je belangrijkste kanaal voor promotie, zijn dat die winkeliers of hoe zorgen jullie ervoor dat mensen &nbsp;jullie naam te horen krijgen? </p><p>Rick: Lokale winkeliers en de promotie die zij doen zijn denk ik initieel belangrijk een belangrijk kanaal als in dat zij het visueel wat sneller kunnen draaien. Ik denk dat zij een multiplier geven aan de marketing en promotie die wij zelf doen. Zelf zullen we een stukje awareness en acquisitie in de funnel moeten doen; daar zit onze ervaring en kennis en dat hebben we altijd gedaan. en dat stukje moeten we heel goed voor mekaar krijgen en een veel vragend platform krijgen. de winkelier kan doordat hij flyers in zijn winkel heeft liggen, met de klant die al in de winkel komt, praten en uitleg geven over het model, dat we op de schermen staan, doordat hij zijn sociale kanalen inzet, daar een heel sterk effect als extraatje aan geven. Wij denken wel dat we een groot gedeelte van de marketing en acquisitie in de beginfase zelf moeten doen. Maar dan zitten deze effecten die net wat sneller gaan draaien, die zitten erin en de effects daarvan op de marketing en promotie die je doet dat scheelt dan heel veel aan efficiëntie en schaalbaarheid wat je kunt bereiken. </p><p>Guido: En hoe doen jullie dat nu dan? Is dat vooral online dat jullie die promotie doen? Moet ik aan advertenties denken? Of gaan jullie alle huizen in die wijk langs met foldertjes? </p><p>Rick: Ja dus in eerst instantie online, dat is het snelste om op te zetten en dan krijg je net wat sneller data terug wat je kan interpreteren. We zien sommige campagnes dat daarin heel goed werken en dat sommige campagnes nog wat werk nodig hebben. Maar we zijn nu ook offline campagnes aan het opzetten en verwachten daar eigenlijk heel veel van. Dit is namelijk een model dat een hoge klant waarde heeft, dat biedt ook de ruimte om een kanaal als PM door to door in te zetten. Het is een model wat iets meer aandacht nodig heeft en wat vertrouw moet trekken bij de consument. Dus promotie deur tot deur lijkt daar best wel goed mee aan te sluiten. Over twee weken gaan we de eerste test mee doen door in de wijken waar we leven of in de wijken daaromheen promotie te doen offline en daar hopen we goede resultaten te zien. Daar hebben we best wel hoge verwachtingen van eigelijk. &nbsp;</p><p>Guido: We hadden dus in het begin dus dat bij HelloPrint een heel goed team zit dan ben ik wel benieuwd hoe je dat nu toepast. <br>Rick: Ja, goede vraag, en dit vind ik één van de lastigste onderdelen die er is. Uiteindelijk komt hier heel veel gevoel bij kijken. Toen ik wegging bij United Wardrobe heb ik heel eventjes de tijd genomen voor mezelf om te bedenken wat ik wilde doen in het volgende stap wat erin belangrijk was. Ik weet dat ik best wel kritisch en eigenwijs ben op veel verschillende onderdelen en dat ik best wel veel nodig heb om uiteindelijk heel veel energie uit een uitdaging te krijgen. Dus het is heel belangrijk voor mij dat er enorm veel potentie inzit en enorm veel competitie in een bedrijf. Maar ik heb ook een hele sterke mening over hoe cultuur moet zijn, hoe kernwaarden binnen een bedrijf moeten werken en best een sterke visie over strategie en visie. Dat maakt het best wel lastig om die combinatie te vinden bij een ander bedrijf. Dus voor mij is ondernemen niet iets wat ik altijd al riep dat ik dat wilde doen en wat ik niet anders kan dan zelf een eigen bedrijf te starten maar meer een soort logisch gevolg van waar ik eigenlijk op zoek ben en wat echt goed bij mij past. Dat is gewoon heel lastig om ergens anders te vinden. Dus is het makkelijker om een model te bedenken waar in ieder geval genoeg potentie en ambitie in zit en daarna de juiste mensen bij te zoeken die daar goed op aansluiten en dan het er samen mee te doen. Dat was het idee. Alleen is dat laatste stap is nog wel een stuk makkelijker dan wat ik eerst dacht. Wij hebben de juiste mensen nodig en ik denk dat ik daar vrij kritisch op ben, mijn verwachtingen van mezelf liggen vrij hoog en bij anderen denk ik ook. Dus dat heeft best wel veel tijd gekost om de juiste personen in te vinden. Ik ben ook op een startup generator programma gejoind negen weken geleden. Dat is een programma dat eigenlijk helpt met de klassieke accelerator programma’s en helpt ondernemers bij het vinden van de juiste cofounders, het verder ontwikkelen van je idee en het ophalen van je eerste investering of funding. Daar ben ik Dirk tegengekomen en dat werkte eigenlijk meteen al heel goed persoonlijk, we vinden het enorm fijn om met elkaar te werken, we kunnen elkaar ook echt een stuk meer snelheid geven dan als we niet met elkaar werken. En we elkaar helemaal compleet kunnen vertrouwen. In het begin hadden we daar best wel veel twijfels over omdat onze skillsets best wel veel op die van elkaar leken, we zitten allebei aan de business side van het spectrum en niet zo aan de technische zijde. Maar na veel samenwerken merkten we toch wel wat verschillen in zaten zowel in persoonlijkheid als aanpak, ervaring, skills en competenties en nu voelt het als het perfecte fit tussen ons twee om dit verder te brengen. We weten dat we nog wel wat skills missen om dit uiteindelijk helemaal door te trekken. We moeten over een paar maanden een hele goede operationele gast bij, of vrouw die ons heel strak weet in te richten. Er moet nog iemand bij aan de electronic zijde en de technische zijde, dat gaan we zeker nodig hebben. Maar voor de komende drie maanden kunnen we dit met zijn tweeën en eventueel wat andere mensen daarbij die ons kunnen ondersteunen echt een goed stuk doortrekken. Dus het is denk ik een heel groot stuk persoonlijk gevoel, kan je met iemand heel goed werken, raak je niet geïrriteerd door iemand, vertrouw je iemand helemaal? Je hoeft nooit dingen te controleren of dubbel te vragen, hebben jullie een goede vibe tussen jullie als personen? En dat is denk ik wel altijd de basis. Want je moet het waarschijnlijk tien jaar lang elke dag, tien uur per dag met elkaar doorbrengen. Als je aan het begin al irriteert aan bepaalde dingen van elkaar dan wordt het denk ik een hele lange niet zo leuk tien jaar. </p><p>Guido: Ja precies, en ja je geeft aan van dat jullie niet beginnen met alle capabilities, jullie zitten allebei aan de business zijde en niet aan de technische zijde, wat zijn dingen die jullie uitbesteden of wat doen jullie nog steeds alles wel zelf? </p><p>Rick: Ja in dit geval doen we alles nog zelf. Ik draai marketing en product, Dirk draait sales en operations. Ik heb meer gedaan met marketing en kon dat in een redelijke termijn doordraaien. Op het gebied van product kan het nu denk ik veel snelheid maken op een beetje een gekke manier om snel dingen te lanceren. Maar we weten 100% zeker dat het na een hele korte termijn dat ik daar niet meer de beste persoon voor ben. Dus daar moet iemand erbij komen voor de website en flows kan nadenken als dat kan implementeren en nieuwe visies kan maken. Dirk doet meer de sales, account management en operations. Dirk kan denk ik voor altijd als het nodig is sales en account management doordraaien. Op een gegeven moment zal hij dat niet meer doen omdat andere dingen veel belangrijker en nodig zijn. Maar Dirk zal op een gegeven moment operations en ik denk ook wel in een periode van 3, 4, 5 maanden dat moeten overdragen omdat ie nog een heel stuk sterker in is. Dus we kunnen in deze fase alles zelf. Het voordeel is dat we met elke onderdeel bezig zijn en uiteindelijk alles in deze fase doen enorm met elkaar te maken heeft dus we kunnen nu de banden even goed leggen. Maar uiteindelijk zullen wij bepaalde onderdelen opgeven omdat we al niet meer de beste zijn. Dan moet er dan betere mensen bij komen die die onderdelen zelfstandig en veel beter kunnen draaien. </p><p>Guido: Ik vind kwantitatief onderzoek doen een heel laag onderdeel van die mix zeg maar en jij zei net al je vindt het belangrijk dat je niet maar een paar onderzoeken doet maar juist dat je heel veel onderzoek doet. Ik vind de mix tussen kwalitatief en kwantitatief onderzoek heel belangrijk. Ja het is leuk dat je google analytics hebt maar dat vertelt nog steeds niet waarom iemand een bepaalde keuze maakt. Aan de andere kant, ik kan wel mensen gaan interviewen dagen lang. Maar ja dan heb ik misschien op een dag zes mensen of twintig mensen maar hoe representatief zijn ze voor een hele doelgroep weet je niet, wat tussen varianten zoals een Hotjar of Usabilla waar je meer bereik mee hebt wat meer kwalitatieve vragen kan stellen. Het is juist naar mijn idee die mix die ervoor zorgt dat je goed kan uitleggen wat er gebeurt dat kan spiegelen van ja ik heb dit gezien in jullie geval als ik binnen loop en zie dat jullie vallen over dat een halve kilo kaas de enige optie is, kan er iemand over klagen, nou prima dan kan je terug gaan naar je data in google analytics. Dan kijk je naar de mensen die kaas bestellen, is dat inderdaad de stap waar ze op afhaken? En juist die combinatie, dat gaat jou verder brengen denk ik. Hoe zorg je ervoor dat je de juiste informatie van de klanten terug krijgt. Als het gaat over die interviews, dat is zoals je zei, redelijk uit gok, je hebt niet een strikte vragenlijst natuurlijk. Ik snap dat het ook niet werkt als je bij iemand binnen stapt. Maar hoe zorg je ervoor dat je op andere manieren nog meer van dat soort informatie structureel binnenkrijgt? </p><p>Rick: Ik denk dat wat jij zegt, dat klopt helemaal, en dat veel mensen denken dat kwalitatief en kwantitatief een soort vervanging van elkaar kunnen zijn, maar dat is denk ik nooit het geval, het is altijd de combinatie van die twee die het heel sterk maakt daarom moet je altijd tot een bepaalde hoogte groeien met wat je hebt. Als er weinig kwantitatieve data is dan moet je misschien wel nog meer kwalitatieve data hebben om wel een schatting te kunnen maken. Maar uiteindelijk is het altijd de combinatie en zelfs op de schaal waar wij nu in zitten kun je al best wel veel dingen uit kwantitatieve data krijgen waar de problemen zitten. En kwantitatief onderzoek helpt denk ik heel vaak bij waar het probleem zit, het uitvinden van wat het probleem is en wat de oplossing zou moeten zijn. In veel gevallen is bij die probleemstelling kwalitatief onderzoek net een stukje beter. Dus wat we nu bijvoorbeeld doen is elke dag kijken op google analytics hoe bepaalde flows gaan en waar mensen vastlopen. Dat is nog op een hele kleine schaal. Dus kunnen we niks statistisch iets van zeggen. Maar dat geeft wel inzicht in waar mensen vastlopen en waar mensen wel en niet klikken. Waarom wordt er hier opgeklikt terwijl hier niet, waar mensen blijven lang hangen? En waar gaan mensen juist heel snel door? En dan kunnen we daar wat dieper op inzoomen via bijvoorbeeld een chat die om hoog komt als je op die pagina komt waar we wat vragen over hebben waar mensen vastlopen. Of juist in de interviews wanneer we met klanten daadwerkelijk zijn de vraag stellen van \"wat vind je van onze vleescategorie\" en \"hoe kijk je naar onze viscategorie\" en \"heb je daar al gekeken?\" \"Wat vond je daarvan?\" \"Wat waren die dingen die raar zijn?\" \"Welke dingen zou je graag anders willen zien?\" En die combinatie is denk ik heel sterk en uiteindelijk zal het blijven groeien en meer volume krijgen als we kwantitatieve data steeds meer toenemen. Maar kwalitatieve data en inzichten zal altijd een heel belangrijk onderdeel van de mix moeten zijn eigenlijk net zoals jij het beschrijft. </p><p>Guido: Ja dat is natuurlijk het valkauw en dat is wel logisch, dat heeft iedereen. En dat slaat altijd aan en die data heb je nu helemaal, dus dat je daar nu nadruk op gaat leggen dat is een soort natuurlijke gedrag dat je denkt van die data heb ik al dus laat ik ernaar kijken, en dan lijkt het belangrijker dan dat het misschien is. En dan dat kwalitatieve opzetten dat is altijd een extra handeling natuurlijk maar hoezo gaan jullie ervoor zorgen dat jullie de kwalitatieve informatie, hebben jullie daar een structuur voor of leg je dat op een bepaalde manier vast of vooral nu nog in je hoofd?&nbsp;</p><p>Rick: Ligt een beetje aan welke kwalitatief onderzoek we doen. Echte interviews die we plannen, en die plannen we nog steeds met industrie experts of met klanten die zich wel geregistreerd hebben maar nog geen bestelling hebben geplaatst. Dat is vaak ook een leuke manier om nieuwe informatie te krijgen. De interviews die we plannen, daar zorgen we gelijk voor dat we notities maken gelijk na het interview schrijven we die uit. Komen daar een paar actie punten uit en die gaan in onze excel sheets, dingen zoals die antwoorden binnen 48 uur die we afgesproken hebben doorgevoerd hebben. Er zit dus een redelijk structuur in. De gesprekken zijn in feiten meer gesprekken dan interviews eigenlijk. Bij klanten thuis is wat meer freeflow maar we zorgen wel altijd dat wanneer we in de auto zitten op terug weg, voor dat we wegrijden, we eerst notities maken zodat we ze later uit kunnen schrijven. Want juist die onderdelen lezen helpt waarschijnlijk als je naar kwantitatieve data moet kijken en mensen bepaalde categorieën hebben waar ze vast lopen, soms ligt het antwoord al in een interview wat je eerder hebt gedaan. Waar je nog niet de juiste connectie kon maken en begrijpen waar het daarmee precies bedoeld werd, dan zie je misschien altijd vastlopen bij de kaas pagina. Dus dat probeer je een beetje op die manier te doen en soms is het dan helemaal niet meer duidelijk wat je met een bepaalde notitie bedoelde en moeten we dat iets strakker opschrijven. Maar ik denk dat er daar gematigd structuur in zit.&nbsp;</p><p>Guido: Hey Rick dankjewel, onze tijd zit er een beetje op. Ik vond het super leuk om te horen wat jullie allemaal aan het doen zijn en hoe jullie dat aanpakken. En ik zou zeggen heel veel succes de komende maanden ik ben benieuwd naar jullie volgende stad. Ik zou zeggen Ouderkerk aan de Amstel is een hele goede tweede punt voor jullie om te lanceren. </p><p>Rick: Dat zullen we meenemen in onze marketing onderzoek, we hebben dan al een positieve recensie dus dat scheelt wel tijd in de onderzoek. Ik vond dit super leuk om te doen en ik vind dit een hele mooie podcast en ik blij om daar een onderdeel van te mogen zijn. Dus dankjewel. </p><p>Guido: Dankjewel, en ik spreek je later. </p><p>Rick: Graag gedaan, spreek je, dankjewel. </p><p>Guido: Doei doei</p><p>‍</p>",
  "show_notes": "<ul><li><a href=\"https://nl.linkedin.com/in/rickmolenaar\" target=\"_blank\">Rick op LinkedIn</a></li></ul><p>Note: Instant bestaat inmiddels niet meer.</p>",
  "guests": [],
  "youtube_url": "",
  "main_image": "je-startup-sturen-op-kwalitatieve-data.jpeg",
  "language": "nl",
  "type": "podcast"
}