{
  "id": "valideren-van-je-e-mail-marketing",
  "title": "Valideren van je e-mail marketing",
  "description": "Experimenteren met e-mail marketing: iets mee heb gedaan maar waar je erg veel winst mee kan behalen en dat gaan we vandaag dan ook leren!",
  "date": "2025-01-10T20:38:14.578Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/eadb4869/b9f07035.mp3",
  "transcript_url": "<p>Guido: Ja Monique leuk dat ik jou in het café mocht ontvangen om te praten over optimaliseren van email marketing. Voordat we daar in duiken kun je even kort vertellen hoe je überhaupt digital marketing in ben gerold? </p><p>Monique: Ik heb marketing management gestudeerd en al snel vond ik eigenlijk uit dat ik vooral online marketing leuk vind. Dus dan kan je eigenlijk alle kanten op, je kan heel veel creativiteit kwijt, je kan eigenlijk helemaal losgaan en al je werk zie je dan terug in de cijfers. Dat is vooral wat ik zo motiverend vind. Dus bij E-Company had ik een hele mooie kans dat ik daar kon beginnen als trainee. Dus daar had ik meegelopen met allerlei online marketing disciplines. Dus denk bijvoorbeeld aan SEO, CRO en dan email. Daar heb ik dus wat CRO onderzoek gedaan die ik eigenlijk nu nog steeds gebruik. Ik vond het super interessant hoe je met bepaalde principes mensen kon overtuigen. Uiteindelijk heb ik toch gekozen voor email marketing want ik vind het heel mooi om te zien hoe je iemand kan helpen met zijn aankoop. Dus stappen in de schoenen van de consument en kijk je naar “waar heeft hij nou echt behoefte aan?” Nou dan kan je een heel mooi content mail maken en tegelijkertijd dat optimaliseren en CRO kwijt. Dus ja dat vond ik eigenlijk gewoon een hele mooie combinatie en zeker als je wilt optimaliseren dan is dit soort marketing perfect. Want hij kan heel snel testen en je kan ook veel vervolg testen doen. </p><p>Guido: En moest je nu ook verplicht dat boekje met meer omzet op je webshop inzetten? </p><p>Monique: Ja goed gedaan, dat klopt. </p><p>Guido: En er staat bijzonder weinig over email marketing. Ga je dan een addendum uitbrengen of je eigen boeken schrijven? </p><p>Monique: Nou vroeger wilde ik schrijfster worden dus wie weet? </p><p>Guido: Oh kijk aan! Nou komt dat even mooi samen. En wat ik super leuk vind, je hebt wat cases meegenomen dus we kunnen eigenlijk direct de materie induiken en kijken wat jullie voor klanten hebben gedaan. Wat voor experimenten jullie hebben opgezet. Voordat we naar de cases gaan, ben ik wel even benieuwd, ja wat ik al zei, ik ben redelijk ervaren met AB testen, maar volgens mij is het een beetje tricky, AB testen bij emails is dat het altijd ingebakken moet zijn met de marketing zelf toch? Als je een website hebt maakt het niet zoveel uit wat voor platform je hebt. Je kan altijd optimaliseren met Google optimise of zo en kun je daarmee experimenteren. Bij email marketing heb je die luxe niet. Dus het moet wel in je tool zitten toch? </p><p>Monique: Ja. Nouja dat is iets wat mensen vaak denken en dat maakt het wel makkelijker maar dat is niet per sé nodig. Als je met een website werkt wat iets verder gaat dan een heel standaard pakket zeg maar. Dan heb je vaak wel de ruimte om jouw database in groepen te verdelen. Dus stel die tool is niet vastgebakken in jouw software dan kun je altijd zeggen “oke mijn database is gesplitst in 50/50, en de eerste groep krijgt A en de tweede groep krijgt B. Dus vaak is het iets meer handwerk maar dan kan je het wel doen. </p><p>Guido: Dus als ik zo een AB test wil doen dan moet ik gewoon een beetje hacken. Nou vertel wat voor testen heb je meegenomen? Waar gaan we naar kijken? </p><p>Monique: Ik heb een paar testen meegenomen, en dat zijn hele mooie testen en eigenlijk met zo een wetenschappelijke database is het verschil vaak heel klein terwijl de stappen heel groot zijn. Dat vind ik heel mooi om te doen altijd. Maar bijvoorbeeld, één van mijn klanten, die zit in de kinderkleding, en ik had een contactpersoon die altijd de nieuwsbrieven maakte en verder had ie niet veel collega’s die daarbij meehielpen alleen had ie wel veel collega’s met een mening erover. Dus hij moest eigenlijk altijd zorgen dat zijn collega’s het eens waren met die mail. En omdat er zoveel meningsverschil was kwamen ze er vaak niet uit. En ze kwamen bij het probleem van moet het nou in het Engels of in het Nederlands, maar goed zijn collega’s wilden altijd een Engelse onderwerp regel. Want ja dat is gewoon leuk en hip, dat klinkt lekker. Maar goed wat wij zien bij CRO in webshops maar wat ik ook zie in emails is dat Nederlands werkt het beste. </p><p>Guido: En voor de duidelijkheid, de doelgroep was dus Nederland. <br>Monique: Ja klopt, hartstikke Nederlands. Maar dan verbaast het mij nog dat zijn collega’s altijd een Engelse onderwerp regel willen. Maar goed, dat was dan het antwoord, we gingen toen AB testen. Een test ging over een paar varianten in de B. A was dus in het Engels zoals die altijd al is en B had een Nederlandse onderwerp. Nou toen gingen wij de test laten lopen. Niet zo zeer om zoveel openings te krijgen maar vooral om een einde te maken aan de eindeloze discussie. Dus wij gingen de data bekijken en ook analyseren om te kijken of we echt zeker konden zijn van het verschil. En wat bleek dus was dat 12% meer openings waren bij een Nederlandse onderwerp regel. Alleen daarvoor is een AB test hartstikke mooi dus. Mijn contactpersoon kon het dus laten zien aan zijn collega’s en hebben ze daarna nooit meer discussie gehad. </p><p>Guido: En nu gaan jullie natuurlijk testen in het Frans, in het Vlaams, in het Fries. </p><p>Monique: Nou we houden het nu bij Nederlands. </p><p>Guido: Dat is wel behoorlijk wat 12% meer opens.</p><p>Monique: Jazeker, en het is wel een klein verschil, ga je nou een onderwerp in het Engels of in het Nederlands zetten, ik zou zeggen test het, maar er is een groot kans dat Nederlands wint. </p><p>Guido: Ja dat vind ik het leukste van ons vak, is dat we soms enorme veranderingen maken en klanten zien het niet eens en soms zijn het hele kleine dingetjes en is er opeens een enorm verschil. Wat wel gaaf is. Vertel, vertel meer.&nbsp;<br> Monique: we hebben een andere test gedaan bij een andere klant en dat vind ik zelf altijd heel leuk, we hadden een email template en die hadden we al best lang staan, een paar jaar van toen ik die had gemaakt. En hier hebben we een beetje als wat we in de web zagen, een Engels email in de email template staan. Ze hadden bijvoorbeeld een item als lookbook, shops, al dat soort dingen wat niet aansloot bij de doelgroep, die overigens gewoon Nederlands was. Met onze kennis weten wij dat Nederlands waarschijnlijk beter werkt. Dus dat gingen wij ook testen bij deze ene klant. We gingen kijken wat de juiste test methode was, er zijn ook meerdere methodes in email marketing. Dus toen hadden we die stappen gelopen en toen waren we aangekomen op het punt om de variant te gaan maken, dus de B versie. Toen gingen wij kijken in data in Google Analytics waar we specifiek gingen inzoomen, uitgeschreven in de nieuwsbrief die bepaalde gedrag vertoonde in de webshop. Dus ging ik kijken naar mensen die uit de email landden in de webshop en wat ze daar doen en toen gingen wij kijken waar in de webshop zij klikken in een nieuw balk. Dus dat was veel informatie waar we zien waar de shifts zijn, in welke categorieën ze belanden. Dus diezelfde categorieën gingen wij ook gebruiken in de nieuwsbrief. We hadden een A en B versie weer waar A dus de onderwerp regel nog in het Engels was en de B was met products categorieën.&nbsp;want het bleek dat mensen daarin geïnteresseerd waren. Denk bijvoorbeeld aan jassen, broeken, overhemden, enzovoort. Daar gingen we de nieuwsbrief over testen en toen bleken we veel meer kliks te hebben. Namelijk 110%, dat had ik nooit eerder gehaald dus daar ben ik wel heel trots op.&nbsp;<br> <br>Guido: Dat kan ik me voorstellen ja.&nbsp;<br> <br>Monique: En wat ook wel leuk is is we hadden gekeken naar welke products categorieën zijn mensen nou geïnteresseerd, en deze test hebben we vorig jaar in de herfst gedaan dus dan heb je natuurlijk ook herfst categorieën, jassen en zo. En jassen hoef je niet per sé te melden in een nieuwsbrief in de zomer, dus wij willen het elke seizoen gaan bijwerken.&nbsp;<br> <br>Guido: Ja en dat zet je ook wel weer aan denken.. op websites komen er ook heel veel van de Engelse termen de hele tijd ook in Nederlandse webshops. \"Lookbook\" heb ik altijd een beetje een vreemde gevonden inderdaad. Maar de hele range aan Engelse termen die we allemaal gebruiken, daar moet je misschien toch wel een beetje voorzichtig mee zijn want sommige mensen snappen dat gewoon niet of klikken er minder snel op.<br> <br>Monique: Jazeker, als je dit al weet kom je eigenlijk overal Engelse termen tegen, ik verbaas me er altijd over. Ook in Nederlandse webshops kom je het zo vaak tegen \"Subscribe to our newsletter\" en \"Sign in\" en ik denk waarom nou? Zet het nou gewoon in het Nederlands en waarschijnlijk gaat het veel beter werken.&nbsp;<br> <br>Guido: Soms als het bij je hippe brand image persé hoort als je daarin gelooft, ja doe het vooral, maar als er niet perse bijhoort en je ziet dat het je echt clicks of orders kost dan moet je toch misschien goed even nadenken of het toch zo goed bij je brand past.&nbsp;<br> <br>Monique: Ja precies dat vind ik ook maar ja als ik dit wil uitleggen aan een klant dan merk ik dat er toch wel vaak weerstand is.&nbsp;<br> <br>Guido: En dan is het leuk dat je het kunt valideren met een AB test. Dan kan je zeggen \"Ja wat jij wilt maar kijk, 110% verschil.\"&nbsp;<br>Monique: Jazeker, als ik bijvoorbeeld kijk naar mijn eigen inbox dan zie ik gewoon zoveel emails in het Engels. Is het niet in het onderwerp dan is het in de preview of de inhoud zelf.&nbsp;<br> <br>Guido: En dat vind ik ook wel mooi het kan dus ook heel goed als er een resultaat uit een email blijkt kan het gebruikt worden voor een AB test op de website. Ik kan me dan wel voorstellen dat er retailers zijn die behoorlijk gepusht hebben om email marketing dat ze een enorme bestand hebben en eigenlijk beter kunnen valideren met een AB test in de email omdat ze dan veel meer data hebben dan op een website in a specifieke category. Dat kan je misschien niet op de website testen maar op de email.&nbsp;<br> <br>Monique: Dat is gelijk een van de grootste voordelen van email marketing. Als je wilt gaan testen dan kan je dat super snel analyseren. Een AB test in een webshop duurt vaak drie of vier weken, en in email kan je dat afronden binnen een paar dagen. Dus dat is iets wat we steeds vaker doen voor onze klanten want wij bieden zowel CRO als dienst aan als email, sommige klanten willen allebei dus dan willen we die twee dingen zo goed mogelijk laten samen werken dus dan wil ik de testen gaan doen in de nieuwsbrieven die dus wel of niet gebruikt kunnen worden voor de webshop. Zo leer je veel sneller jouw doelgroep kennen.&nbsp;<br> <br>Guido: Ik kan me alleen voorstellen dat je bij email, mensen krijgen een email van je omdat ze je al kennen, dus dat is een bias die de email database heeft terwijl op een website zijn het meestal nieuwe bezoekers dan gelden dezelfde regels niet.&nbsp;<br> <br>Monique: Nee klopt, het is altijd een beetje afhankelijk per klant. Soms moet je laten zien wat voor verhaal je moet hebben om de klant wat relevanter te laten zijn.&nbsp;<br> <br>Guido: Meer ik wil meer&nbsp;<br> <br>Monique: Nou we hebben ook een andere klant die is internationaal actief, zij zit in de tassen en eigenlijk in elke land ter wereld leveren zij hun tassen. Ze hebben ook een hele grote database met heel veel informatie.&nbsp;Bij die klanten, wat ik al vaker merk is dat klanten heel veel informatie hebben maar ze hebben helemaal geen doel. Ze verzamelen gewoon en daar doen ze niks mee en dat is gewoon hartstikke zonde. Want dat is heel veel informatie waar je heel goed kunt optimaliseren, dat was hier ook het geval. Wat zij eigenlijk van al hun klanten wisten is uit welk land zij vandaan kwamen. Die informatie hadden ze maar ze deden er helemaal niks mee. Dus ik zei \"hier kunnen we verbetering inbrengen.\" Zoals altijd zij hun eigen onderwerp regel bedacht en die was in het engels omdat zij een Engelse nieuwsbrief hebben en er stond \"we zoeken mensen om mee te doen met ons onderzoek.\" Dat was de A versie, dus ik dacht, de B versie, die kunnen we zo opmaken \"wij zoeken mensen voor ons onderzoek uit Frankrijk\" of \"uit China\" of whatever en dat werd automatisch ingeladen op basis van informatie die we al hadden. Dus dat hebben we gedaan voor veertig verschillende landen. Die test gingen wij dus doen en de B variant bleek veel beter te werken eigenlijk is het principe heel simpel. Wij gaan personaliseren op basis van t land waar iemand vandaan komt. Want de informatie hadden we toch al. Dit is dus een voorbeeld van eigenlijk een heel klein aanpassing die een heel groot resultaat heeft. Door dit te doen hadden we 8% meer opens bij de B variant. Ik vind het hartstikke mooi dat je met zo een klein aanpassing zoveel effect kan bereiken. Wat ik ook heel vaak merk is dat bedrijven altijd met een vast ritme de nieuwsbrieven sturen, bijna elke week, maar dat ze amper AB testen. Ze weten misschien wel dat het kan maar ze doen het nog veel te weinig. En als je ziet dat je met één AB test zoveel kan bereiken, laat dan staan wat je kan bereiken bij het testen van elke nieuwsbrief.&nbsp;<br> <br>Guido: Zo een standaard procedure moet er zijn dat je dat doet.<br> <br>Monique: Ja dat zeker wel, maar het is natuurlijk afhankelijk van hoeveel capaciteit je hebt. Als je maar één online marketer hebt die ook nog SEO moet doen en webshop optimalisatie dat je dan wat minder tijd hebt. Maar ik zou het zeker aanraden als je wat meer ruimte hebt.&nbsp;<br> <br>Guido: Hoe pak je dat meestal aan? Als jullie een AB test doen dan kan ik me voorstellen dat als het een hele grote database is dat je dan zegt \"we gaan eerst bij 10% van de database AB test doen of CDE whatever test aan een deel van de database en dan de winnaar sturen we naar de rest.” Is dat iets wat jullie doen? Of pakken jullie de hele database? Hangt er misschien af van wat jullie testen&nbsp;<br> <br>Monique: Ja nou dat is eigenlijk wel een goede vraag. En dat zijn eigenlijk allemaal verschillende testmethodes dus eigenlijk kijken wij per test wat een goede testmethode is voor die ene test. Dus ja, eigenlijk hebben een test proces voor email die bestaat uit zes stappen. De eerste stap bestaat uit inzicht op wat we doen en dan ga ik bij voorbeeld kijken naar Google analytics naar je data uit benchmark, je kijkt naar waar de kansen echt liggen. Dan ga je dus een hele verzameling maken van alle ideeën en die ga je vervolgens prioriteren, en daar hebben wij bepaalde prioriteiten voor en als je dat hebt gedaan dan weet je wat je gaat testen maar je weet nog niet hoe je het gaat doen en dit is dan de derde stap van dat test plan. Dan ga je nu kijken welke testmethode ga je gebruiken en dat is afhankelijk van meerdere dingen. Bijvoorbeeld hoeveel varianten wil je maken, maar ook wat is jouw test KPI want bijvoorbeeld jij hebt meer opens dan kliks, dan heb je meer ruimte als je opens wilt gaan testen omdat je daar gewoon meer data van hebt. Dus hier kan je alle kanten op, kijk bijvoorbeeld, je kan een AB sturen naar 50% of je kan een ABC versturen die dan allemaal naar 33% gaan dus hier kan je een beetje spelen met die percentages en dat is afhankelijk van hoeveel ontvangers je hebt en welke test KPI je wilt optimaliseren.&nbsp;<br> <br>Guido: Dit heb je ook super netjes uitgewerkt in een blog post, ik zal de link geven, AB Testen, dit zijn de zes stappen die over bijzonder veel AB testen gaat. Dat ziet er heel bekend uit dus dat is heel fijn. Ik ben wel heel benieuwd over iets wat je net noemde, ik heb bijvoorbeeld gewerkt bij bedrijven waar de website doelgroep alleen lee generation was, leuk maar je optimaliseert maar een deel van de funnel. En dat einde van jouw funnel is niet een aankoop vaak. Je stuurt mensen naar een website en ze vullen uiteindelijk een formulier in of solliciteren ergens op maar dan zijn ze nog niet geplaatst, ze hebben nog niks gekocht zeg maar. Dus hoe ga je daarmee om? Uiteindelijk wil je wel dat mensen iets kopen natuurlijk.&nbsp;</p><p>Monique: Ja onze klanten zijn vooral retailers, zij zitten vaak in de fashion en de producten, tassen en zo. Wij kijken dus naar omzet KPI's. Als je het hebt over email marketing dan wil je ook anders zijn dan bij een CRO zeg maar, dus we kijken vooral naar de opens en de clicks. Met een AB test kan je vooral de opens of de clicks optimaliseren. Eigenlijk is het voor elke klant ook wel anders, welke van de twee je gaat optimaliseren. Hier ga je dus ook een stukje prioriteren toepassen, je gaat kijken naar welke van de twee is het belangrijkste om nu te gaan optimaliseren. Je kijkt naar je staat van vorig jaar maar ook naar de benchmark. Wij kijken vaak naar de benchmark van de DDMA. Die hebben hun benchmark voor 2019 ook al uitgebracht. Dan ga je kijken waar is het pijl het grootste, moet je dan opens optimaliseren of clicks?&nbsp;<br> <br>Guido: De nationale email benchmark van DDMA?&nbsp;<br> <br>Monique: Ja klopt.<br> <br>Guido: Ik ben wel benieuwd nou eigenlijk, want je kan meer leads aanleveren en met email marketing meer clicks of meer opens, maar je gooit meer mensen over naar het volgende bakje zeg maar dat betekent niet dat de mensen in dat volgend bakje net zo succesvol zijn als de mensen die er al inzitten. Dus de conversie in je fonds, dat zou naar beneden kunnen gaan of er gaan meer mensen solliciteren op je website, dat is leuk maar dan heb je veel meer werk voor de recruiters daar achteraf. En uiteindelijk heb je niet meer mensen die geplaatst zijn. Kom je dat veel tegen? Dat je meer clicks hebt of wel meer opens? Maar dat het eigenlijk niks doet of zelfs slechter wordt?&nbsp;<br> <br>Monique: We krijgen eigenlijk alleen resultaten over de opens en de clicks. Dan kijken we op jaarbasis moeten we meer verkeer hebben. En dat is eigenlijk de invloed die we hebben binnen email marketing. We kunnen wel zorgen dat we meer verkeer sturen en aan het einde is het aan onze klanten om te zorgen dat het wordt geconstateerd.&nbsp;&nbsp;<br> <br>Guido: Ja maar je wil wel een beetje vinger aan de pols houden van de kwaliteit. En bij email marketing is het niet zo een hele groot issue want je hebt die mensen al in je database zitten dus die zijn al highly qualified. Net zoals met affiliate marketing, je kan wel meer traffic sturen maar als dat niks constateert..<br> <br>Monique: Ja precies, dat is zonde. We kijken ook wel vaak naar de omzet uit email marketing natuurlijk. We kijken zeker ook naar \"hoe doet email marketing het in het algemeen?\" Dat zijn eigenlijk een soort hygiëne KPI's die we ook kunnen halen.&nbsp;</p><p>Guido: Mensen vertonen ook op de website heel veel gedrag dat eigenlijk best wel interessant is om in email marketing mee te nemen natuurlijk, los van of ze iets kopen of niet. Dus eigenlijk wil je dat soort data van de website terug laten vloeien in je email database want die kan je ook filteren. Bijvoorbeeld iemand stopt iets in zijn mandje, die mensen willen graag een maitlj sturen of mensen die een bepaalde categorie bekijken. Of bepaalde evenementen, je ziet misschien dat mensen al drie weken van te voren al op zoek zijn naar spullen voor Valentijnsdag of moederdag of koningsdag. Het zou fijn zijn als je ze nog een week van te voren kan targeten. Hoe kun je ervoor zorgen dat die data weer terug vloeit in je email database.&nbsp;<br> <br>Monique: Dat is natuurlijk hartstikke mooi aan dat je een nieuwsbrief kan sturen want dat is echt het moment dat je ze wilt bereiken, dan ben je super relevant voor ze. Waar we wel altijd te maken hebben is toestemming geven om gemaild te worden. Ik merk vaak dat er toch wel partijen zijn die een grijze gebied opzoeken van mag het? Ik wil wel gewoon goed voldoen aan de wet dus je kan alleen mailen als je toestemming hebt gekregen. Dat zal je nooit tegenhouden want er zijn zeker manieren waardoor je toch de toestemming kan krijgen. Zeker om en na een aankoop, dat zijn hele goede mogelijkheden hiervoor. Maar goed dat is het toch het stukje wat betreft tech. Wat ik nog veel te weinig zie gebeuren is dat we het gedrag in de webshops terug gaan zien in de emails die we sturen. Je hebt mailtjes, en die sturen je door naar de webshop en dat is de volgend fase, daar moeten mensen hun aankoop doen. In de webshop tonen mensen super interessante gedrag, ze gebruiken bepaalde filters, dat soort dingen willen we allemaal weten. Vaak blijven dat soort dingen in de webshop en dat is hartstikke zonde want wij willen dat heel graag weten om mooie nieuwsbrieven te maken. Wat wel echt een trend is, is dat klanten gaan samenwerken met externe partijen. Maar het idee is dat je dat gedrag wat je ziet in de webshop door gaat schieten naar een software waarvan wij hele mooie campagnes kunnen maken.&nbsp;<br> Guido: Ook daar ben je denk ik heel erg afhankelijk van de e-mail die je gebruikt.&nbsp;<br> Monique: Ja maar op alle manieren moeten we kijken hoe je dat goed kunt gebruiken.&nbsp;</p><p>Guido: Zoveel vragen die ik heb. Doen jullie ook AB testen met transactional emails? Dat zijn de emails die worden verzonden na aanleiding op een bepaalde actie op de website&nbsp; of als iemand koopt iets, dan krijg je een email bevestiging of het wordt verzonden en dan krijg je een email bevestiging of iemand heeft wat bij de helpdesk ingediend, dat soort triggers die allemaal online plaats vinden, dat noemen we transactional emails. Doe je wat daarmee? Wordt er daarmee AB getest? Is dat een ding?&nbsp;<br> Monique: Nou dat is wel een mooi punt. We zijn eigenlijk vooral bezig met AB testen met nieuwsbrieven dus dat zijn geen transactional emails maar die kant willen we steeds meer opgaan. Daar staat ook hartstikke veel te winnen dus de nieuwsbrief zien we nu vooral als middle om te zorgen dat de klant die aankoop gaat doen en daarna willen we ook testen of iemand wel een upsale of crosssale wil doen.&nbsp;<br> <br>Guido: Want bij één aankoop zijn ze nog geen klant mensen. Pas na aankoop 3, 4, 5 zijn ze echt klant. Toch? Dat moet je doel zijn. Laten we terug gaan naar de testjes. Je hebt er nog twee?&nbsp;<br> <br>Monique: Ja klopt, nou, ik heb er zeker veel meer gedaan maar dit zijn eigenlijk de mooiste.<br> <br>Guido: Ja we hebben maar een uurtje.&nbsp;<br> <br>Monique: Goed, we hadden het natuurlijk net over de DDMA benchmark. En daar zien we dat de juiste tijd stipt biedt de grootste kans op een open of een click. En dat vind ik altijd heel goed om daarmee te gaan testen. Zo hebben wij dat ook gedaan voor een klant. Zij zitten in de B2B dus dat is net iets anders dan de B2C dus dat levert altijd hele interessante inzichten op. De klant stuurde jaren lang om 11u de nieuwsbrief. Nou goed daar kunnen we misschien verandering in brengen. Dus i.p.v. om 11u wilden we om 16u de nieuwsbrief sturen want in de benchmark zagen we dat er dan een grotere kans was om een click te krijgen. Dus dat gingen we toen doen. Niet alleen voor Nederland maar ook voor Frankrijk, en dat was eigenlijk een uitstapje want deze benchmark gaat allen over naar Nederland. Maar ze hebben ook veel klanten in Frankrijk dus ik dacht \"oke die nemen we gewoon mee, ben benieuwd.\" Dat hebben we dus gedaan en het leverde hele interessante inzichten op. Bij Nederland werkte het niet, dus 11u was toch beter dan 16u kan er ook mee te maken hebben met het feit dat het B2B is. Maar voor Frankrijk zagen we wel iets moois, 16u werkte daar beter. Dus het was eigenlijk gewoon toeval en we kregen toch wel 6% meer opens in Frankrijk dankzij deze AB test. En achteraf kan je dat goed redeneren. In Frankrijk hebben ze vaak pauze rond 14u en ze stoppen ook wat later. Voor Frankrijk gebruiken we nu standaard 16u.&nbsp;<br> <br>Guido: Dat soort cross-cultural onderzoeken vind ik altijd super interessant. Je denkt \"wat gebeurt daar in hemelsnaam?\" en dan merk je dat ze om 14u middagpauze hadden.&nbsp;<br>Is dan de vervolgstap dat je vervolgens alle tijd stippen tussen 9 en 5 gaat testen voor die klant? Dan heb je een AB test met 40 varianten. Moet je database ook maar net aankunnen.&nbsp;<br> <br>Monique: Wat we nu voor de klant aan het doen zijn is verder personaliseren op dit tijd stip. Dus standaard om 11u werkt goed, maar we houden nu ook bij precies hoe laat mensen de nieuwsbrief openen. Een dag hebben we verdeelde in vijf moment, opent iemand hem in de late ochtend krijgt dat moment een +1 score. En dat houden we zo bij, op het moment dat hij de nieuwsbrief opent en dan sturen we het altijd op dat moment. Tenzij we geen data hebben van diegene, dan sturen we het gewoon om 11u uit. Zo kan je heel veel personaliseren, zonder te veel data.&nbsp;<br> <br>Guido: Nou dan personaliseer je niet op informatie van die persoon zelf maar van hoe ze reageren op de emails. Wat zijn eigenlijk de meest gebruikte segmentaties in email, als je een email in verschillende patches gaat verzenden naar een groep. Wat zijn de verschillende segmentaties? Kopers, niet-kopers, hoe lang geleden ze wat gekocht hebben, budget, etc..&nbsp;<br> <br>Monique: Dat zijn vooral voorkeuren die mensen zelf hebben opgegeven en dat is op zich een hele mooie segmentatie want ja als iemand het zelf heeft opgegeven dan is het waardevol en niks is geïmpliceerd. Dus een klant die zit in de dierenverblijven, gaan mensen zich inschrijven voor de nieuwbrief dan wordt er op dat moment gevraagd welke dier heb je? Hond, kat, vis? Die klant stuurt bijna alleen maar thema nieuwsbrieven. Dus echt een nieuwsbrief over honden of over katten, met mooie informatie zoals \"hoe ontvlooi ik mijn hond?\" Op die manier kunnen wij hele mooie nieuwsbrieven sturen.&nbsp;<br> <br>Guido: Niet interessant voor mij als ik alleen maar een goudvis heb.&nbsp;<br> <br>Monique: Nee precies, dan krijg je die nieuwsbrief ook niet. Ze sturen ook wel een standaard nieuwsbrief uit dus dan ontvang je niet de honden nieuwsbrief maar wel die over alle acties van de maand.&nbsp;<br> <br>Guido: Dus dat zijn de topics waar mensen geïnteresseerd in zijn dat wordt veel gebruikt. En wordt er ook wel gesegmenteerd op hoe vaak mensen iets krijgen, is dat een ding? Dagelijks, of een keer per week of per maand.&nbsp;<br> <br>Monique: Ja we kijken een beetje of daar behoefte naar is. We willen in ieder geval wel een veld hebben waar iemand redenen kan opgeven. Die redenen zijn sowieso vooraf ingevuld, want misschien geven veel mensen aan dat ze te vaak een nieuwsbrief ontvangen. Dan willen we ook uitvragen, hoe vaak wilt u hem dan ontvangen dat wij er dan rekening mee kunnen houden.&nbsp;<br> <br>Guido: Laten we doorgaan naar de laatste.&nbsp;<br> <br>Monique: Dat is gelijk een hele mooie en heeft veel te maken met CRO principes, ik kan mensen op heel veel manieren overtuigen en twee principes zijn schaarste en social proof. We vragen aan klanten van \"werkt dit uberhaupt beter? En zo ja welke dan?\" Zij had een segment met iedereen uit andere landen dan Nederland. En bijdeze gingen wij deze AB test doen. Hierbij hadden we 3 versies. A was gewoon een standaard mail met een onderwerp. En B dat was dan schaarste, dus bijvoorbeeld \"wees er snel bij want anders zijn ze op.\" En de derde was die social proof versie. \"Zoveel mensen waren je al voor..\" zoiets kregen ze er ook bij. Toen gingen we testen en we zagen hele mooie resultaten. We zagen dus dat we in beide segmenten, de schaarste en social proof beter werkten. A bleef veel achter dan B en C. Maar dat is heel interessant, want die twee presteerden allebei even goed, 14% meer opens met zo een test. Dit zorgt wel voor de volgende vraag, welke van de twee werkt dan echt beter? Dit heeft ook gezorgd voor een herhaal test. Ik ben zelf ook heel benieuwd. Dus dan hebben we eigenlijk nog meer data om die twee principes te gaan testen.&nbsp;<br> <br>Guido: Ja met dat soort dingen zou je ook nog tegen kunnen komen dat als je overal kijkt, dat ze gewoon allebei net zo goed werken, maar dat bepaalde segmenten die ene beter werkt dan de ander. Bij websites zie je dat ook weleens.&nbsp;<br> Monique: Ja die AB test zorgt voor meer vervolgtesten en we moeten steeds meer inzoomen om nog meer inzicht te krijgen.&nbsp;<br> <br>Guido: Ja dat is altijd het nadeel van AB testen, je hebt altijd meer vragen dan antwoorden aan het einde. Gelukkig zijn er tussendoor allemaal updates, maar meestal heb je wel meer ideeën achteraf dan dat je vooraf had. Waar zie je dit vaak misgaan bij partijen als ze bezig zijn met email marketing. Of naja de grootste fout is er niet mee bezig zijn denk ik. Maar als ze ermee aan de slag gaan, waar gaat het meestal mis?&nbsp;<br> <br>Monique: Nou de eerste stap is al goed want ze zijn in ieder geval op de hoogte van het belang ervan, en als ze dat al doen dan kan er nog heel feel fout gaan. De grootst gemaakt fout is dat ze gaan testen zonder plan. Dus als iemand een keer wat roept en dat gaan ze dan testen. Daarna kijken ze gewoon naar de resultaten en wat dan een heel vaak gemaakte fout is is dat ze gaan kijken naar de resultaten en veel te snel bepalen wie de winnaar is. En dat doen ze dan een beetje op basis van onderbuikgevoel. Ze testen eigenlijk zomaar wat, ze denken niet goed na over welke methode dan goed werkt of betrouwbaar is. En als hun test gedaan is dan kijken ze te snel naar de resultaten en kijken ze niet of het daadwerkelijk het beste is.&nbsp;<br> <br>Guido: Die ene heeft 495 opens en die ander 500 dus de 500 is de winnaar.&nbsp;<br> <br>Monique: Ja precies, dat kan je wel aardig veel verbazen.&nbsp;<br> <br>Guido: Dus meer hypotheses zijn gebaseerd op data, en de stap 1 missen ze en het is best een belangrijke stap.&nbsp;<br> <br>Monique: Ja, wat ik vaak ook merk is dat klanten heel veel inzicht informatie missen. Bijvoorbeeld klantenservice, ik weet zeker dat ze altijd hele waardevolle date hebben die wij kunnen gebruiken voor onze onderzoeken.&nbsp;<br> <br>Guido: Ik sprak laatst voor een podcast met Jurriën van Vonk en een ding wat hij had gedaan binnen de organisatie brede uit te dragen, was een soort van bokaal uitreiking voor de mensen met de meeste test ideeën. Dus ze hadden een soort interne wedstrijd, en diegene die het meeste goed hadden kreeg een bokaal. En diegene die won, die zat niet bij het CRO team, niet bij de marketing team, die werkte bij customer service. Dat is iets wat ik heel vaak tegenkom.&nbsp;<br> <br>Monique: Zeker als het partijen zijn met eigen winkels. Ik zeg altijd ga gewoon letterlijk op de winkel vloer staan. Zeker omdat de mensen daar zoveel kennis hebben van de doelgroep. Toen kregen we ook een mooi Word documentje terug van 10 pagina's en dat is natuurlijk super waardevol, we wisten toen meteen dat vrouwen meer aankoop deden, de mannen die moest vaak wel mee zeg maar, ook al ging de aankoop om hun, om kleding. Dat is gewoon hartstikke mooi.&nbsp;<br>Als je die informatie hebt heb je gewoon goud in je handen.&nbsp;<br> <br>Guido: Ja Simon dat deed ook bij Van Moof, zijn kantoor zit boven de winkel van Van Moof en hij ging een keertje naar beneden dat vertelde hij in een uitzending ook dat ie daardoor erachter kwam dat mensen, nou die fietsen zijn natuurlijk vrij duur, rond 2300 euro dat mensen vaak een limiet hebben van €2000 op hun kaarten, gewoon een betaalpas zeg maar, wat je dagelijkse fee is, online zie je dat niet echt, in Google analytics en vaak in de users test gaan mensen niet echt betalen dus dan kom je daar ook niet echt achter. Dus zij kwamen erachter door echt in de winkel te gaan staan en dachten ze \"shit, mensen willen nu afrekenen en betalen maar ze lopen tegen die limiet aan.\" Dat soort inzichten krijg je niet door blind staren op Google analytics.&nbsp;<br> <br>Monique: Nee precies, wij hebben natuurlijk wel het voordeel dat we heel veel kwantitatieve analyses kunnen doen maar goed echt het \"waarom\" kunnen we niet zo makkelijk achterhalen dus ja als ik zelf online mensen zou zijn zou ik direct naar de winkels gaan, heel veel vragen stellen, en op basis daarvan heel veel inzicht op doen.&nbsp;<br> <br>Guido: Hey super bedankt voor het delen van deze testresultaten, dat is super insightful en leuke inspiratie ook voor mensen die on-site aan het testen zijn, maar hopelijk zijn er mensen die nu denken aan nieuwe aandacht naar hun email te gaan kijken. En wat zijn nou ontwikkelingen in de email marketing/CRO markt waar je enthousiast van wordt? Waar zul je de komende twaalf maanden bezig zijn voor klanten zeg maar?&nbsp;<br> <br>Monique: Eigenlijk wordt elke marketer blij van gepersonaliseerde data. Dat is een trend die heel erg in de opkomst is. Dus wij hebben zelf onze marketing interne teams en wij merken dat zij hartstikke snel aan het groeien zijn. De klanten komen zelf naar ons toe omdat zij zelf aan de slag willen gaan met een bepaalde partner en dan vragen ze ons om hulp met de implementatie en ze willen eigenlik steeds meer data centraliseren dus zoals ik net zei, bepaalde bezoekers gedrag in de webshop, dat willen wij gaan gebruiken voor de email marketing. Tegelijkertijd kan je dat ook gebruiken om jouw advertenties in Google te optimaliseren of jouw banners te verbeteren. Dat is een grote trend die hartstikke gaande is en daar word ik heel blij van want daarmee kan ik veel mooiere campagnes maken. Bijvoorbeeld als we zien in de webshop dat iemand geïnteresseerd is in, bijvoorbeeld katten krabpalen dan gaan wij diegene niet meer de algemeen nieuwsbrief sturen, dat zou gewoon hartstikke zonde en jammer zijn. Dus dan gaan we diegene tijdelijk uitschrijven van de algemeen nieuwsbrief en dan gaan we gepersonaliseerde campagnes sturen. En dat gaan we ook wel een beetje opbouwen. Dus de eerste mail is \"waar kunnen we jou bij helpen? Dit zijn de categorieën die we hebben, hier zijn de kat krabpalen die we hebben.\" En als iemand nog interesse toont dan kunnen wij specifieke producten gaan vertonen. Uiteindelijk willen we zo werken na een aankoop. Mocht die interesse niet helemaal getoond worden dan gaan we langzaam terug naar de algemene nieuwsbrief. Dat is een hele grote trend waar ik blij van word.&nbsp;</p><p>Guido: En is dat een trend die door technologie steeds makkelijker wordt om te doen? En is het dan iets waar jullie de waarde in zien om het te pushen bij klanten? Of zitten we op een moment dat klanten er zelf al om gaan vragen?&nbsp;<br> <br>Monique: Jazeker, dat laatste doen ze steeds meer.&nbsp;<br> <br>Guido: Oké dat is mooi. Dat is een stuk makkelijker werken namelijk.&nbsp;<br> <br>Monique: Soms merk je wel dat er oudere hierarchische bedrijven zijn waarbij het geloof nog een beetje moet groeien daar. En ze hebben gewoon meer tijd nodig. Maar ik probeer daar zeker wel te sturen en dan vind ik mooi dat er steeds meer interesse vanuit hen komt. Ik denk ook zelf dat als je als webshop niet met deze trend meegaat dan denk ik wel dat het einde verhaal kan zijn over twee jaar.&nbsp;<br> <br>Guido: Over twee jaar al? Hopelijk worden er veel mensen hier heel zenuwachtig van.&nbsp;<br> <br>Monique: Ik hoop dat veel mensen wakker worden.&nbsp;<br> <br>Guido: Ja precies. Hey bedankt voor deze bak inspiratie. Mijn laatste vraag voor jou, waar haal jij inspiratie vandaan?&nbsp;<br> <br>Monique: Eigenlijk in mijn eigen email inbox.&nbsp;<br> <br>Guido: Elke dag komt de inspiratie gewoon binnen wandelen bij jou.&nbsp;<br> <br>Monique: Zeker als het donderdag is, krijg ik altijd heel veel nieuwsbrieven, volgens mij is dat een hele populaire email dag. Dus dat is al een hele mooie inspiratie, soms zie ik dingen en denk ik \"oh dat kan beter\" en soms zie ik dingen en krijg er veel inspiratie van. Ik volg zelf ook bepaalde blogs, er is ook een Engelse blog die ik heel interessant vind, de blog \"Really Good Emails\" en die vind ik fantastisch. Als je naar hun onderwerp regels kijkt, ze durven ook te experimenteren. Ik weet zeker dat zij ook AB testen. Het is een hele mooie inspiratiebron dus ik zou zeggen schrijf je ook daarvoor in. Verder deel ik ook dingen met mijn online marketing collega's want ik heb dan een email bril op, en mijn collega's van conversie die kijken net iets anders tegen dingen aan. Ik heb ook strategie collega's, en dat is heel fijn om met hun te praten want we hebben allemaal een passie hiervoor. Twee weten er altijd meer dan een, dus ik vind het hartstikke leuk om zo ideeen op te doen.&nbsp;<br> <br>Guido: Maar als in een deel van de marketing bakken werk is, is er een dikke kans dat andere onderdelen werken, dan is het jammer om maar met één deel te werken, maar je kan wel ideeen van elkaar op doen natuurlijk en dan hopelijk inderdaad, maar wat je zegt, hopelijk nemen de klanten meerdere pakketen af, email marketing, on site optimalisatie zodat je dat aan elkaar kan knopen.<br> <br>Monique: Ja ik raad het ook zeker aan om alles met je online marketing collega's te delen. Misschien ook met je sales collega's want die één idee kan de ander idee oproepen en zo krijg je eigenlijk een soort sneeuwbal effect.<br> <br>Guido: Hey Monique dankjewel, onze tijd zit erop. Super dat je dit allemaal met ons wilde delen en we gaan ongetwijfeld nog meer blogs en praatjes van jou tegenkomen binnenkort en misschien nog een addendum van een boek!&nbsp;<br> <br>Monique: Ja wie weet! Lijkt me leuk.&nbsp;<br> <br>Guido: Dankjewel!&nbsp;<br> <br>Monique: Ja oké dankjewel! Doei.&nbsp;</p><p>‍</p>",
  "show_notes": "<ul><li><a href=\"https://nl.linkedin.com/in/monique-zwanenburg\" target=\"_blank\">Monique op LinkedIn</a></li><li>Blog van Monique: <a href=\"https://blog.ism.nl/em/succesvol-ab-testen-in-e-mailmarketing-een-stappenplan\" target=\"_blank\">\"Succesvol A/B-testen in e-mailmarketing: een stappenplan!\" </a></li><li>Boek: <a href=\"https://www.managementboek.nl/boek/9789089652294/meer-omzet-met-je-webshop-jurjen-jongejan\" target=\"_blank\">Meer omzet met je webshop</a> van Jurjen Jongejan </li><li><a href=\"https://www.datatrics.com/nl/\" target=\"_blank\">Datatrics</a></li><li><a href=\"https://ddma.nl/nationaleemailbenchmark/\" target=\"_blank\">De nationale e-mail benchmark van DDMA </a></li><li><a href=\"https://info.ism.nl/whitepapers/em/invulsheet-voor-a/b-testen-in-e-mailmarketing\" target=\"_blank\">Invulsheet voor A/B testen met je e-mail</a></li></ul><p>‍</p>",
  "guests": [],
  "youtube_url": "",
  "main_image": "valideren-van-je-e-mail-marketing.jpeg",
  "language": "nl",
  "type": "podcast"
}