{
  "id": "analisis-y-optimizacion-multicanal-e-commerce-y-tiendas-fisicas-con-un-objetivo-comun-con-hector-mainar",
  "title": "Análisis y optimización multicanal: e-commerce y tiendas físicas con un objetivo común",
  "description": "Hablamos con Hector Mainar, director digital de Futbol Emotion, sobre la medición y mejora en un negocio que emplea tanto canales digitales como tiendas físicas",
  "date": "2025-01-09T14:26:30.830Z",
  "duration": 3304,
  "audio_url": "https://chrt.fm/track/D992D/media.transistor.fm/21f59e32/798009f9.mp3",
  "transcript_url": "<p>En la conversación con Hector, de Futbol Emotion, estas fueron algunas de las cuestiones principales que tratamos:<br></p><ul><li>¿Cómo se planifica la mejora en Futbolemotion, es un trabajo estructurado y planificado, se hace en base a cuando surgen las oportunidades?</li><li>¿Cuales son las mejores decisiones que se han tomado a lo largo de la historia del proyecto en términos de rentabilidad?</li><li>El uso de la tecnología es clave para un proyecto digital, ¿cuales han sido las decisiones tecnológicas claves en la historia de Futbol Emotion?</li><li>¿Qué tipo de experimentación y personalización se hace en un negocio de este tipo, donde hay experiencia digital y física por igual?</li><li>En base a tu experiencia, ¿cuales son las mejores prácticas de conversión que has comprobado que son realmente eficaces para un negocio como el vuestro?</li><li>¿Los datos de la experiencia física en tienda se emplean en la estrategia digital y viceversa?</li><li>¿Cuales son los retos de un marketplace como el vuestro de cara al futuro?</li></ul><p>Hector compartió con nosotros la visión que tienen del e-commerce y d elas posibilidades futuras de los canales digitales para cualquier comercio, y como deben ser medidas las experiencias e interacciones para poder obtener el máximo rendimiento.</p>",
  "show_notes": "<ul><li><a href=\"https://www.linkedin.com/in/hectormainar/\"><em>https://www.linkedin.com/in/hectormainar/</em></a><em>&nbsp;</em></li><li><a href=\"http://www.hectormainar.com/\"><em>http://www.hectormainar.com/</em></a><em>&nbsp;</em></li><li><a href=\"https://twitter.com/hectormainar\"><em>https://twitter.com/hectormainar</em></a><em> </em></li></ul>",
  "guests": [
    {
      "id": "hector-mainar",
      "name": "hector-mainar",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "es",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/analisis-y-optimizacion-multicanal-e-commerce-y-tiendas-fisicas-con-un-objetivo-comun.jpg",
  "language": "es",
  "type": "podcast"
}