{
  "id": "bienvenidos-a-crocafe-en-espanol",
  "title": "Bienvenidos a CRO.CAFE en español",
  "description": "El multipremiado podcast sobre conversión y mejora de experiencia de cliente que comenzó su emisión en 2019 y que ya cuenta con miles de suscriptores.",
  "date": "2025-01-08T20:07:07.547Z",
  "duration": 0,
  "audio_url": "https://cdn.transistor.fm/file/transistor/m/shows/16111/f2936f99c1708e4caf452fbc929b5eae.mp3",
  "transcript_url": "<p>Si trabajas en el mundo del marketing digital o en la optimización, mejora, diseño y desarrollo de servicios y productos digitales, este es el podcast que no te puedes perder. Bienvenidos a CRO.CAFE en español, por fin en español el multipremiado podcast sobre conversión y mejora de experiencia de cliente que comenzó su emisión en 2019 y que ya cuenta con miles de suscriptores.</p><p>Mi nombre es Ricardo Tayar, tras más de 20 años dedicado al mundo de la optimización y conversión en negocios digitales voy a ser vuestro anfitrión en este podcast, en el que contaré con los mejores profesionales de CRO de habla hispana de todos los rincones del mundo.</p><p>Queremos dar voz a todo tipo de profesionales digitales vinculados al CRO y compartir y aprender con ellos, desde aquellos que trabajan en grandes compañías a profesionales y proyectos pequeños de los que podemos aprender muchísimas cosas. En este podcast vas a escuchar cosas que no vas a oir en ningún evento ni en ningún otro lugar, os lo aseguro.</p><p>¿Qué podéis esperar de este podcast? De inicio, lanzaremos un episodio nuevo cada 15 días. Y en cada episodio entrevistaré a un profesional procedente de cliente, agencia o solución, para centrarnos y profundizar en un tema específico sobre el que tratará el episodio.</p><p>Por supuesto no vas a querer perderte ni un solo episodio, así que por favor, suscríbete en tu app favorita de podcasting, seguramente la que estás usando ahora. Si no es así puedes ir a cro-cafe.es/suscribir para encontrar la app que quieres usar y suscribirte.</p><p>Y si estás pensando “hey, creo que puedo contar algo interesante en este podcast o creo que deberías entrevistar a esta persona”, no lo dudes, mándame un mensaje a <a href=\"mailto:ricardo@cro-cafe.es\">ricardo@cro-cafe.es</a> o pon un mensaje en el grupo de Facebook cro-cafe.es/facebook y seguro que podremos hacer un episodio con esa persona muy pronto.</p><p>De nuevo, bienvenidos a la comunidad de CRO.CAFE en español. Os invito a que nos escucheis. Este podcast está hecho con mucha dedicación, cariño y solo pensando en contenido de calidad. Nos vemos en el siguiente episodio y seguid optimizando.</p><p><br></p><p><br></p><p>‍</p>",
  "show_notes": "<p><a href=\"/suscribir\" target=\"_blank\">Suscribir</a></p>",
  "guests": [
    {
      "id": "ricardo-tayar-lopez",
      "name": "ricardo-tayar-lopez",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "es",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/bienvenidos-a-crocafe-en-espanol.jpeg",
  "language": "es",
  "type": "podcast"
}