{
  "id": "como-integrar-experiencias-de-compra-fisicas-con-activos-digitales-supermercados",
  "title": "Como integrar experiencias de compra físicas con activos digitales: supermercados",
  "description": "Hablamos con Rocío Sanz sobre cómo medir y optimizar la experiencia de compra, off y online, de un supermercado, y sobre la integración de ambos.",
  "date": "2025-01-09T14:26:30.830Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/164b6dc4/e16fab01.mp3",
  "transcript_url": "<p>En este episodio con Rocío Sanz, eCommerce Manager de Supermercados Dia, hablamos largo y tendido sobre los principales aspectos que afectan a la conversión y rendimiento comercial de un supermercado online y como esta experiencia de compra integra los canales off y online.</p><p>Algunos de los temas que tratamos son los siguientes:</p><ul><li>La compra en un supermercado autoservicio forma parte de nuestro día a día desde 1916 (Piggly Wiggly), y arrastramos unos hábitos, un modelo de uso desde hacer muchos años&nbsp; ¿cómo se adapta esa experiencia de compra al formato digital para que sea exitosa?, ¿se utilizan los datos procedentes de la experiencia física para crear la experiencia digital?</li><li>Este año Flat 101 ha lanzado un estudio muy extenso sobre experiencias digitales de compra en supermercados y hay tres painpoints principales según los usuarios: falta de contenido nutricional, menús complejos y filtros poco útiles,&nbsp; ¿cómo se mide la evolución de estos painpoints y cómo definís las acciones para mitogarlos?</li><li>¿Cómo se trabaja en el día a día para medir y optimizar un supermercado online?, ¿cual es el método de trabajo y los KPIs principales que se siguen para valorar el rendimiento?</li><li>¿Cuales son las principales diferencias entre el modelo digital de un supermercado y otros en los que hayas trabajado previamente?</li><li>Para poder medir y proponer mejoras, ¿cual es el stack de herramientas con el que trabajáis en DIA y con qué objetivos o utilidad?</li><li>¿Cuales son los drivers de conversión principales que existen en un supermercado online?, ¿cómo los gestionais?</li><li>Con la llegada del Covid la compra online en supermercados se ha incrementado notablemente. Ya han pasado varios meses desde el inicio de la pandemia, ¿esta tendencia se mantiene, mengua, se incrementa?</li><li>Al tener la mayoría de supermercados espacios físicos de compra, ¿es este el momento de crear experiencias híbridas de verdad, qué estáis haciendo en ese sentido?</li><li>¿Cómo será comprar en un supermercado online dentro de 10 años?, ¿cómo lo imaginas?</li></ul><p>Rocío se explica de una manera clara y muy didáctica y comparte con nosotros los grandes hitos y retos de su trabajo cada día. Disfrutadlo, que vale mucho la pena.</p>",
  "show_notes": "<ul><li><a href=\"https://www.linkedin.com/in/rociosanzortega/\"><em>https://www.linkedin.com/in/rociosanzortega/</em> </a></li></ul>",
  "guests": [
    {
      "id": "rocio-sanz",
      "name": "rocio-sanz",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "es",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/como-integrar-experiencias-de-compra-fisicas-con-activos-digitales-supermercados.jpeg",
  "language": "es",
  "type": "podcast"
}