{
  "id": "cro-para-dummies",
  "title": "CRO para dummies",
  "description": "En este episodio introducimos que es el CRO, de donde viene y en qué consiste para todos los que no lo tengáis claro.",
  "date": "2025-01-08T20:07:07.547Z",
  "duration": 0,
  "audio_url": "https://chrt.fm/track/D992D/media.transistor.fm/a04748e8/3836f8ba.mp3",
  "transcript_url": "<p>CRO para dummies.<br></p><p>Este episodio bonus lo hago como sugerencia de mi compañero de fatigas en este podcast, Luis Miguel Ferrer, que siempre me dice cosas como “muy chulo esto del CRO pero hay un montón de cosas que no acabo de entender”, así que me ha animado a grabar un episodio con este objetivo, el de iniciar a cualquier persona que no tenga ni idea de esto en el mundo del CRO.<br></p><p>Así que vamos con este CRO para Dummies. Coge tu café, té o chupito favorito, y relájate y escucha.<br></p><p>Empecemos por el principio, ¿de donde viene el término y qué significa?<br></p><p>La burbuja del internet de los 2000, la creación de herramientas como Google Website Optimizer en 2007, el auge del data driven &gt; Sobre 2008-2012 empieza a haber libros sobre LPO y posteriormente sobre CRO &gt; Always be testing, de 2008, de Bryan Eisenberg<br></p><p>En que consiste el CRO:<br></p><ol><li>El marco de trabajo, ¿cuales son los objetivos que perseguimos, como ha funcionado todo hasta ahora?</li><li>Analizar datos buscando ineficiencias. Cuantitativos y cualitativos. Más allá del reporting, análisis, ¿por donde empezar? El proceso principal del negocio que estudias, ¿se mide? Compara datos por periodos de tiempo, segmenta por fuentes o tipologías de usuario, etc.</li><li>Plantear hipótesis. Ya sabemos que hay un error, ¿qué lo explica?</li><li>Definir acciones correctoras. Tenemos una hipótesis, definamos acciones que pueden ayudar a que se corrija.</li><li>Testing y experimentación. Test y más test.</li><li>Uso y aprendizaje.&nbsp;<br></li></ol><p>Que debemos conocer: Ir al episodio bonus 1<br></p><p>Debemos entender que hay dos aproximaciones: testing y exprimentación puro y aproximación basada en el conocimiento.<br></p>",
  "show_notes": "<ul><li>ricardotayar.com</li><li>flat101.es</li></ul>",
  "guests": [
    {
      "id": "ricardo-tayar-lopez",
      "name": "ricardo-tayar-lopez",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "es",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/cro-para-dummies.jpg",
  "language": "es",
  "type": "podcast"
}