{
  "id": "diseno-de-experiencias-digitales-positivas",
  "title": "Diseño de experiencias digitales positivas",
  "description": "Hablamos con Mauren Kaufmann sobre el diseño de experiencias digitales positivas como un activo de conversión y como el branding impacta, y mucho, en negocio.",
  "date": "2025-01-09T14:26:30.830Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/2a7c6e9a/2e9b9791.mp3",
  "transcript_url": "<p>¿Cual es tu background?</p><p>Mi background siempre ha sido en el área de diseño y en el entorno digital. Desde que estaba en el colegio y usábamos Paint, sabía que quería estudiar diseño. Donde estudié mi carrera en Caracas, reforzaban muchísimo las bases teóricas y retóricas del diseño y la estética, tuve muy buena base y desde muy temprano en mi carrera, identifique mi pasión por lo digital, para ese entonces ni conocía la terminología UX (user experience) pero sin si quiera saberlo, lo practicaba tanto offline como eventualmente online. Siempre me ha interesado mucho las relaciones intra-humanas y como como individuos nos relacionamos con los productos y servicios que usamos. </p><p>¿Cómo ha sido tu evolución profesional?</p><p>Mi evolución personal ha sido GRANDE, empecé aceptando un proyecto MUY mal pagado en el 2009 cuando todavía estudiaba, para hacerle la página web a un Catering aquí en Miami (yo vivía en Venezuela para ese entonces) y sin haber tenido experiencia previa en trabajos reales en web, acepté el reto y ahí empecé y lo que no supe hacer, lo aprendí. </p><p>Luego trabajé como outsource en varios Startup para Latam, más que nada haciendo UI/UX de sus Apps y de la mano del CTO (director técnico) y CMO (director marketing) aprendí muchísimo sobre trabajar de manera ágil, en equipo, sobre los entregables al equipo de tecnología, a incorporar las estrategias de Marketing en los diseños, a iterar, etc…</p><p>Y hoy en día diseño marcas nuevas, páginas webs, e-Commerce y hago consulting para clientes en todas partes del mundo. </p><p>¿En qué consiste tu trabajo her hoy día?</p><p>Consiste en crear desde cero ó, mejorar productos digitales ya existentes. Depende de el punto en el que entre a trabajar con la empresa. Para empresas nuevas o que no tienen presencia en la web, empiezo por lo más básico: concepto, marca, branding, canales de venta, estrategia de e-Commerce y finalmente su diseño y ejecución. </p><p>Para marcas ya establecidas y con presencia web, los ayudo en mejorar su página o e-Commerce actual y su ecosistema digital. No se trata solo de la marca y la interfaz gráfica (sí, eso es muy importante), pero también ayudarlos a concebir un sistema integral de plataformas y/o apps que los ayuden a optimizar y centralizar procesos. </p><p>¿Cuales son los proyectos o mejoras en los que has estado trabajando últimamente para tus clientes?</p><p>Entre noviembre y diciembre, en campañas de Black Friday y Festivos para los e-Commerce, que este año por temas confinamiento, las compras online prometían MUCHO. Este 2020 hice un énfasis en todos los touchpoint del funnel, desde el diseño de los emails, los ads, las comunicaciones en redes sociales, y obviamente el mero e-Commerce: que es a donde llegan finamente estos leads, o el cliente recurrente. No basta con hacer las campañas y los creativos, sino era clave para mis clientes, tener una experiencia de usuario consistente y un destino de llegada efectivo, sin fricciones, en donde todos sus potenciales clientes consiguieran e identificaran las promos fácilmente para así poder cerrar la compra, lograr la conversión. </p><p>Cuéntanos cómo has llegado hasta aquí, ¿cuales son los retos a los que deben enfrentarse tus clientes?</p><p>He llegado hasta aquí fluyendo con todas las experiencias tan distintas que he tenido con todos mis clientes, desde los más chiquiticos hasta los más grandes y multinacionales. &nbsp;Eso para mi es lo mejor de ser freelance, independiente, que tienes diversidad de clientes. He aprendido mucho de colegas, de los equipos de cada uno de ellos con quién he trabajado, del equipo de marketing, de programación y hasta de relaciones públicas.</p><p>Independientemente de la paga o la remuneración, yo soy una persona que doy. No establezco relaciones lineales y literales. Para mí no es solamente diseñar un banner un un PDP. Para mí es oír al cliente y entender que quiere, es observar a su consumidor final y su comportamiento, es recomendar ajustes e iteraciones basado en la data y la analítica.</p><p>El reto de mis clientes al final del día es mi reto también, que generalmente es un producto atractivo, real, honesto y que venda. </p><p>La mayor parte de tu trabajo es apoyar a marcas e iniciativas en crear una experiencia digital que les ayude a vender, y eso está muy vinculado con el CRO, nuestro tema principal, ¿cuales son los procesos creativos que más ayudan a las marcas a ser competitivas y vender mejor?</p><p>Los procesos creativos que más ayudan a las marcas es tener bases sólidas, es tener su branding “on-point”, </p><p>En poder comunicar de manera efectiva, visualmente atractiva y directo al grado, de que va la marca, los productos y cuales son los factores diferenciados.</p><p>Hoy en día, en un mundo digital sobre saturado de productos y marcas, las fotos, los gifs y los videos permiten a los usuarios sentirse más cerca del producto o el servicio. Hay que utilizar esos recursos de una manera efectiva. </p><p>¿Es el arte, el diseño, un activo de valor para un e-commerce?</p><p>Lo es y muchísimo. Un e-Commerce que quiera generar confianza y agrado en sus usuarios, necesita tener su imagen en un buen punto (como comenté anteriormente) necesita un buen nivel de estética, y poder dar a conocer su personalidad, y eso se logra con los activos de cada marca. De hecho últimamente hemos hecho un par de e-Commerce donde me he involucrado en la dirección de arte, en el styling de las fotos, hemos hecho sesiones de fotos puntuales para banners y el resultado ha sido estupendo. </p><p>De lo contrario, un marca que no llega a un buen nivel estético puede generar desconfianza entre sus posibles clientes. </p><p>Yo esto revisando mis stories, le doy click a un ad, llego a la página y no se ve PRO, lo más probable es que no compre. Porque seguramente habrá un producto igualito con mejor diseño. </p><p>Cuales son los principales problemas que debes resolver en tus clientes y cómo lo haces</p><p>Los principales problemas es realzar la imagen de sus e-Commerce, mejorar el UI/UX, “reducir la cantidad de clicks para efectuar la compra”, ese es el pain que oigo en casi todos mis clientes últimamente. Y de ahí dependiendo del estado del e-Commerce, orquestro la sinergía entre el diseño, los textos, el contenido y la experiencia de usuario para lograr resolver, sin comprometer nada en el camino. </p><p>Es muy importante tener un balance sano entre todos estos elementos, textos descriptivos pero no muy largos, imágenes llamativas pero que muestren el producto, diseño UI/UX innovador pero que comunique y que no le baje el performance a la página. </p><p>Es como encontrar el punto de sal perfecto en la tortilla de patatas, que la de mi abuela (por cierto Madrileña) era la mejor! </p><p>Cuales son los retos que tienes ahora mismo para 2021</p><p>La verdad que ninguno, más bien el 2021 promete. En 2020 estuve reforzando las bases de mi práctica y mi posicionamiento como creativa y consultora freelance en este país y el 2021 vamos con todo. Me quedo así como estoy, no quiero ser agencia, quiero mantenerme en este nivel de operatividad con mi equipo pequeño de 4, todas mujeres latinas. Gracias a Andrea Romano tu colega, que me motivó para empezar a delegar y poder crecer un poquito más. </p><p>La digitalización de los negocios es hoy día una necesidad, no una opción, pero en muchas ocasiones apenas hay diferenciación entre propuestas, ¿en qué debe fijarse una marca para diferenciarse y cómo debe hacerlo?</p><p>Debe fijarse en su interior, tal cual como nosotros los humanos buscamos dentro ese factor diferenciador entre nosotros. Una vez encontrado, es saber expresarlo y proyectarlo. No hay nada como honestidad en las marcas. El reto está en saber llevar ese hallazgo a una propuesta gráfica, a una experiencia digital. </p><p>También es buena idea ver que está haciendo bien la competencia, evolucionarlo y contrastarlo. </p><p>¿Cómo es tu relación con los datos?, ¿son algo que tienes en cuenta como un elemento para demostrar la idonedidad del diseño?</p><p>No te voy a mentir, no soy analista de datos como tal pero es una información que estoy constantemente validando y corroborando, para mi es un reality check constante, los datos son los que nos hacen pisar tierra a nosotros los diseñadores, los que nos hacen ser un poco más objetivos.</p><p>¿Cuál es la técnica o recurso que consideras más útil para que una marca pueda convertir y vender bien en un escenario digital?</p><p>No podría decirte una como tal, es el balance de todos los puntos que hemos hablado hoy, es el juego armónico de los elementos, siempre SIN olvidarnos de que tenemos que comunicar claramente, es no perder el discurso, es tener forma y contenido. </p><p>Es siempre evolucionar, diseñar, lanzar, probar, iterar y optimizar, los e-Commerce son entidades vivas.</p><p>Recursos puntuales: CTA claros, botones fáciles de ver, llamativos, llevar de la mano al usuario en la navegación, no asumir nada de él, más bien ayudarlo. </p><p>¿Qué aprendizaje tienes (vinculado o no al CRO) qué crees que otros no que te gustaría compartir con nuestra audiencia?</p><p>Mi aprendizaje más grande es que hay que diseñar y crear productos digitales escalables. No podemos responder solo a las tendencias. Hay que pensar también en futuro de la marca, del e-Commerce. Hay que asegurarse de que lo que estemos creando hoy, va a poder servir para mañana en un mundo que está constantemente cambiando. </p><p>¿Sobre qué cosas te gustaría trabajar en los próximos 12 meses?</p><p>Análisis más profundo de la data. Experiencias híbridas offline y online, que con Covid hemos visto la necesidad de. Diseño de productos más inclusivos y éticos. </p><p>¿Libros o recursos sobre CRO o cualquier otro tema que te gustaría compartir con nosotros?</p><p>Para mí tanto Lean Startup como Lean UX son básicos. </p><p>Como persona de Venezuela que vive y trabaja en USA como freelance, ¿qué aprendizajes puedes darnos para las personas de habla hispana que nos están escuchando?</p><p>Tenemos mucho valor y mucho que aportar. Venimos de un entorno con una cultura muy rica, de dificultades, con mucha adversidad y diversidad, con mucha “calle”. Tenemos que meter toda esa “roncha” y esa picardía en nuestra línea trabajo, apalancarnos en ella y crecer de ahí.</p>",
  "show_notes": "<ul><li><a href=\"https://www.linkedin.com/in/mauren-kaufmann/\"><em>https://www.linkedin.com/in/mauren-kaufmann/</em> </a></li><li><a href=\"https://maurenkaufmann.com/\"><em>https://maurenkaufmann.com/</em> </a></li></ul>",
  "guests": [
    {
      "id": "mauren-kaufmann",
      "name": "mauren-kaufmann",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "es",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/diseno-de-experiencias-digitales-positivas.jpeg",
  "language": "es",
  "type": "podcast"
}