{
  "id": "el-arte-y-la-marca-como-activos-de-los-negocios-digitales",
  "title": "El arte y la marca como activos de los negocios digitales",
  "description": "En este episodio conversamos con Cecilia Rodríguez sobre construcción de marcas, arte, narrativas y comunicación y la importancia de todo ello para un negocio.",
  "date": "2025-01-09T14:26:30.830Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/a8928a84/279fe25d.mp3",
  "transcript_url": "<p>Cecilia Rodríguez es directora de arte y coach ontológica, y en este episodio hablamos y reflexionamos sobre la importancia del arte y la construcción de marcas de cara a la comunicación y su importancia en todos los aspectos de una marca, incluida su capacidad comercial o de transacción.</p><p>Entre los temas que abordamos en esta conversación están las respuestas a preguntas como:</p><ul><li>¿Qué hace una directora de arte y cómo ese conocimiento se aprovecha hoy día en un espacio digital?</li><li>Crear una marca es en sí mismo un activo de negocio, ¿cómo se crea una marca, y como se traslada esa identidad a un escenario digital?</li><li>La capa visual, lo que una marca transmite, es crítico para que venda, para que fidelice, ¿cómo se trabaja ese proceso, qué impacto tiene la marca en negocio?</li><li>¿Qué marcas te han sorprendido últimamente (les comprarías todo lo que anuncien) y por qué?</li><li>Al trabajar para múltiples clientes en la creación de sus marcas o contenidos, ¿cuales has visto que son los errores comunes?, ¿y los aciertos?</li><li>¿Se aprecia el valor del diseño ahí fuera, en el mundo freelance?</li><li>¿Cómo una empresa o iniciativa puede conocer el valor de su marca?</li></ul><p>Además Cecilia comparte con nosotros algunos aspectos de su aventura emprendedora como freelance y los diferentes retos que ha tenido que ir superando hasta crear su propia marca, Proyectario.</p>",
  "show_notes": "<ul><li>https://www.linkedin.com/in/ceciliarod/</li><li>https://www.proyectario.com/</li></ul>",
  "guests": [
    {
      "id": "cecilia-rodriguez",
      "name": "cecilia-rodriguez",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "es",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/el-arte-y-la-marca-como-activos-de-los-negocios-digitales.jpeg",
  "language": "es",
  "type": "podcast"
}