{
  "id": "el-diseno-motor-de-cambio",
  "title": "El diseño, motor de cambio",
  "description": "Charlamos con Javier Cañada sobre la importancia del diseño para construir productos y servicios digitales bellos y que conviertan.",
  "date": "2025-01-08T20:07:07.547Z",
  "duration": 0,
  "audio_url": "https://chrt.fm/track/D992D/media.transistor.fm/4bc83f7b/eab3fa53.mp3",
  "transcript_url": "<p>Con Javier hemos tratado todos estos temas y alguno más:</p><ul><li>Me gustaría empezar por una pregunta un tanto básica, pero las bases son muy importantes en cualquier disciplina, ¿qué es el diseño?, ¿y qué es el diseño digital?</li><li>En la web de tramontana.net hay una frase que esconde una reflexión muy profunda “No formamos a los profesionales que demanda el mercado, sino a los que lo van a mejorar.”, ¿el diseño se ha convertido en un commodity, se ha desnaturalizado, se ha convertido en un servicio serializado carente de valor?</li><li>Este es un podcast sobre CRO y CXO y el diseño es una herramienta fundamental para conseguir que algo sea atractivo, útil, vendible, deseado, ¿en qué medida influye el diseño en la consecución de objetivos comerciales?</li><li>En mi opinión el diseño en sí entendido como el proceso que conduce a satisfacer necesidades de nuevas formas o a crearlas y a satisfacerlas es un motor de cambio, de innovación, ¿qué necesita una persona para ver más allá de pantallas cuando hablamos de diseño digital?</li><li>Pensemos en las empresas, que generalmente quieren que el diseño sea un diferencial que empuje sus ventas y sus negocios, ¿por dónde deberían empezar para poder crear una propuesta de valor sólida basada en su diseño?</li><li>¿El diseño es algo que todas las empresas deberían emplear, en qué medida?</li><li>Y ahora pensemos en los profesionales, ¿el profesional del diseño es un niño egoista lleno de ego que considera que todo debe hacerse bajo su prisma?, ¿por qué exista esa visión (fundada o no) sobre muchos profesionales del área?</li><li>¿Qué debe tener y no tener un buen profesional del diseño?</li><li>¿El diseño se ha vulgarizado como disciplina o es solo una percepción mia?</li><li>Si tuvieras que lanzar una serie de aprendizajes, experiencias o consejos a una empresa que quiere que su diseño sea útil para sus propósitos comerciales, ¿qué le dirías?</li><li>El buen diseño satisface tan bien nuestras necesidades que es invisible. Esto lo afirmó Donald Norman. Evidentemente parece que el mal diseño es sencillo de reconocer, ¿cómo reconocer un buen diseño aparte de la invisibilidad del mismo o más allá de las afirmaciones de Dieter Rams, Maeda, etc?</li><li>¿Qué diseños digitales te han sorprendido últimamente en positivo?</li></ul><p>Espero que disfrutéis esta charla tanto como yo</p>",
  "show_notes": "<ul><li>https://mobile.twitter.com/javiercanada</li><li>https://www.tramontana.net/</li></ul>",
  "guests": [
    {
      "id": "javier-canada",
      "name": "javier-canada",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "es",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/el-diseno-motor-de-cambio.jpg",
  "language": "es",
  "type": "podcast"
}