{
  "id": "el-marketing-de-contenidos-como-motor-de-un-negocio-digital",
  "title": "El marketing de contenidos como motor de un negocio digital",
  "description": "Hablamos en detalle del marketing de contenidos para conocer en detalle esta técnica para poder aprovecharla como parte de nuestra estrategia CRO.",
  "date": "2025-01-09T14:26:30.830Z",
  "duration": 0,
  "audio_url": "https://chrt.fm/track/D992D/media.transistor.fm/12c9d215/6d5ab728.mp3",
  "transcript_url": "<p>En este episodio hablamos con Mariam de todos estos temas y de alguno más:</p><ul><li>Cada red social tiene su propio código de comunicación, y en función de cómo se emplee se puede llegar a más o menos público, ¿cual es el núcleo del código de comunicación de IG?, ¿y de LinkedIn?</li><li>Decidiste emprender hace poco más de un año tu propio negocio y que el marketing de contenidos fuera tu motor de captación, tu principal fuente de conversión, ¿por qué contenidos y no otros medios?</li><li>El trabajo que realizas implica, preparación, selección de contenidos, etc… ¿cómo es un día en la preparación de un contenido, por ejemplo, y cuanto tiempo lleva? Me parece especialmente importante explicarlo para aquellas personas que crean que generar estos contenidos es sencillo y lleva poco tiempo.</li><li>¿Qué ratio de conversión estimas o sabes que puede generar un buen contenido?</li><li>Hablemos de un concepto bastante ambiguo, ¿qué es contenido de valor?</li><li>¿Cuales son las características principales de un contenido que está pensado para poder generar clientes?</li><li>Este es un podcast sobre conversión en negocios digitales, ¿en qué medida y para qué negocios el uso de contenidos puede suponer un medio atractivo para mejorar la eficacia comercial de un negocio?</li><li>La generación de contenidos suele generar a su vez autoridad, ¿esto es escalable cuando hablamos de una empresa?</li><li>Ok, me has convencido, hagamos contenidos pensando en convertir, ¿cómo empiezo, qué canal selecciono, en qué tono comunico y para qué?</li></ul>",
  "show_notes": "<ul><li><a href=\"https://mariamveiga.com/\">https://mariamveiga.com/</a></li><li><a href=\"https://www.instagram.com/mariam_veiga/\">https://www.instagram.com/mariam_veiga/</a></li><li><a href=\"https://www.linkedin.com/in/mariamgarciaveiga/\">https://www.linkedin.com/in/mariamgarciaveiga/</a></li></ul>",
  "guests": [
    {
      "id": "mariam-veiga",
      "name": "mariam-veiga",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "es",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/el-marketing-de-contenidos-como-motor-de-un-negocio-digital.jpg",
  "language": "es",
  "type": "podcast"
}