{
  "id": "influencers-y-publicidad-en-social-media-fantasia-o-realidad",
  "title": "Influencers y publicidad en social media, ¿fantasía o realidad?",
  "description": "La cuenta de instagram @hasmeunafotoasi nos cuenta los mitos, leyendas y miserias de los influencers y la publicidad que hacen. ¿Listos para flipar?",
  "date": "2025-01-09T14:26:30.830Z",
  "duration": 0,
  "audio_url": "https://chrt.fm/track/D992D/media.transistor.fm/8d961994/e48182c6.mp3",
  "transcript_url": "<p>Estos fueron los temas principales que tratamos en esta atómica conversación:<br></p><ul><li>Cada red social tiene su propio código de comunicación, y en función de cómo se emplee se puede llegar a más o menos público, ¿cual es el núcleo del código de comunicación de IG?</li><li>Gracias a ti hemos descubierto un formato de teletienda de toda la vida adaptado al escenario digital y de social media. No me cabe duda de que esas acciones son eficaces para vender, ¿pero cuales son las prácticas que mejor calan entre los usuarios para convencerles de que compren algo?</li><li>El trabajo que realizas implica edición, preparación, selección de contenidos, etc… ¿cómo es un día en la preparación de uno de tus stories, por ejemplo, y cuanto tiempo lleva? Me parece especialmente importante explicarlo para aquellas personas que crean que generar estos contenidos es sencillo y lleva poco tiempo.</li><li>El social selling se apoya básicamente en dos sesgos muy clásicos: validación social (lo que hace la mayoría -número de seguidores- es correcto y debo hacerlo) y autoridad (lo que un influencer me recomienda me interesa, por ser influencer). Más allá de estas técnicas tan aparentes, ¿qué funciona para vender a través de las redes sociales, y en concreto de IG?, ¿o simplemente dependes del número de seguidores?</li><li>Hay un aspecto ético y de responsabilidad en todo lo relacionado con los denominados influencers, ¿estamos creando una peligrosa tendencia de todo vale para conseguir nuestros objetivos económicos?</li><li>Supongo que muchas autodenominadas influencers estarán rabiando por el hecho de que tú hayas conseguido en relativamente poco tiempo una audiencia grande de una forma orgánica y natural, ¿cuales son las claves para realmente conseguir una comunidad orgánica, sin artificios y sana?</li><li>Este es un podcast sobre conversión en negocios digitales, ¿en qué medida y para qué negocios el uso de redes sociales puede suponer un canal atractivo para mejorar la eficacia comercial de un negocio?</li><li>Da la sensación de que la mayor parte de lo que vemos en IG es una construcción, un mundo irreal, con los riesgos que eso conlleva, ¿es una sensación real o hay personas que realmente son como vemos?</li><li>A raiz del análisis que has hecho de tantas estrategias comerciales de autodenominados influencers, ¿cuales son a tu juicio las mejores y peores prácticas?</li><li>Cuando una empresa está pensando en realizar estrategias de promoción en IG, ¿en quien le recomendarías que se fijara para promocionar su producto o servicio?</li></ul><p>‍</p>",
  "show_notes": "<ul><li>https://www.instagram.com/hazmeunafotoasi/</li></ul>",
  "guests": [
    {
      "id": "hazmeunafotoasi",
      "name": "hazmeunafotoasi",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "es",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/influencers-y-publicidad-en-social-media-fantasia-o-realidad.jpg",
  "language": "es",
  "type": "podcast"
}