{
  "id": "interaccion-diseno-pantallas-y-conseguir-que-hagamos-cosas",
  "title": "Interacción, diseño, pantallas y conseguir que hagamos cosas",
  "description": "Diseño visual y de interacción. Mejores prácticas para convertir y conseguir eficacia con el diseño de interfaces.",
  "date": "2025-01-09T14:26:30.830Z",
  "duration": 0,
  "audio_url": "https://chrt.fm/track/D992D/media.transistor.fm/1417b976/00eb39fc.mp3",
  "transcript_url": "<p>Con Jimena hemos hablado de todas estas cosas:</p><ul><li>Tienes una carrera muy diltada como autónoma / freelance en el campo del diseño visual y de interacción, ¿qué diferencia harías entre el diseño de interacción y el diseño puramente visual?</li><li>El diseño nos condiciona para comprender el propósito y utilidad de cualquier cosa, ¿en qué medida es relevante para que un producto o servicio digital consiga su propósito, convierta?</li><li>Un mal endémico en muchos procesos de diseño es el diseño por comité o el clásico Frankenstein (ponme un poco de todo)... ¿cómo se combate eso al plantear un diseño?</li><li>Por favor, cuéntanos las prácticas más anticonversión que has visto en los diseños en los que has tenido oportunidad de trabajar.</li><li>Y ahora aquellas prácticas que bajo tu experiencia más facilitan el que una persona pueda “hacer cosas” y convertir, sea cual sea el objetivo que persigue el proyecto</li><li>¿Qué consideras necesario para que cualquier persona sea una buena diseñador, que debe saber y por qué?</li><li>Llevas mucho tiempo como freelance y has trabajado en múltiples organizaciones, ¿qué tipo de empresas son las que has visto que más abiertas están a la evolución y mejora en el diseño?</li></ul><p>Y yo que tú no me perdería el episodio</p>",
  "show_notes": "<ul><li><a href=\"https://twitter.com/subidubi\">https://twitter.com/subidubi</a></li><li><a href=\"https://www.linkedin.com/in/jimenacatalina/\">https://www.linkedin.com/in/jimenacatalina/</a></li></ul>",
  "guests": [
    {
      "id": "jimena-catalina",
      "name": "jimena-catalina",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "es",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/interaccion-diseno-pantallas-y-conseguir-que-hagamos-cosas.jpg",
  "language": "es",
  "type": "podcast"
}