{
  "id": "las-areas-de-conocimiento-que-debes-dominar-para-ser-un-buen-profesional-del-cro",
  "title": "Las áreas de conocimiento que debes dominar para ser un buen profesional del CRO",
  "description": "En este episodio bonus hablamos sobre las áreas de conocimiento que todo buen profesional del CRO debe controlar en cierta medida.",
  "date": "2025-01-08T20:07:07.547Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/52687b1b/42fc09c5.mp3",
  "transcript_url": "<p>¿Qué areas de conocimiento debemos controlar en CRO / CXO?<br></p><p>En CRO hablamos en realidad de mejorar la eficiencia de un producto o de un servicio digital, y ello se consigue básicamente localizando ineficiencias y potenciales mejoras, y a partir de ahí formular hipótesis que las expliquen y a la vez predigan lo que puede suceder si se corrigen. Desde ese punto se diseñan acciones correctoras que se suelen llevar a un formato de test o experimento para demostrar su idoneidad, y una vez la teoría queda comprobada, se incorpora ese conocimiento para hacer crecer y mejorar el producto o servicio digital.<br></p><p>¿Y qué conocimientos debemos dominar para poder aportar sentido y dirección a una estrategia y acciones de CRO?<br></p><p>Dado que la disciplian no es una disciplina en sí, sino la aplicación de un método para localizar y resolver problemas de transacción es necesario al menos tener conocimientos con mayor o menor grado de profundidad en cuatro áreas.<br></p><p>NEGOCIO</p><p>Modelos de negocio</p><p>Competencia</p><p>Rentabilidad</p><p>Mercados</p><p>Líneas de negocio</p><p>Datos<br></p><p>COMPORTAMIENTO</p><p>UX/UI</p><p>Reserach</p><p>Behavioral Economics</p><p>Tráfico</p><p>Datos<br></p><p>TECNOLOGÍA</p><p>Herramientas</p><p>Ecosistemas</p><p>Tendencias<br></p><p>CREATIVIDAD</p><p>Diseño de soluciones</p><p>Generación de ideas<br></p><p>Resolver un problema bajo un único prisma o visión es muy complejo. No suele dar resultado. Debemos tener una visión amplia que nos permita entender coo los diversos elementos que conforman un negocio digital se relacionan entre sí. Con los mismos ingredientes diferentes personas harán recetas muy distintas, y debemos entender como esos ingredientes funcionan juntos y en que medida debe ser empleado cada uno.<br></p><p>¿Cuales son los conocimientos que consideráis más importantes en CRO y por qué?, ¿cual es el mix más conveniente?, ¿se debe ser especialista en todo? Abramos este debate, pensemos en ello e intentemos ganar conocimiento en todo aquello relacionado con el objeto, producto o servicio que queremos mejorar, porque sin entender como ese producto o servicio se relaciona con todas las variables que hay a su alrededor es imposible hacerlo.<br></p><p>Seamos curiosos, tengamos ganas de aprender, porque esa es la llave para poder mejorar cualquier tipo de producto o servicio, y a nosotros mismos.<br></p>",
  "show_notes": "<ul><li>https://www.linkedin.com/in/ricardotayar/</li><li>https://twitter.com/rtayar</li><li>www.flat101.es</li><li>www.ricardotayar.com</li></ul>",
  "guests": [
    {
      "id": "ricardo-tayar-lopez",
      "name": "ricardo-tayar-lopez",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "es",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/las-areas-de-conocimiento-que-debes-dominar-para-ser-un-buen-profesional-del-cro.jpeg",
  "language": "es",
  "type": "podcast"
}