{
  "id": "digital-analytics-trends-a-changing-industry-and-whats-next",
  "title": "Digital analytics trends: a changing industry and what's next",
  "description": "In this talk, we touch on the shifting trends we see and dig into new tools such as Google's App+Web tracking for a glimpse at what the future may look like. ",
  "date": "2025-01-08T20:07:07.532Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/9c4f8a48.mp3",
  "transcript_url": "<p>Guido X Jansen: [00:00:00] Welcome Krista. I love it to have you here. you just did a session and, for the people that are see you on live stream or, he was speaking on the podcast cause they might recognize you since a lot of people, I assume. I've watched some Google analytics videos in the past, which you did a lot of.</p><p>I think that's have been a great position to be in and, to be able to share and, teach people to do what you do, what you love. but let's start with your session, today. Yeah. The keynote. And you spoke about digital analytics trends, and, talk about what's next in digital analytics.</p><p>yeah. Tell us what's next. </p><p>Krista Seiden: [00:00:37] We talked about is based on some research that I've been doing over the last a month or two, just trying to understand what are the platforms that people are using today to do analytics? What are they looking at tomorrow? what is their game plan when it comes to how they are planning out their digital future, for the businesses.</p><p>And what I've been finding is, a lot of people still use. We use Google analytics, Adobe analytics, some of the major providers as their primary platform when it comes to secondary platforms, some of the smaller players are actually becoming much more popular things like mixed panel and heap and amplitude, segment snowplow.</p><p>there's a bunch of things that are starting to pop up that we hadn't heard. Even a couple of. Yeah. </p><p>Guido X Jansen: [00:01:19] I think you showed a graph. I saw it on Twitter. but I think 80% of them use. Merchants and a website use the bigger names, and then we have 12 points, seven, 8%, the smaller ones and the rest is in house.</p><p>Krista Seiden: [00:01:37] Yeah. And I think in housing is another trend that we're starting to see. So I think, it was seven or 8% that are using in housing, rolling their own analytics as a primary, platform. But when it comes to secondary platforms, we're seeing it a lot more. So people are starting to use more than one analytics platform.</p><p>And often we're seeing that as they start to do another type of platform, another type of data analysis, it's in house, it's doing their own thing. It's getting those data pipelines together and really figuring out how they can take it to the next level with data science, data mining. </p><p>Guido X Jansen: [00:02:10] Yes. And what's driving this trend.</p><p>Krista Seiden: [00:02:12] I think I, over the course of the research, the two biggest things that I saw, and these are actually conflicting, trends is this desire to do more yourself, own it in house and really be in control of your own data. and then the other trend I saw was actually a trend towards consolidation and people wanting to do it all in one platform, being able to see across.</p><p>Web and app or cross platform and those kinds of things. So they're a little bit at odds, but I think the underlying, sentiment in all of it is that people want to own their data. They want to be able to get that raw event data and analyze it the way that they want. And I think that the platforms that allow for that are the ones that are going to, continue to be popular in the future.</p><p>Guido X Jansen: [00:02:50] Yeah. not only just want to own their day now, but with GDPR, especially here in Europe, the need to own part of that. Yeah. That's an important driver </p><p>Bart van der Meer: [00:03:00] and we're all in one, you mean, and not only devices, but different browsers, different locations. So work home, everything combined. </p><p>Krista Seiden: [00:03:07] Yeah, totally. we're a very digital society.</p><p>We have so many different ways of accessing this information and it's really hard as a business to bring it all together, but certainly there's a desire to look at somebody as a user and throughout their entire user journey rather than just a single platform or browser window. </p><p>Guido X Jansen: [00:03:22] Yeah. And you also spoke about a new feature in Google liters combining a webinar app.</p><p>Krista Seiden: [00:03:27] Yeah, absolutely. one of, one of my favorite things is something that I worked on for about two years before leaving Google earlier this year is their new app and web properties. so I worked on as a product manager and also as that analytics advocate, helping people understand what it is they are building and how it would be useful to users or what were the types of things that we needed to consider.</p><p>as we started to build this new platform. and it's exciting. It builds on the success of Google analysts, thanks for Firebase and we flipped that data model on its head. So it goes from a sessions and page view model that we had in kind of the traditional universal analytics or what we see and Google analytics today.</p><p>And it's moving more towards a, an event and perimeter data model, which is what you actually see in some of the newer platforms like a. in Mixpanel an amputee, those types of things. we're looking at how that data can be more useful in the future. and it's really exciting.</p><p>It works cross platform. It takes that Google analytics, our basis, data, ads, web streams of data is what they're calling. Yeah. So you can have multiple different streams from iOS, Android, web. I suspect we'll see things for like single page apps and all of those types of things. and it brings it all together in one.</p><p>No interface one way to analyze it. and I think, and this speaks to some of the trends that we're seeing in the data. One of the really exciting things of this new platform is actually it's all available via an export with big crew for free as compared to the paid version of Google analytics, where you actually have to pay for that big Cray expert.</p><p>So I think there's a lot of things that we're seeing here that are speaking to some of the trends in the data and where the industry is going. </p><p>Guido X Jansen: [00:05:01] Yep. And, so in that sense, do you think. Google is Google catching up to the other, competitors out there or are they lagging behind or </p><p>Krista Seiden: [00:05:09] yeah, I think you can look at it in a number of ways.</p><p>I'm sure. it's a little bit of catching up in terms of that data model and that being the primary data model. but I also think, it's one of the first platforms out there that truly is bringing together webinars and in a way that you can actually analyze that data across everything.</p><p>there are other platforms that have tried to do it. I think people have had varying degrees of success. One of the things that sets Google part is, its ability to be able to map that user across, a namespace, </p><p>Guido X Jansen: [00:05:37] it's hard to do. So </p><p>Krista Seiden: [00:05:38] it's very hard to do. Of course.</p><p>for years we've been saying well, Oh yeah, of course you can do it. You just need a user identifier. So if you have a login, that's great. Yeah. but most websites don't have a login and you need to really be able to, understand that. And so Google is doing some pretty cool things there to be able to make that much more accessible.</p><p>Guido X Jansen: [00:05:55] Yeah. And, and we spoke while, today a couple of times. so you advise companies on their analytics, one of the most common things that you see going wrong or. Sure. </p><p>Krista Seiden: [00:06:08] one of the things that I actually, I find more often than not is not necessarily that things are wrong or broken. they often are.</p><p>But more that people, companies are not taking advantage of the platforms that they have. Yeah. And I find it really funny because in today's fitness businesses, we have more and more platforms and we continue to buy and onto that marketing tech stack. And yet we're underlying under utilizing the tools that we have.</p><p>And even when it comes to something like Google analytics, I've heard very large, premium three 60 paying customers of Google analytics, say. They had no idea they can create a custom segment or what is a secondary dimension or, we're not using event tracking. And it blows my mind because these are very fundamental ways to get more out of your analytics solution.</p><p>And, in my mind, you shouldn't be investing further in other platforms and trying to pull so much data together until you're actually utilizing the platforms that you have. </p><p>Guido X Jansen: [00:06:59] Yep. And do you feel this is more of a lack in technical knowledge or is it more about, The strategies, the goals within the company that might not be well-defined </p><p>Krista Seiden: [00:07:12] no, I think it's, I think it's both, I think you absolutely need to start with some type of business requirements and know what it is you're trying to track and why.</p><p>And hopefully that leads into the types of, tracking and things that you would implement to be able to answer those questions. But I think there's definitely a lack of knowledge. If you don't know that you can create a custom segment to be able to analyze that data, you're never going to be able to take your analysis to that next level.</p><p>Yeah. </p><p>Bart van der Meer: [00:07:33] And so they didn't watch your videos then </p><p>Krista Seiden: [00:07:35] I guess they haven't watched my videos, </p><p>Guido X Jansen: [00:07:37] here's a link. </p><p>Krista Seiden: [00:07:38] Hey, you can check out, let me see Academy. I got all those videos to teach you how to do those kinds of things. but there's so many free resources out there for analytics education.</p><p>so I th I think the resources are there. There's still just a lack of kind of knowing that you need to take it to that next level of, if you're not aware that these things exist, all the training in the world could be there. and yet, you're not going to be able to actually utilize the tools.</p><p>Somebody needs to tell you that is there, </p><p>Guido X Jansen: [00:08:02] especially I think, with Google analytics, for example, we're compared with something like heap, they are recording all the events. Right away after you install heat, but with cooling is you do still a lot of work to do before everything is set up, right?</p><p>The events the e-commerce tracking, I worked for a lot of merchants, so that's something you need to set up and it's not always obvious and straight. </p><p>Krista Seiden: [00:08:21] Yeah. So I think actually that's one of the really cool things that I'm excited about in the new app and web properties. So there's this new thing called enhanced to measurement.</p><p>Where it's actually out of the box, you can just toggle on and off a bunch of different events, that we'll track them automatically. Once you flip that toggle. And the entire goal is that they're trying to make it much more accessible and easy for people who are not as technical or don't have the resources to be able to set those things.</p><p>Because up to do things like scroll tracking and outbound link tracking, search result, tracking, and those kinds of things. And it's amazing that, you can just. Kind can flip a switch and that's turned on now. and I think that list of things that you can do through enhanced, measurement's going to continue to expand.</p><p>And I'm really excited to see where they go with it. </p><p>Guido X Jansen: [00:09:01] That would be really helpful because often you, you want to do an analysis of something that's not measured, then you still have to wait a couple of weeks to get the data. And instead of, Oh, we already have data from. Three years. </p><p>Bart van der Meer: [00:09:11] It's probably going to be like this and like right now, so now they're increasing the data and then the next step is all right.</p><p>So we're going to teach you now what the useful data is to do it actually, so you can act upon it. And so it's probably gonna increase and then decrease that's the normal way it goes, but I'm happy if it would be a lot easier to track things that every normal people would like to track. we still run into eCommerce stores who can.</p><p>Attracting conversions, but don't have the, the order values, for example. Yeah. it's, it makes, working on your CRO a lot harder. </p><p>Guido X Jansen: [00:09:44] Yeah. And then it also comes back to, to the strategy that the companies I've also worked at a company where day one, I came, wasn't got Google, his buddy, or the eCommerce managers for each country.</p><p>They got a report, based on audit data, just a number of orders compared to what they budgeted for. yeah. W what are you going to act upon? They're just started giving our discounts. That's so painful. If that's not, if the data is not there, and if everyone equal, they knew they were, they're not stupid.</p><p>but if that's the data you get and what you talk about with your manager, then that's what you sure. </p><p>Bart van der Meer: [00:10:15] Step one, determines if you get your bonus or not. Then you're going to give her discounts. </p><p>Guido X Jansen: [00:10:19] Exactly. Yeah, exactly. Hey, I want a very practical question about the Google analytics videos. How often did you guys have to redo those again?</p><p>Because maybe a personal frustration? it's not. it's also frustration, but also, amazed by our I'll watch developments. it's continually going through. I often find myself lost in Google and let us go, something changed again, </p><p>Krista Seiden: [00:10:42] for sure. there are parts of them that we've redone over the years.</p><p>I think the Google tag manager course is probably the, the hardest one to keep up to date. and a lot of those updates came in the form of kind of text box telling you that this has changed. I definitely rerecorded scenes of several over time. But I think in general, the most rerecording was just me stumbling over my words in the studio.</p><p>As we were filming, the first ones had a very patient filming crew helping me. And we had a lot of fun in the studio doing this. </p><p>Guido X Jansen: [00:11:08] Yeah. What are the things you're looking forward to? let's say next year, what are the technological advancements in our field? What </p><p>Krista Seiden: [00:11:15] makes you excited? Yeah. I'm very excited to see where Google goes with this new app and web property.</p><p>I think we're, we're just at the beginning. There's a lot of things that aren't there yet. It doesn't have, enhanced eCommerce yet. although it's coming soon, </p><p>Bart van der Meer: [00:11:26] insider information, </p><p>Krista Seiden: [00:11:29] So there's a lot of advancements that are going to come there that are, or helping to get to that use case parody with a universal analytics and then taking it a step farther.</p><p>I think there's a lot of, new features that are app and web only. So for example, the new analysis section that was available or is available in Google analytics, three 60 there's. Some new techniques coming out to analyze your data. And they're coming first and in primarily in the app and web stuff, for example, the padding reports, which were something that I worked on when I was at Google, I helped, build that in launch it.</p><p>And it was actually my personal motto, kill all of the old user reports, a user flow of reports from Google analytics because they were so terrible. so of course, cause that was my motto. I got padding handed to me as something I had to go figure out. but it's exciting. </p><p>Guido X Jansen: [00:12:13] You started complaining, make it better, go fix it </p><p>Krista Seiden: [00:12:17] pretty much Shabbat.</p><p>So that's how Google works in general. </p><p>Guido X Jansen: [00:12:20] I would </p><p>Krista Seiden: [00:12:21] say. Yeah, I'm excited for, to see where that goes. on a more personal note, I'm excited to I really get back into doing digital analytics day to day. So I've recently started my own analytics consulting firm called Ks digital. and I, I'm excited to be helping companies really get into their digital strategy and, analyze their Google analytics data or whatever it might be helping them understand those business requirements and get set up in a way that's going to be really fruitful for them.</p><p>Guido X Jansen: [00:12:47] Type of clients or segments you're looking for or, </p><p>Krista Seiden: [00:12:50] I think you're, </p><p>Guido X Jansen: [00:12:53] it's a Dutch bolt gasoline. </p><p>Krista Seiden: [00:12:56] It depends on the business case. I think my strong suit really is around Google analytics, but just digital strategy in general. I'm looking for clients who are trying to do better with what they're doing online and who may need help auditing what they're doing with Google analytics and setting up a better implementation, setting them a better, solution design and really, driving them.</p><p>Guido X Jansen: [00:13:15] Okay, cool. And, you've been speaking a lot worldwide also, you'll travel to the Netherlands often. So are there are the big differences that you see in how people, handle. Analytics or, what we do in our general area, where we work in, w how people. And old data. Of course we have a lot less data.</p><p>We tend to have less data here. </p><p>Krista Seiden: [00:13:36] what's your view? Yeah, I think, I've seen some really interesting things worldwide. when I was at Google, I spent three months over in Asia doing advocacy for data, over there. Yeah. I think, a lot of those markets are a little less mature in how they're using, analytics data.</p><p>specifically I think some markets are much more mature. </p><p>Bart van der Meer: [00:13:56] I think China's pretty mature with all the cameras they're building </p><p>Krista Seiden: [00:13:59] China's decently mature. I'm constantly surprised by actually the Australian market. I think that they in particular, have gone really deep on just like data analysis and getting really technical with data.</p><p>Almost as if they skipped the whole web analytics, behavioral data side of things and dumped everything into a data warehouse and you have to be very technical to be an analyst there. I think there are pros and cons to all of that, by the way. I think the most of the European market is somewhere in the middle, I think.</p><p>they've started to progress pretty significantly. getting more technical. but I think that there's a strong kind of digital analytics, offering here. I do think you get things like GDPR, which takes away some of that data that you can have access to. everybody is starting to feel the pains of that along with other regulations being put in place in the U S we have CCPA coming up, </p><p>Guido X Jansen: [00:14:48] California.</p><p>Is that right? </p><p>Krista Seiden: [00:14:49] it's a California regulation, but any business that does business with anybody in California has to comply. So basically it's all of the U </p><p>Bart van der Meer: [00:14:55] S just for me, what does it mean? </p><p>Krista Seiden: [00:14:57] the California consumer privacy act. So it's the California version almost of GDPR, except for it's the inverse you actually have to, you don't have to get opt-in consent itself without consent.</p><p>Okay. you have to display a message on the, on your website someplace, basically saying that business has the right to sell your data, would just how they've had they've worded it, something like that. which is it's a little bit off putting. So I'm curious to see the impacts of that.</p><p>But then on top of that, you have things like ITP and ETP now with Mozilla where we're losing more and more data. And we have to figure out ways as analysts to work around that, to get the things that we need, so that we can continue to do our jobs. </p><p>Guido X Jansen: [00:15:33] Yeah. Yeah. those messages might be off putting, but we also have some experience here with GDPR.</p><p>And before that we had a different cookie law, Once every website has it. Yeah. As a user, you </p><p>Bart van der Meer: [00:15:44] just </p><p>Krista Seiden: [00:15:45] it's really? </p><p>Guido X Jansen: [00:15:46] Yeah. It's really annoying. You just click accept, </p><p>Bart van der Meer: [00:15:49] you, click, whatever they throw it to you just click accept. Yeah. It doesn't matter what things are checked on or checked off or </p><p>Guido X Jansen: [00:15:56] yeah.</p><p>Yeah, of course. When you work for companies, they want as many people as possible to accept the ultimate for that. And then you get to over 99% people are accepting and then also. makes it a bit specific </p><p>Bart van der Meer: [00:16:10] conversion optimization process for the </p><p>Guido X Jansen: [00:16:14] cookie. Yeah. </p><p>Bart van der Meer: [00:16:16] The cookie banner popping up. </p><p>Guido X Jansen: [00:16:17] And it's an important one right now.</p><p>Otherwise you sure </p><p>Krista Seiden: [00:16:20] I did a lot of testing actually, in a former role where we actually used something like a user testing.com or validate leap. To go through so many different mocks of, acceptance of different cookie guidelines, and, went from very little acceptance to a place where we felt a little bit more comfortable as a business.</p><p>but definitely something that you need to think about. Don't just slap something up there and hope that everything's going to be okay. </p><p>Guido X Jansen: [00:16:43] Yep. one of the themes today, diversity, what kind of, segments do you see being very useful for clients to be looking at? often clients. It's especially when it started out, just trying to optimize for the average user.</p><p>which can be art if there's no average, which is a big problem, which can be a big, it can be a big issue or maybe even waste of time if there was no, average user, what kind of segments do you often see being very useful for people in, for </p><p>Krista Seiden: [00:17:07] example e-commerce yeah, again, this is really going to depend on the business.</p><p>Some, sometimes things like age and gender demographics, help, and oftentimes, they don't have any impact at all. It's a lot more about that user behavior on site. the things that they're looking at previously, the things they're, showing interest in are great signals for you to be able to then segment that, user experience, offer them more personalized experiences.</p><p>be able to remark it to those users. So I think, while surface level metrics, can sometimes be useful much more often. It's really understanding, what are the major, interests of people on your site. Yeah. And go after those interests </p><p>Guido X Jansen: [00:17:45] and demographics can be tricky.</p><p>we just had someone from Vodafone and, Transavia airlines, saying, yeah, we look at Google analytics, demographics, but yeah. Let me try to validate that's not accurate. </p><p>Krista Seiden: [00:17:59] Yeah. the demographic data is tough, right? Like you have people who share browsers or computers and various things.</p><p>And that infer data is going to be mixed. I've gotten a nicely. Targeted ads to buy men's clothing. And I'm like, I was just, I searched to buy a shirt for my husband, but I'm not a man and I'm not necessarily looking for that. ongoing. And so I think, you have to take that as a grain of salts or just one input into kind of the overall segment that you're building.</p><p>Guido X Jansen: [00:18:27] Yeah. And a lot of companies do it. So if you start optimizing, you start creating those segments and. in this case, if someone's looking for men clothing, probably man, but maybe that's the bulk of the group, but then of course you miss out most people that are, for presence. Yeah. Looking for presence.</p><p>And, so for example, I worked at a flower company. It was a 98% gifting. </p><p>Krista Seiden: [00:18:48] Yeah. </p><p>Guido X Jansen: [00:18:49] yeah. it was a little Swedish company actually. but it was really hard to ultimize for that person, because this week they will buy something for their mother, for a lover, for, I don't know, funerals. We also did.</p><p>so yeah, if it's a gifting, it's really hard to optimize for that. did they can have a, a favorite flower themselves? Does it mean, </p><p>Krista Seiden: [00:19:08] yeah, you definitely don't want to remark it to somebody in the market for funerals. </p><p>Guido X Jansen: [00:19:12] No, exactly. That's that's, it would be awkward. Yeah. and something like Valentine's day or mother's day that you can do that.</p><p>Something that you're after, but for funerals, hopefully that will, yeah. Yeah, that's different </p><p>Bart van der Meer: [00:19:23] and something I'm, I'm curious about, w H how do you feel about it using, can you create like standardized personas in Google analytics? And do you think it's useful, like Heisenberg or I just opened it a Myers Briggs types indicators, things like that.</p><p>What's your opinion about that? </p><p>Krista Seiden: [00:19:40] sure. You can create very detailed segments of the types of users that you're looking for in Google analytics. You can, if you have a three 60 version or something, you can upload a lot of that data back in. if you're doing it in, data warehouse and big query, something like that.</p><p>but I think it's the application of those segments. That's the really important thing. So what are you actually using them for besides just the analysis of your data? How can you be a little bit more proactive? With those segments of data. I think, personalization, when it comes to AB testing solutions, you can share those same segments from Google analytics, into Google optimize, for example, and then personalized towards a persona that you've built out.</p><p>I think personas can also be really useful, not just in your online, analysis and marketing, but also in your product development, right? Understanding that data that you have, and then using that to help guide. How to make a better product for various personas. yes, I think you can do it.</p><p>I think it's the application of what you're using that for. That's more important there. Yeah. </p><p>Guido X Jansen: [00:20:34] I think that's a big change for a lot of customers trying to figure out which segments. Makes sense as a psych, as a psychologist, I have an opinion on my opinion. </p><p>Bart van der Meer: [00:20:44] No, but, yeah, but the idea behind the question was, a lot of companies don't actually have a persona of their customers, they segmented in like small or big or, but not really focused on interest or something. So they usually refer to standardized, personas </p><p>Guido X Jansen: [00:20:59] in that way. So you want to get away right? Or other way run, but really data driven way to create personas. Based on Google analytics data, </p><p>Bart van der Meer: [00:21:06] for example. </p><p>Guido X Jansen: [00:21:07] Yeah, that would be nice.</p><p>Krista Seiden: [00:21:09] It would be nice. I think it's only one part of the input, right? So much of persona building is around the qualitative input. can you do some of that with Google analytics? can you get your qualitative data into GA? Yeah, you can. there's many ways of doing that. I, Google surveys is a great option.</p><p>they're working on some cool stuff there, but. I think it's all of the inputs that go into it. And your quantitative web analytics data is only one part of what a person. Yeah. And I can be. Yeah. I let a year ago persona segmentation project when I was at Google actually. And the GA data certainly was a big input, but.</p><p>It was very much paired with a lot of qualitative, input, both in terms of survey data and diary studies. And then there was some log file analysis and in Google analytics data, and all of that helped us put together who our personas were, based on, a lot of different aspects and that then helped us to build the next iteration of Google analytics.</p><p>Guido X Jansen: [00:22:02] Yeah. And then again, it can be, there are a lot of situational. Aspects again, like again with, example of the flowers, you can target me as a persona, but if I'm buying for someone else, there's some, of course there might be something that are, that can be helpful in a way I buy things, but that might be helpful.</p><p>but still there might be a different situations where someone is in our, I also see a little, usually a lot of. a big difference between people's shopping during working hours or outside of that, or, weekday, weekends, personas is probably the same, but they act </p><p>Bart van der Meer: [00:22:34] differently. Yeah. But there a generalization, We accepted it's a model and a model was never accurate, but, I think it could help, companies who are just starting out, basically trying to use their data in some way. maybe even after doing the first ever check, if data's actually being collected. to start out and to try and understand what you can do with it and maybe advance from there.</p><p>Krista Seiden: [00:22:56] Yeah. And I think, a really cool opportunity maybe for Google's to start thinking along those lines, when it comes to their intelligence, tool set, they're building it to Google analytics, right? The insights cards, the intelligence, can we. Intelligently, tell you about, a unique segment that we found and how that behavior differs from others and, help build those out into personas.</p><p>so I'm happy to pass that along </p><p>Guido X Jansen: [00:23:16] to the team. </p><p>Bart van der Meer: [00:23:17] yeah, no, but it would be awesome if then, and then for Google sake, if you then can connect it to Google ads, basically the analytics is telling you which segment is a highly profitable. </p><p>Guido X Jansen: [00:23:29] that's the whole reason Google is exist is because of Google AdWords.</p><p>Bart van der Meer: [00:23:32] yeah, no, but if Google can, more or less automated or, more specifically do it in the outliers. Yeah. That would be helpful, </p><p>Guido X Jansen: [00:23:40] but got analytics insights also, already, partially doing that. looking at segments, notifying you of weird behavior. </p><p>Krista Seiden: [00:23:47] It's getting better. It's a, it's a multiyear project to really build that out into something that's very useful.</p><p>But, even I, myself am surprised sometimes by the really interesting insights that I'm starting to get there. and I know it's only gonna get better. </p><p>Guido X Jansen: [00:24:01] Those are great insights, right? Whether you're doing a qualitative or quantitative research, if you think, </p><p>Krista Seiden: [00:24:06] yeah. Actually the PM or the insights product actually just pinged me last night about some new stuff that they've got coming down the pipe.</p><p>So I'm pretty excited for that to come out. </p><p>Guido X Jansen: [00:24:14] Cool. Cool. thank you so much. and anything, where do you get your inspiration from? Work-wise? </p><p>Krista Seiden: [00:24:21] I've got a really great group of friends that are in the analytics, digital, marketing space. And I get a lot of inspiration from them, from just hanging out from being at conferences and networking.</p><p>From reading a lot of the new stuff coming out. I think there's some really prolific bloggers in our industry and I get a lot of inspiration from that. yeah, I think there's a lot of places to get that inspiration, I think, it's what you actually do with it. and how you turn that around into.</p><p>a blog post or something, social outreach or a business idea, is really the important thing to take away there. </p><p>Guido X Jansen: [00:24:53] Yeah. So friends in the industry, husbands in industry, both guys do you guys talk about something differently at home or it's mainly </p><p>Krista Seiden: [00:25:03] every once in a while he's okay, we're going to have a Google analytics session.</p><p>‍</p>",
  "show_notes": "<p>Digital analytics trends: a changing industry and what's next - The digital analytics industry has seen a lot of changes in recent years, both in terms of new products and ways of doing analysis, and how analysts want to use such tools and access data.</p><p>Het <strong>Digital Analytics Congres</strong> 2019 vond plaats op 8 oktober 2019 in de Jaarbeurs in Utrecht en wij deden live verslag vanaf de conferentie. Meer over het congres kun je vinden op <a href=\"https://www.digitalanalyticscongres.nl/\">https://www.digitalanalyticscongres.nl/</a>.<br><br>DAC19 werd georganiseerd door het Expertise Center voor Marketing Insights, Onderzoek en Analytics beter bekend als <strong>MOA</strong>. Meer daarover kun je terugvinden op <a href=\"https://www.moaweb.nl/\">https://www.moaweb.nl/</a>.</p>",
  "guests": [
    {
      "id": "krista-seiden",
      "name": "krista-seiden",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "nl",
      "type": "guest"
    }
  ],
  "youtube_url": "https://youtu.be/Mu3dsxygX3E",
  "main_image": "src/assets/images/episodes/digital-analytics-trends-a-changing-industry-and-whats-next.jpeg",
  "language": "nl",
  "type": "podcast"
}