{
  "id": "experimenteren-tijdens-pieken",
  "title": "Experimenteren tijdens pieken",
  "description": "Ik hou even een mini betoog/rant over waarom je juist wél zou moeten experimenteren tijdens piekperiodes (kerst, valentijnsdag, black friday etc etc).",
  "date": "2025-01-08T20:07:07.531Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/c914bfef/296fc6f3.mp3",
  "transcript_url": "<p><br></p><p>Dit is even een andere aflevering dan je gewend bent: in deze aflevering zul je het even met mij alleen moeten doen. No worries, de volgende aflevering zit er gewoon weer een gast in het CRO.CAFE maar vandaag drink ik even een drankje alleen met jou.<br></p><p>Tot nu toe ben ik elke aflevering begonnen met waar de podcast over gaat en dat is data <strong>en</strong> mensgedreven optimalisatie <strong>en</strong> het neerzetten van een cultuur van experimenteren en valideren. </p><p>Ik heb een kleine rant over een cultuur dingetje. En die gaat over bedrijven die <strong>wel</strong> experimenteren, maar <strong>niet</strong> tijdens bezoekers pieken. Denk aan kerst, moederdag of de laatste jaren ook Black Friday. Die pieken zijn voor iedere markt anders, maar de meeste B2C bedrijven ervaren wel een soort van seizoenaliteit en met soms hele duidelijke pieken. Maar er zijn dus bedrijven die juist op die pieken alles stilleggen als het gaat om hun validatieprocess.</p><p>En daar krijg ik een beetje jeuk van.</p><p>In deze aflevering ga ik je vertellen waarom, en als het bij jouw bedrijf ook het geval is kan ik je hopelijk want handvatten geven om je manager ervan te overtuigen waarom je toch echt <strong>wel</strong> zou moeten experimenteren tijdens pieken. Sterker nog: als ik zou moeten kiezen tussen experimenteren <strong>tijdens</strong> pieken of <strong>buiten</strong> de pieken om zou ik <strong>juist</strong> kiezen voor experimenteren <strong>tijdens</strong> die pieken.</p><p>Goed, ik neem even een slokje en dan vertel ik je dat <strong>ook deze</strong> aflevering van het CRO.CAFE &nbsp;uiteraard ook mede mogelijk gemaakt door onze partners Online Dialogue, Convert.com en Effective Experiments. Mocht jij nou ook partner van de podcast willen worden zodat we jouw bedrijf of diensten ook hier kunnen promoten: dat kan zowel zakelijk als privé en daarvoor ga je naar cro.cafe/partner.</p><p>Welkom, bij seizoen 1, aflevering 21.</p><p>Goed, testen tijdens piekmomenten. De argumenten <strong>tegen</strong> testen tijdens pieken klinken meestal als volgt:<br></p><ol><li>“Dingen veranderen tijdens een piek is slecht” (zonder onderbouwing)</li><li>“Klantgedrag tijdens pieken is anders dan normaal, dus de resultaten van je experiment zijn waardeloos”</li><li>“De meeste experimenten die we doen hebben een negatief resultaat, en door te testen met veel meer volume op je site vergroot dat negatieve effect en lopen we heel veel omzet mis”</li></ol><p>En er zijn ongetwijfeld meer redenen die je hebt gehoord, dit zijn in ieder geval degene die ik het meeste gehoord hebt. Ik ga ze 1 voor 1 met je langs en ik ben <strong>erg</strong> benieuwd naar jouw mening hierover dus laat her op de CRO CAFE facebook pagina vooral horen wat je er van vind en hoe we elkaar kunnen helpen dit toch voor elkaar te krijgen.<br></p><h2><strong>Mythe 1: Dingen veranderen tijdens een piek is slecht </strong></h2><p>Ok geen verdere argumentatie maar enkel het statement dat veranderingen slecht zijn.</p><p>Ik zou zeggen: welkom in 2019. Websites en <strong>zeker</strong> webshops veranderen continue:</p><ul><li>producten zijn uitverkocht</li><li>promoties gaan van start of verlopen, nieuwsbrieven worden verzonden</li><li>social media posts worden gedaan</li><li>Adwords campagnes worden bijgestuurd, </li><li>je content managers veranderen afbeeldingen en teksten</li><li>je dagelijkse cutoff voor next day delivery wordt bereikt waardoor je propositie ineens anders wordt</li><li>of je hebt wellicht zelfs personalisatie algoritmes draaien.<br></li></ul><p>Al die dingen die continue de website veranderd gaan gewoon door tijdens piekmomenten. <br></p><p>Als veranderingen slecht zouden zijn zou je <strong>al</strong> deze dingen <strong>ook</strong> niet moeten doen en <strong>dat</strong> gaat natuurlijk niet gebeuren. Ofwel: je bent en blijft continue vanalles aan het veranderen op je website. En dikke kans dat een groot deel van al die andere veranderingen überhaupt niet eens gemeten wordt dus als die een effect hebben (pos or neg) dan weet je het niet eens.<br></p><p>Het tijdelijk stoppen van je experimenteren verandert dus <strong>niets</strong> aan het feit dat er nog steeds ontelbaar veel veranderingen plaatsvinden op je website. Wat het stoppen van je experimenten <strong>wel</strong> doet is dat je stopt met valideren en leren van de veranderingen die je maakt.<br></p><p>Het uitvoeren van gecontroleerde experimenten <strong>is</strong> niet gevaarlijker voor je business dan dingen doen op basis van gut feeling. En ok, experimenteren kun je niet op alles en is ook niet perfect, maar je bent op z’n minst je <strong>best</strong> aan het doen om te proberen uit te vogelen <strong>wat</strong> de impact van je veranderingen is op je bezoekergedrag en je bedrijfsresultaten.<br></p><p>Het stopzetten van experimenteren is naar mijn idee de equivalent van je kop in het zand steken en hopen dat alles maar goed blijft gaan.<br></p><p><strong>Goed, even ademhalen, en door naar mythe 2:</strong> “Klantgedrag tijdens pieken is anders, dus de resultaten van je experiment zijn waardeloos.”<br></p><p><strong>En ja</strong>, klantgedrag tijdens pieken is <strong>inderdaad</strong> anders, daar ben ik het <strong>helemaal</strong> mee eens.<br></p><p>Als voorbeeld, als je last minute inkopen aan het doen bent voor sinterklaas of kerst, dan zie je bij kopers prioriteiten verschuiven. Hoe dichter je bij de deadline komt, hoe lager prijs komt te staan, en hoe hoger voorraad &amp; vertrouwen in tijdige levering komt te staan.<br></p><p>Waar ik het echter niet mee eens ben is de conclusie dat je dan dus niets aan je experimenten hebt. Ik heb voor bedrijven gewerkt waar die enkele piekperiodes in het jaar verantwoordelijk zijn voor 60% of meer van de totale jaarlijkse omzet. Wellicht is dat bij jou hoger of lager, maar <strong>ALS</strong> je in een business zit met pieken, dan zijn dat bijna per definitie hele belangrijke momenten voor je business. Zou je dan niet <strong>JUIST</strong> moeten testen gedurende die piekperiodes?<br></p><p>Het is vele malen efficiënter om je waardepropositie en het gedrag dat klanten vertonen te optimaliseren voor <strong>tijdens</strong> drukke periodes. Doe je dat niet dan ben je dus de perfecte webshop aan het maken voor die momenten dat het rustig is op je website. Je optimaliseert je website toch ook niet voor het verkeer dat je tussen 2 en 5 uur ‘s nachts hebt? <br></p><p>Optimaliseren doe je voor je grootste groep gebruikers en daarna werk je door naar kleinere en specifieke segmenten, niet andersom.<br></p><p>Hiermee wil ik niet zeggen dat testen gedurende piekperiodes <strong>exact</strong> dezelfde aanpak heeft, je zal je onderzoek en validatie methodes moeten aanpassen aan de situatie. Je hebt meer traffic, een veel hogere of wellicht zelfs veel lagere conversie ratio en je klanten hebben zoals ik net aangaf andere prioriteiten en behoeftes. Dus ja daar moet je zeker op letten. Maar het is overall gewoonweg veel efficiënter om te optimaliseren voor je grootste groep orders. Tijdens die pieken dus.<br></p><p><strong>Ok Mythe 3: </strong>“De meeste experimenten die we doen hebben een negatief resultaat, en door te testen met veel meer volume op je site vergroot dat negatieve effect.”<br></p><p>Ok hier gaan het dus om 2 beweringen: ten eerste dat de meeste testen negatief zouden zijn en ten tweede dat je daardoor meer risico loopt.<br></p><p>Laten we beginnen met die negatieve testen: Als jij een goed optimalisatieprocess hebt en test op basis van gebruikersdata en je doet een paar 100 experimenten per jaar dan kan ik me dat bijna niet voorstellen. De enige situatie waarin heel veel experimenten negatief kunnen zijn is wanneer je continue random dingen op je website aan het veranderen bent. En dan nog is mijn ervaring dat het gros van die veranderingen überhaupt geen meetbaar effect heeft. En dat is eigenlijk nog erger, want in de meeste gevallen leer je van een negatief effect meer dan wanneer er überhaupt geen meetbaar effect is.<br></p><p><strong>Of</strong> jullie website is natuurlijk zo ultiem perfect dat er niets aan te verbeteren valt en alles wat je verandert altijd negatief zal zijn. Kan, maar meestal is dit meer ignorence of arrogantie dan werkelijkheid.<br></p><p>Sowieso moet je je optimalisatieproces zien als een lange termijn plan en dat moet je intern ook zo verkopen. Je wilt <strong>voorkomen</strong> dat je manager dit process gaat beoordelen op basis van individuele experimenten. Misschien zorgt bij jou maar 5 of 10% van de experimenten die je doet voor een significantie uplift. Niet mis mee, want het zijn uiteraard alleen die <strong>uplifts</strong> die je gaat doorvoeren waardoor je uiteindelijk je orderaantallen en omzet omhoog zal zien gaan.<br></p><p><em>En trouwens een kleine sidenote: als mensen je vertellen dat ze een succesratio hebben van hun experimenten van meer dan 25%, dan klinkt dat misschien heel stoer van die persoon, maar naar mijn idee test je dan gewoon te weinig. Dan ben je &nbsp;te conservatief in wat je test of je aantallen liggen gewoon te laag.</em><br></p><p>Goed, terug naar de mythe: het lijkt me dus sterk dat de meeste experimenten een negatief effect hebben, meestal heeft het gross gewoon geen effect.<br></p><p>Maar stel dat dat wel het geval is en meer dan de helft van jouw testen een negatief effect hebben. Dan komen we bij het tweede deel van deze stelling die zegt dat je dan meer risico loopt.<br></p><p>Als het goed is bereken je voordat je je experiment start hoeveel bezoekers je nodig hebt om een effect te kunnen meten op basis van je de effect size waar je interesse in hebt. Ofwel: je sample size. Meer traffic heb je niet nodig om je hypothese te bewijzen of te ontkrachten, daarna kan je test gewoon uitgezet worden. <br></p><p>Natuurlijk heb je veel meer traffic en wellicht wat afwijkende KPI waardes tijdens die piekperiode, maar dit is vast niet jullie eerste piek dus kwestie van even de data van de piek van vorig jaar er bij halen, op basis daarvan je sample size berekening doen en je weet wat je ongeveer kan verwachten.<br></p><p>En als je net als ik wil testen in meervouden van hele weken en bij voorkeur 4 weken, dan is het een kwestie van je experiment niet live zetten op 100% van je traffic, maar terugschalen naar het percentage dat genoeg moet zijn om de benodigde sample size van je test te behalen. Dan hou je dus een groep bezoeker over die dit experiment niet ziet en daar kun je dan weer mooi een ander experiment op loslaten. (Wat dan dus veel meer experimenten kunnen zijn wat testen tijdens pieken echt een goudmijntje kunnen maken)<br></p><p>En - ik weet dat dit voor de strikte researchers onder ons een no-go area is - maar je kan natuurlijk altijd <strong>tijdens</strong> het runnen van de test in de gaten houden of het effect niet onverwacht ver naar beneden uitslaat, dan zou je de test eventueel nog kunnen stopzetten voordat ie klaar is. We zijn een business aan het optimaliseren en geen wetenschappelijk onderzoek aan het doen dus if that’s what it takes en als je manager daar beter van slaapt, prima. Zolang je je experiment maar kan doen.<br></p><p>Dus wat ik eerder al zei: ja testen tijdens piekperiodes verwacht wellicht wat andere methodes of extra aandacht dan je normaal gewend bent, maar overall zou het risico minimaal moeten zijn en niet groter dan buiten piekperiodes.<br></p><p>------------</p><p>En nu denk je misschien: ja, maar Guido, leuk die 3 mythes en ja dat zou ik moeten doen maar ik moet eigenlijk eerst nog mijn <strong>meting verbeteren</strong>, ik moet het vertrouwen in het <strong>process</strong> nog omhoog zien te krijgen en ik wil mijn <strong>success ratio</strong> eerst omhoog zien te krijgen.<br></p><p>Jah. I know. Daar ben je niet alleen in. Dat willen we allemaal. Dat is de last die wij als CRO specialisten dragen omdat we dagelijks met die data bezig zijn en zien wat er nog allemaal beter kan.<br></p><p>Maar als je naar deze podcast luistert is dat waarschijnlijk ook iets waar je al lang mee bezig bent. En dit blijft een continue process en de enige manier om er echt beter in te worden is om het process met grote regelmaat door te lopen, te fixen wat er allemaal mis ging en het dan nog een keer doen. En zeker niet wachten tot alles perfect is opgezet. Besteed 80% van je tijd aan het runnen van die experimenten en besteed 20% aan het optimaliseren van het process. <strong>Dat</strong> is hoe jij en je team binnen de kortste keren <strong>het</strong> klanten kennis centrum zullen worden van jullie bedrijf.<br></p><p>Zo hehe, ik ben er vanaf, dank dat ik je even mocht lastigvallen en ik hoop dat ik je heb weten te overtuigen waarom testen tijdens pieken <strong>wel</strong> kan en sterker nog: dat al die extra traffic en piek in orders juist een argument is om meer experimenten te doen. En hopelijk helpt dit jou weer om het intern te verkopen…<br></p><p>Ik heb deze rant ook in het Engels in blogvorm gepost mocht je die willen doorsturen, de link daarna staat in de shownotes...<br></p><p>Dank voor het luisteren naar mijn minirant, stel ik zeer op prijs en zoals gezegd hoor ik graag op onze CRO CAFE Facebook pagine wat jullie ervan vinden en hoe jullie dit oplossen.<br></p><p>In de volgende afleveringen praat ik gelukkig weer met een gast, binnenkort in het cafe o.a.</p><ul><li>Kevin Anderson van ING </li><li>Rick Molenaar van versbezorgdienst Instant</li><li>Roderik Peeters van Drukwerkdeal.nl</li><li>Denise Visser van Bol.com<br></li></ul><p>Henk-Jan Journee van user research dienst Fibeo.<br></p><p>Tot dan en always be optimizing.</p><p><br><br></p>",
  "show_notes": "<ul><li><a href=\"https://news.vaimo.com/optimisation-myth-experiments-during-peaks\" target=\"_blank\" data-rt-link-type=\"external\">The Optimisation Myth: Running experiments during peaks</a></li><li><a href=\"https://www.gui.do/post/compute-required-sample-size-for-your-ab-tests\" target=\"_blank\" data-rt-link-type=\"external\">Compute your required sample size</a></li></ul><p>Laat weten wat je van deze aflevering vind <a href=\"https://www.facebook.com/groups/crocafe/permalink/395941494598117/\" target=\"_blank\" data-rt-link-type=\"external\">op onze Facebookgroep</a>!</p>",
  "guests": [],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/experimenteren-tijdens-pieken.jpeg",
  "language": "nl",
  "type": "podcast"
}