{
  "id": "gebruikersonderzoek-met-fibeo-met-henk-jan-journee",
  "title": "Gebruikersonderzoek met Fibéo",
  "description": "We hebben het de Fibéo tool, de plek van gebruikersonderzoek in het optimalisatie proces en verschillen tussen gebruikersgedrag in verschillende landen.",
  "date": "2025-01-09T14:26:30.811Z",
  "duration": 2379,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/36f7765c/21596a25.mp3",
  "transcript_url": "<p>Guido: Henk-Jan, welkom in het CRO Café en voordat we het over Fibeo gaan hebben en over gebruiksonderzoek in het algemeen, wat is überhaupt jouw achtergrond en hoe ben je op het idee gekomen om je eigen bedrijk te beginnen?&nbsp;<br> <br>Henk-Jan: Uh ja Fibeo ben ik begonnen in de tijd dat ik bij Moneyou zat, dus ben ik helemaal terug gegaan in mijn achtergrond, ik heb een marketing achtergrond, marketing gestudeerd en daarvoor zelfs de IVA in Driebergen en dat is een automotive school dus dan leer je auto's verkopen in de weekenden met een groot pak aan bij de Ford dealers auto's te verkopen.&nbsp;<br> <br>Guido: Dat is een heel mooi groot wit gebouw in Driebergen toch?<br> <br>Henk-Jan: Ja klopt. Ik woonde in Utrecht en ik kom uit Groningen dus in de weekenden stond ik in Groningen om auto's te verkopen en dat was een onderdeel van de opleiding. En het leuke is, daar krijg je heel erg de context mee waarin mensen auto's kopen dus een goede verkoper die stelt heel veel vragen om nou precies te weten wat de behoefte is van de klant. En dan is het eigenlijk via een verdere omweg ben ik bij Moneyou terechtgekomen en dan eindelijk in de rol Sitemanager, en het leuke van online is dat alles heel meta is maar ik kwam er vrij snel achter dat je de {} wel mist want wat je doet als je auto's verkoopt online doe je eigenlijk ook hetzelfde, namelijk mensen overtuigen en als mensen zaken niet willen dat laten ze weten door weg te klikken als ze het product niet willen kopen. Waarom is dat dan? Dan kan je met je kennis, op het gebied van VRO je kan ook psychology toepassen voor grote groepen mensen maar gebruik je wel de juiste context van de eindgebruiker hoe die een product koopt. En toen ben ik gaan kijken wat het gebruiker nodig heeft en we deden twee keer per jaar een usability onderzoek en met de data werd de website toegepast maar dat kost heel veel geld dus dat konden we niet zo vaak doen en toen zat ik op mijn stoeltje en dacht dat user testing kon er wel af en toen deden we screen recordings maar alleen met geluid dus net zoals in een podcast als je alleen de geluiden hoort, je hebt nog geen gezichten erbij, je weet niet hoe dingen gezegd worden, het geeft je een goed beeld van de werkelijkheid maar als je iemand iets ziet zeggen met een glimlach of moeilijk ziet kijken naar je website dan kan je daar veel meer uithalen en veel meer de emoties ook implementeren en kijken wat de echte blokkades zijn. Het hoeft nog niet eens te zijn hoe je het uitspreekt maar als je de respondent ziet op je algemene voorwaarden pagina ziet fronsen dan kan je denken oh dit moeten we duidelijker maken voor de volgende klant om het wat inzichtelijker te maken. En uiteindelijk leidt dat naar een basic input voor AB testen en daarmee een hoge conversie.&nbsp;<br> <br>Guido: Ja ik kan me voorstellen want online hebben we natuurlijk een enorme bias naar kwantitatieve data inderdaad, en iedereen heeft Google Analytics en dan zien we het grote plaatje maar we zien niet waarom het gebeurt en dan in de auto showroom is het een beetje het omgekeerde. Daar heb je dat een op een contact maar dan heb je dat overal beeld weer niet. Maar goed je zat bij Moneyou en die frustratie was zo groot of je zag gewoon een gat in de markt dus je dacht \"ik ga het gewoon zelf doen.\"&nbsp;<br> Henk-Jan: Ja dat laatste was het geval, ik herkende dat ik dat goed kon toepassen, ik heb de online team van gezegd van hey ik wil eigenlijk een tool hiervoor ontwikkelen en daarbij gaan we de respondent filmen. Dus gingen we respondenten uitnodigen en we hebben meteen een programmeur gevonden en ook meteen een maat onderzoeker en ook om heel erg de boel op stand te houden, dus goede vragen stellen, suggestieve vragen over wat de logica is.. niet te veel opdrachten meegeven, dus dat soort vragen, en dan beetje bij beetje is Fibeo ontstaan en dat ontwikkelde ik naast de Moneyou shop. En op een gegeven moment heb ik meegedaan met storage {} van marketing. En mocht ik daar Fibeo pitchen. En die won ik gek genoeg, had ik echt niet zien aankomen en toen begon het te stromen en zo is het eigenlijk gaan rollen en op een gegeven moment Moneyou opgezegd en dat was denk ik vier jaar geleden. En dan stapje voor stapje aan het uitbouw.&nbsp;<br> <br>Guido: Wat voor type klanten komen nu naar jullie, wat is jullie ideale klantprofiel, wat voor volwassenheid hebben die klanten?&nbsp;<br> <br>Henk-Jan: Vanaf het begin hadden we heel veel kopers, we merken nu wel dat we steeds meer aanvraag krijgen van kleinere bedrijven wat heel leuk is en die bijvoorbeeld alleen de video's afnemen en dan zelf de video's gaan analyseren om de data korter te maken. En eigenlijk zijn we geschikt voor iedereen met een website. We verrijken ze met de video's, we verrijken met expert rapporten maar dat is dan optioneel. Als je puur voor de video's pakt voor, we hebben onlangs voor {} onderzoek gedaan en dat was super waardevol ook weer voor hun om die inzichten te hebben van de eind data. En dat is ook het ding, zelfs als je heel weinig data hebt dus B2B klanten, dan ook heb je juist extra data bij het snappen van de juiste context beleving van je klant.&nbsp;  <br>Guido: Nee je hebt video's, expert review, wat voor producten leveren jullie nu allemaal?&nbsp;<br> <br>Henk-Jan: In de basis videos, feedback videos, we leveren in ons best {} verschillende beeldhoeken dus alleen van de respondent met website ernaast, alleen de website met geluid, ons laatste beeld is, we maken de website transparent, en dan spiegelen we de respondent, dus kijk je eigenlijk door je website heen hoe de eindgebruiker er 1 op 1 naar kijkt.&nbsp;<br> <br>Guido: Oh ja ik zie het voor me.&nbsp;<br> <br>Henk-Jan: Alsof de eindgebruiker achter je scherm zit en omdat ie gespiegeld is zie je hem ook naar knopen kijken, je ziet zijn reactie bij stukken tekst, dus dat is het video gedeelte en die videos kunnen we alleen leveren of met annotaties dus dan zijn ze volledig getranscript, helemaal uitgeschreven of met dat onze maten onderzoeker meeschrijft en dan heb je een in-depth rapport op basis van hoeveel analyse je wilt.&nbsp;<br> <br>Guido: Jullie komen dus met een soort van samenvatting van \"dit zijn alle verbeter punten waar jullie naar moeten kijken.\"&nbsp;<br> <br>Henk-Jan: Ja, een volledig rapport en we zijn ook sinds kort begonnen met workshops en dat is heel interessant, zeker in combinatie met video. Als je de bouwer meeneemt naar een sessie dan ziet ie ook de videos en dan is het voor een website bouwer ook ineens veel relevanter want dan ziet ie \"oh dat daar dat kan niet want het is te veel gedoe.\" Maar als je vervolgens een eindgebruiker zie struggelen op een pagina en die komt er echt niet uit met die goed bedoelde filters. Dan heb je veel meer draagvlak om het daadwerkelijk aan te gaan pakken.&nbsp;<br> <br>Guido: En oke hoe werkt dat nou? Dus ik neem een dienst af bij jullie, ik wil die videos.. maken jullie de design van de test ook? Het script voor de vragen? Krijgt iemand een opdracht?<br> <br>Henk-Jan: Ja we hebben onze software en een script dus met kleine stapjes zie je het doorgroeien. Dus onze software heeft heel veel geautomatiseerd, alleen over de briefing moeten we even schakelen vanuit een standard template welke de klant in kan voeren. En die wordt dan bij ons aangeleverd en dan programmeren wij het uit in de tool en nodigen de respondenten uit, en daar heb je twee smaken in dus of uit onze eigen panel of uit een panel bureau, dan kan je ook makkelijker in andere landed dezelfde test opscherpen. Wanneer een bedrij die template invoert maar hij wil dat gedoe niet, hij wilt zeker weten dat er goede vragen en opdrachten opgesteld worden, dan komt onze onderzoeker langs om helemaal die template in te gaan vullen en dan kijken we precies naar de doelgroep die we moeten gaan inhuren, welke opdracht, dat het niet te lang of te kort is, hoeveel minuten is een volledige stream, opname, of er confrontaties komen van de respondent. Vervolgens krijgen we de videos aangeleverd.&nbsp;<br> <br>Guido: En je noemde net meerdere landen, in hoeveel landen zijn jullie beschikbaar? In hoeveel talen?<br> <br>Henk-Jan: In het Duits, Engels, Nederlands, Frans en Italiaans. En het is multi-language gebaar dus vanuit daar kunnen we ook meerdere landen aanhaken. Dat buitenlands maakt het ook wel leuk, we hebben een keer onderzoek gedaan in Oostenrijk en dan zie je echt Oostenrijkers zitten achter de camera en omdat we een voet in een land hebben gezet...<br> <br>Guido: Precies, want voor de duidelijkheid, jullie hebben een locatie, of de mensen zitten thuis, maar ze zitten echt in dat land.&nbsp;<br> <br>Henk-Jan: Ja via de bureau worden die mensen in een huiskamer gezet, zo doen we de tests in het huis van die persoon achter hun eigen laptop voor de onderzoek. Ik denk dat dat voor de context belangrijk is als je tegen usability aan loopt dat ze in hun eigen omgeving zijn.&nbsp;<br> <br>Guido: Ze voelen zich misschien ook minder bekeken.<br> <br>Henk-Jan: We komen dichterbij resultaten dan in een lab, het is gewoon wat eerlijker.&nbsp;<br> <br>Guido: Werkt het dan alleen maar op desktop of ook via mobiele websites of apps?&nbsp;<br> <br>Henk-Jan: We kunnen sinds het begin van dit jaar ook op mobiele websites en apps testen. Dat is een product wat we nu alleen in combinatie met een report kunnen leveren. Er zit dan iets meer handwerk aan om videos in het juiste format te krijgen. Dat is heel eenvoudig om via de desktop tool. Je krijgt ook via de desktop opdrachten te zien, en als diegene ook de app downloadt kan ik die ook meenemen in de onderzoek. Heel veel bedrijven focussen op mobiel alleen bij het bouwen van mobiele paginas, kijken we vaak naar toont ie goed, werkt ie goed, maar toch de customer journey en hele flow, dat blijft wel liggen en dat is wat we in het begin van dit jaar gehaald hebben. Dat is vaak veel te langzaam en de stappen die op de desktop heel logisch zijn op mobiel veel korter kunnen. Op mobiel&nbsp; krijg je ook andere informatie dan op je desktop.&nbsp;<br> <br>Guido: En hoe werkt dat dan als je dat in meerdere landed gaat doen? Ik kom met een briefing aan, nou mijn italiaans is non-existing dus ik kom met een brief in het Engels of het Nederlands, kunnen jullie dat dan vertalen en de transcript is dat dan ook in het Engels of Italiaans of hoe werkt dat?&nbsp;<br> <br>Henk-Jan: Ja wij werken met partners in die landen. Dus de maten onderzoeker zorgt dat de briefing in het Engels komt en vanuit het Engels wordt het doorvertaald naar het Italiaans, ook voor annotaties, hebben we een transcript, de onderzoekers die Italiaans kunnen gaan het dan uittypen in het Engels zodat we wel alles samen kunnen voegen in een Engelse rapport. En ook de interpretaties, hoe een Italiaan iets zegt moet je ook door een Italiaan laten doen want anders gaan we meteen denken dat een Italiaan boos is vanwege hun enthusiasm.&nbsp;<br> <br>Guido: Zie je al dat soort cultuurverschillen tussen jullie respondenten? Zien jullie dat naar boven komen?&nbsp;<br> <br>Henk-Jan: Ja dat zien we al bij onze eigen landen grens. Met namen met verzekeraars en met banken, als een Nederlander een rekening ziet, leest ie de helft, klikt op grote knoppen en die komt zo bij een aankoop. En een Duitser die zet een headset op, microfoon erbij als ie aan de onderzoek begint, en die gaat dan rustig zitten en gaat alle algemene voorwaarden lezen en die schreeuwen ook explicieten als output. En dat is echt cultuur verschil, waarin Nederlands vinden alles gewoon prima en hoe kom ik zo snel mogelijk hier doorheen want ik wil dit maar daar ligt het anders.&nbsp;<br> <br>Guido: Ja ik heb volgens mij hier ook een keer verteld, had ik een onderzoek gedaan Duitsers op mobiel inderdaad wat op een gegeven moment, dat was gewoon zes mensen op een dag interview en op een gegeven moment zaten ze naar elkaar te kijken van 'gaat er wat mis? wat is er aan de hand?' Ze gingen gewoon vijf minuten lang door de algemene voorwaarden scrollen, dat zie je nergens.&nbsp;<br> <br>Henk-Jan: Ja en dat doen ze niet voor t onderzoek, dan doen ze ook in het echt. Duitsers zijn veel voorzichtiger, ze betalen ook veel meer met contant en ook data protection. Dus dat is echt een groot verschil. En ik heb het idee dat door de tijd heen veel meer naar elkaar toe gaan groeien.&nbsp;<br> <br>Guido: Ja ongetwijfeld, maar dat zijn inderdaad belangrijke dingen als je inderdaad een markt op gaat van je kan wel je standaard website en je standaard service plakken, knippen, en naar het Duits vertalen maar dan ben je er waarschijnlijk nog niet.&nbsp;<br> <br>Henk-Jan: Nee absoluut niet.&nbsp;<br> <br>Guido: Daarom zijn jullie services super handig om daar een beetje inzicht in te krijgen.&nbsp;<br> <br>Henk-Jan: Ja en er wordt gevraagd voor specifieke gevallen, we hebben hetzelfde product, proberen nu te verkopen in Duitsland, maar dan converteert helemaal niet, kunnen jullie eens onderzoek doen want wij hebben geen idee. En dan komt er een interessant zak uit.&nbsp;<br> <br>Guido: Wat is vaak de use case? Dus je zegt we gaan naar het buitenland, wat zijn een paar use cases die jullie klanten vaak hebben voor het gebruik van jullie product.&nbsp;<br> <br>Henk-Jan: Het is best wel divers, we kunnen ook in veel fases werken, dus als je een idee hebt om het een beetje zichtbaarder te maken dan kunnen we het al testen en het voorbeeld daarvan is met de NS, daar hadden we een flow uitgebouwd en hun website bouwen hadden we ook flow eruit gehaald voor vision. En dan kijken van wat werkt nou beter, dat hebben we voorgelegd aan een groep van respondenten. Die ene krijgt A en dan B en ook andersom. En uit de videos van NS bleek de B het beste te werken en dat is eigenlijk een soort kwalitatieve AB test, voor Nyenrode hebben circulatie test gemaakt voor live gaan. Dus we sluiten de website aan bij studenten en bij andere mensen die nog een avond opleiding willen, dan heb verschillende doelgroepen voor wil je de zelfde website gebruiken moet je communicatie omgaan. Want je kan het op papier bedenken maar uiteindelijk met de videos dan zie je echt daadwerkelijk dat iemand die wat ouder is nog langer zit te wachten dan de jongeren.&nbsp;<br> <br>Guido: Dat vind ik wel interessant wat je net zegt. Je kan dus de verschillend doelgroepen bekijken hoe ver kun je daar in gaan bij jullie? Hoe ver heb ik invloed die je op de andere kant zetten?&nbsp;<br> <br>Henk-Jan; Uit onze eigen panel, dat is wel beperkend, dus met een panel bureau werken heb ik een heel gesegmenteerd, ik heb een keer voor BMW onderzoek gedaan met private lease rijders die 7000 kilometer per jaar moesten rijden met de groep. Dat zijn kritische groepen die heel lastig voor usability zijn. Via een panel bureau kunnen we dat lastig voor de camera gaan krijgen.&nbsp;<br> <br>Guido: Elke auto, zeker BMW, staat connected tegenwoordig, je hebt een groot scherm dus ja, doe het gewoon in de auto.&nbsp;<br> <br>Henk-Jan: Klinkt zo veilig.&nbsp;<br> <br>Guido: Wel als ze stil staan natuurlijk, bij elk verkeerslicht krijg je een nieuwe vraag. Worden jullie vaak gebruikt als input voor AB testen of zo? Zie je dat veel gebeuren?&nbsp;<br> <br>Henk-Jan: Ja, we hebben ook zelf een CRO expert dus we kunnen meedenken over de volgende stap. Maar het grappige is, als je langer dan binnen twee weken een bedrijf werkt, word je bedrijfs blind, al je producten die je uit je hoofd geleerd hebt die zijn voor jou heel logisch maar iemand die daar nooit van gehoord heeft weet echt niet wat {} is of wat je product dan ook is. Dus die kijkt via een compleet andere bril, andere context naar je website. Dat zijn altijd leuke onderzoeken. Dat levert dan hele concrete hypothese op ook met AB testen. En de hypothese die je zelf, maakt niet uit hoeveel jaren je ook in het vak zit met die bril op, kan je de hypothese ook niet bedenken, dus dan heb je dit soort input echt nodig. Dan neem je de context mee in je optimalisatie.&nbsp;<br> <br>Guido: En waar valt je tool in dat CRO spectrum? Wat vind jij zelf de sweet spot? Wanneer moeten mensen jullie gaan gebruiken?&nbsp;<br> <br>Henk-Jan: Iedereen met een website kan ons gebruiken, dus als je heel weinig verkeer hebt, dat is heel interessant van worden mijn bijwerken van de 50 bezoekers per maand, hoe worden ze gezien?&nbsp;<br> <br>Guido: Ja, zelfs een concept fase toch? Je hoeft niet eens een website te hebben. Als je maar een design hebt dat je kan laten zien waarop mensen kunnen reageren, als het maar visueel is.&nbsp;<br> <br>Henk-Jan: Nee dat klopt want concept testing doen we ook wel. En dat hoef niet eens een website te zijn. We focussen ons op met onze onderzoek op wat grotere bedrijven maar eigenlijk iedereen met een website kan het interessant zijn omdat je hebt heel veel tools, soms zeggen mensen 'oh we hebben al Hotjar' maar Hotjar laat je niet de context zien. Dus dat is ook een grote verschil.&nbsp;<br> <br>Guido: Mijn ervaring met Hotjar is dat het verzameld bakken met data en je moet alsnog een beetje erdoorheen zien te graven.<br> <br>Henk-Jan: En je weet dan niet naar wie je kijkt want misschien is het een concurrent die op je site kwam kijken of iemand die niet in je doelgroep valt en dat is best zonde van je tijd als je dat gaat analyseren.&nbsp;<br> <br>Guido: Ik heb ook heel veel waardevolle dingen uit Hotjar gehaald maar het kan best wel bewerkelijk zijn.&nbsp;<br> <br>Henk-Jan: Ja ik vind het een fantastisch tool hoor en we hebben ook klanten die Hotjar draaien of bepaalde tools. Maar met die doelgroep dan stel je de werkelijkheid alsnog wel na, en dat zie je dan in Hotjar, zie je mensen die heel lang stil blijven staan.<br> <br>Guido: Ja mijn standpunt is ook dat je een range van dat soort tools moet hebben, van kwalitatief naar kwantitatief dat je echt kan zien want als ik onderzoek doe bij jullie, dan zijn er ook maar een paar mensen, ik weet niet hoeveel mensen een onderzoek bij jullie is.&nbsp;<br> <br>Henk-Jan: Meestal 20.&nbsp;<br> <br>Guido: Misschien heb ik wel duizenden mensen op mijn website, mijn vraag is dan nooit kijk ik naar Google Analytics of kijk ik naar Hotjar of gebruikersonderzoek, nee je moet het allemaal doen want dan krijg je een goed beeld dan weet je of de 20 mensen representatief voor de hele groep en vallen ze daar inderdaad af, dat wil je weten.&nbsp;<br> <br>Henk-Jan: Als je ziet in je analytics, hier gebeurt iets, kan bedenken oh hier is de pagina niet goed, en wat we heel vaak zien is dat zelfs 4 pagina's daarvoor gewijzigd zijn en dan denk je gewoon laat maar. We zijn te vaak bezig met de pagina's optimaliseren terwijl je pijn veel dieper zit, en dat moet je eerst begrijpen voordat je veel tijd besteed aan een AB test.&nbsp;<br> <br>Guido: Ja de ene pagina was net die druppel die de emmer liet overlopen.&nbsp;<br> <br>Henk-Jan: Voor ABN hebben ook een test, dat doen we in stapjes, dus eerst voorleggen aan de groep gebruikers met nieuw versus oud. En dan voorzichtig een overview maken want grotere bedrijven hebben groot bereik dus je wilt niet in een keer de wereld in helpen, als je zeker weet dat het goed overkomt bij publiek dat je dan pas overgaat. Bij {} hadden we ook een onderzoek gedaan en dat vond ik een hele interessante, dat was schade meld tool, dat je zou denken oh dat werkt goed en dat ziet er goed uit en dat was ook de mening rest, maar ondertussen waren er ook details, kleine dingen die in de beleving bij elkaar een beetje ophield. En dat kan ook zijn met het invoeren van een geboortedatum, maar dat werkt nog niet zoals je wilt. Als iets kleins effectief is kan dat de hele beleving veel beter maken.&nbsp;<br> <br>Guido: Ja mijn ervaring met dit soort onderzoek is dat je hele kleine dingetjes binnenhaalt, per tweak denk je, is dit het waard om het doen? Maar het zijn er misschien wel vijftig.&nbsp;<br> <br>Henk-Jan: Bij elkaar maakt dat wel de totale ervaring. De leuke van de onderzoek is ook, we krijgen vaak na een presentatie, kan je die video na sturen of waar kan ik die vinden? Of kan je die nog even naar de project manager sturen of naar de programmeur? Dat is het leuke aan video, je hebt gewoon vastgelegd wat de interactie is op die pagina. En dat is ook de context met het {} dan zegt het meer dan een survey met duizend man.&nbsp;<br> <br>Guido: Ja ik heb het ook wel een paar keer gehad met een onderzoek die ik heb gedaan en dan kom je in een discussie en denk je oke wacht even, ik ga een video voor je pakken en dan zie je hoe gefrustreerd mensen zijn, en als je echt een gebruiker ziet worstelen met hun kindje zeg maar.&nbsp;<br> <br>Henk-Jan: Ja daar moet je ook voorzichtig mee zijn, want 1 respondent is ook niet de hele context.&nbsp;<br> <br>Guido: Ik heb ook wel vaker van de compilatie videos gemaakt, op zo een dag, was het een interview van 50 minuten en dan verschillenden onderdelen, verschillende cases daar in. Als je een compilatie video maakt per onderdeel dat je dat in vijf minuten vijf of zes mensen ziet worstelen met de checkout. Dat werkt dan heel goed om je punt te laten zien van \"we zijn niet de enige.\"&nbsp;<br> <br>Henk-Jan: Grappig wat je zegt, want mensen zullen altijd worstelen maar als het een site die heel goed beoordeeld is, wij gaan niet aan de slag met waarom het een 8 is maar juist hoe het een negen kan worden. Als je niet uitkijkt, heb je ook respondenten met details, dat kan ook incidenten zijn, dan kan je denken oh we hebben behoorlijk veel werk te doen maar we hebben overal beleving, die is heel goed. Maar als je niet uitkijkt ga je alleen naar de negatieve kijken.&nbsp;<br> <br>Guido: Ik maak het ook weleens mee dat mensen minuten lang of tien tellen minuten lang zitten te worstelen met iets. En dan vraag je wat ze ervan vonden en zeggen ze \"ja ik vond het wel prima, ik vond het wel goed gaan.\" Terwijl jij denkt als onderzoeker, dat had je in een paar minuten moeten kunnen, en je hebt er tien over gedaan, dat ging helemaal niet goed.&nbsp;<br> <br>Henk-Jan: Ik heb ook weleens een keer gehad dat respondenten het goed deden maar&nbsp; echt heel boos worden zeggen ze 'ik heb alles ingevuld en nu is alles weg.'&nbsp;<br> <br>Guido: Ja andersom kan ook natuurlijk, soms zit er een verschil tussen de beleving van de consument en wat jij denkt dat de beleving had moeten zijn. En daar is onderzoek super waardevol voor, dat haal je niet uit Google Analytics.&nbsp;<br> <br>Henk-Jan: En je moet de confrontatie aan durfen te gaan als je iets niet weet.&nbsp;<br> Guido: Dat mag je dan als onderzoeker bepalen als je je bedrijf in brengt of niet. Wat jij denkt binnen de politieke structuur van jouw bedrijf. Als ik nou interesse hier in heb, hoe zien de pakketen bij jullie eruit? Of structuur, is er een bepaalde minimaal afnames of zijn dat abonnementen of how werkt dat?&nbsp;<br> <br>Henk-Jan: We willen graag veranderen in abonnementen maar dat hebben we nog steeds niet gedaan want we doen het eigenlijk nu per onderzoek en we beginnen met 10 videos op desktop of mobiel en dan kan je een analyse pakket van 12 of 28 uur erbij kopen. Het bouwt in stapjes door en voor grote bedrijven werken we met een optimalisatie budget en dan spreken we van tevoren een budget af en daar krijgen ze korting op. En dat maakt het ook voor ons makkelijker door de tijd heen want als je denkt 'oh ik wil toch nog even de user test doen' en alles heeft invloed op elkaar, dus als je denkt dat je een user test wilt doen gaan we dat optimaliseren maar vaak komen er nieuwe vraagstukken uit.&nbsp;<br> <br>Guido: Het CRO proces is een cyclus mensen. Het blijft maar doorgaan.&nbsp;<br> <br>Henk-Jan: Precies, dus geen project maar een proces.&nbsp;<br> <br>Guido: Ik begrijp dat jullie ook met jullie eigen website bezig zijn dus ik neem aan dat jullie daar ook feedback aan het verzamelen voor bent, toch?&nbsp;<br> <br>Henk-Jan: Ja, sowieso altijd in de presentaties, wordt er gevraagd 'hoe ging het bij jullie website? Of 'vond je het ook zo moeilijk?' Het is een vage antwoord altijd, maar gelukkig komt onze nieuwe website aan, dat is best wel een proces om dat naast onze werkzaamheden te doen en uitleggen. Maar voor de user tests gaan we een pagina maken, fibeo.com/cro. Waarbij iedereen kan kijken, klanten maar bijvoorbeeld ook luisteraars van de podcast om zich aan te melden om ook een review te geven over onze nieuwe website. En dat mag heerlijk ongezouten zijn want daar kunnen we van leren.&nbsp;<br> <br>Guido: Daar zijn onze luisteraars heel goed in volgens mij, ongezouten meningen geven. Zet het maar op facebook in de comment van deze podcast. Andere dingetje, CRO awards worden dit jaar voor de derde keer georganiseerd, ik begreep dat het bij jullie gaat zijn.&nbsp;<br> <br>Henk-Jan: Ja dat heb ik ook begrepen, wij zitten in een kantoor-verzamel gebouw, een co-working space die ik heb opgezet twee jaar geleden. En zo doen kwamen de CRO awards voorbij voor sponsoring van Fibeo en toen zei \"nou, ook qua ruimte kunnen we mogelijk iets betekenen\" en vandaar dat het dit jaar bij ons word gegeven.&nbsp;<br> <br>Guido: Niet iedereen zal weten waar jullie kantoor is, waar is dat?&nbsp;<br> <br>Henk-Jan: In Amsterdam Noord, en het kantoor heet De Vrijstaat, en het zit tussen de Kromhouthal en Pand Noord in, dichtbij de Jumbo.<br> <br>Guido: Altijd belangrijk voor je boodschappen. Volgens mij is de website van de CRO awards dat is dutchcroawards.nl, gaan we ook in de shownotes even melden. Als je nu naar website gaat kan je volgens mij al cases inzenden voor die award show en dat zal plaats vinden op 3 oktober en als het goed is, zijn we daar vanuit het CRO café ook aanwezig om een live uitzending te doen met hopelijk wat winnaars, wat jury leden, misschien wat genomineerden.&nbsp;<br> <br>Henk-Jan: Daarvoor gaan we een extra mooi plekje voor jullie inrichten.<br> <br>Guido: Ja dat lijkt me super goed, neem ik mijn microfoon mee, zorgen jullie voor de rest. En volgens mij als ik naar de sprekerslijst kijk komen er sowieso Manuel da Costa langs, de oprichter van Effective Experiments, en Vanja komt langs, die zat bij Transavia en dit zit nu bij AkzoNobel en we kennen hem ook van de Shopping Tomorrow group, daar zat ie ook in, dus dat is wel iets om naar uit te kijken volgens mij. Hey Henk-Jan, dankjewel, super leuk om te horen.&nbsp;<br> <br>Henk-Jan: Ja te gek, fijn om een keer bij jou in het café te mogen zitten.&nbsp;<br> <br>Guido: Ja en mocht je dus klant cases hebben en die klanten willen erover spreken, stuur ze lekker door.&nbsp;<br> <br>Henk-Jan: Ja die zal ik zeker doorsturen.&nbsp;<br> <br>Guido: En dan zien we elkaar op 3 oktober in ieder geval.&nbsp;<br> <br>Henk-Jan: Ja zeker weten, en ik heb een mooie ruimte voor je al in gedachten dus dat komt helemaal goed.&nbsp;<br> <br>Guido: Cool, zien we je dan. Doei.&nbsp;<br> <br>Henk-Jan: Yes, tot dan, doei.&nbsp;</p><p>‍</p>",
  "show_notes": "<ul><li><a href=\"https://nl.linkedin.com/in/henkjanjournee\" target=\"_blank\">Henk-Jan op LinkedIn</a></li><li><a href=\"https://twitter.com/henkjanjournee?lang=en\" target=\"_blank\">Henk-Jan op Twitter</a></li><li><a href=\"https://fibeo.com/\" target=\"_blank\">Fibéo</a></li><li><a href=\"https://dutchcroawards.nl/\">CRO Awards</a></li><li><a href=\"https://fibeo.com/cro/\" target=\"_blank\">Leer Fibeo kennen door feedback te geven op hun nieuwe website</a></li></ul>",
  "guests": [
    {
      "id": "henk-jan-journee",
      "name": "henk-jan-journee",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "nl",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/gebruikersonderzoek-met-fibeo.jpeg",
  "language": "nl",
  "type": "podcast"
}