{
  "id": "growth-marketing-bij-vanmoof",
  "title": "Growth marketing bij VanMoof",
  "description": "Binnen VanMoof is Simon momenteel verantwoordelijk voor SEO, CRO en web analytics en praten we er over hoe hij dat inzet voor deze snel groeiende start-up.\n",
  "date": "2025-01-08T20:07:07.531Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/d0b04826/52d8bb00.mp3",
  "transcript_url": "<p>Guido: Welkom bij het CRO café en ja voordat we het gaan hebben over je huidige werk bij VanMoof, hoe ben uberhaupt ooit CRO ingerold?&nbsp;<br> <br>Simon: Thanks voor de uitnodiging, een paar jaar geleden ben ik begonnen bij Van der Valk eigenlijk en daar ben ik echt een beetje in de online marketing wereld gestapt. En daar begon ik met SCO, analytics en ook CRO. We werkten toen al samen met Online Dialogue en eigenlijk met hun afgekeken hoe je goed moet AB testen en hoe je goed onderzoek moet doen. Dus drie jaar bij Van der Valk gezeten en toen ben ik overgestapt naar {} en daar eigenlijk hetzelfde gedaan maar met meer focus op CRO en analytics omdat ze al in-house SCO-ers hadden. En daar heel veel testen gedaan, helemaal geen limieten qua traffic als het waren. Dus ze hadden meer limieten in 'kunnen we zo snel mogelijk meer testen bouwen.' Dus daar heel veel testen gedaan op grote schaal en mijn kleine tussenstap bij fietsenwinkel.nl bij VanMoof terecht gekomen. En hier eigenlijk verantwoordlijk voor van alles en nog wat op dit moment. SCO tot CRO tot analytics tot zelfs nog de email marketing omdat er eigenlijk tot anderhalf jaar geleden helemaal niks was qua performance marketing, growth marketing, dat soort CRO. En eigenlijk heb ik afgelopen anderhalf jaar, zijn we dat gaan opzetten met een klein team, we zijn begonnen met z'n tweeën, we zijn nu met zijn vieren en heel veel shit gefixt van afruimen en nu langzaam staan we op het punt dat we toffe gingen gaan doen.&nbsp;<br> <br>Guido: Ja het klinkt glorieus CRO, maar het is ook heel veel shit fiksen ondertussen voordat je aan de slag kan. Maar ik me vooral ook herinneren, wij kennen elkaar al een tijdje en ook bij Valk en bij The Next Web, dat er heel veel altijd gedeeld werd van dat werk dat jij deed, was dat altijd heel bewust iets of gebeurde dat gewoon? Dat er heel veel, dus publiek experimenten werden gedeeld of zoals bij The Next Web dat jullie eigen GTM methoden hadden om te testen en dat ook op GitHub deelde zeg maar?&nbsp;<br> <br>Simon: Ik denk zeker in het geval van een {} samen met Martijn dat het heel veel blogt, daar zat een gedachte achter maar het was ook eigenlijk dat we het gewoon heel leuk vonden om het te delen, en een bewuste keuze om dat te delen was dat er ook veel meer voor terug kregen en mensen kwamen met feedback, met emails van 'als je nou zus of zo doet' en zeker ook bij The Next Web, we waren met een paar man en we hadden eigenlijk geen flauw idee wat we aan het doen waren dus het was een hele leuke reflectie op die manier van 'zijn we eigenlijk wel goed op weg?' Daardoor werden we ook uitgenodigd om een koffie te drinken met deze of gene waardoor we ook heel veel konden leren.&nbsp;<br> <br>Guido: Het klinkt natuurlijk eng om een beetje je kennis te grabbel te gooien zeg maar, maar je krijgt er ook heel veel voor terug en zelfde als met op een podium staan of bloggen of podcasts. Je krijgt er weer feedback van van 'yo ik heb dit gehoord of gelezen, heb je hier ook aan gedacht?'&nbsp;<br> <br>Simon: Ja zeker CRO natuurlijk, een test kan bij de één werken en bij de ander niet dus daardoor hadden we helemaal zoiets van 'we delen het lekker' en wij vonden dan vooral leuker om te delen dan alleen consultants doen die houden het een beetje net iets te mooi zeg maar. Wij vinden het gewoon fijn als in house partij alles te delen en we wilden daarna een hele sheet geven met rauwe data wat we hadden. Soort van 'doe er maar mee wat je wilt, maakt ons niet zo heel veel uit.\"&nbsp;<br> <br>Guido: En ja nu anderhalf jaar bij VanMoof, we hebben ook onlangs een aflevering gedaan wat momenteel de populairste aflevering is. Dat was met allemaal taal van Riksja Travel die is ooit daar begonnen, en dat ging inderdaad over 'waar begin je eigenlijk als CRO of in een nieuwe organisatie of in een nieuwe rol.' Hoe heb jij dat aangepakt? Waar ben je begonnen?&nbsp;<br> <br>Simon: Hier bij VanMoof, er zat al een serieus marketing team, meer vanuit een branding en creatief team dus PR, designers, copyrighters, producers die verantwoordlijk zijn voor de mooie videos en fotografie maken. Maar er was eigenlijk helemaal niemand intern die bezig was met performance marketing, growth marketing, of zelfs specifiek CRO. Dus dat team is allemaal gekomen een jaar geleden en was ik met een collega en je komt binnen en je weet in ieder geval wel dat je moet oppassen met gelijk heel veel data de wereld in sturen van 'ik zie dit en dat en je moet zus en zo doen.' Omdat het maakt een team wat meer mening heeft zeg maar. Dus ik ben eigenlijk gewoon begonnen met in Google Analytics kijken met klopt die data wel? Oh die data klopt niet, laten we het gaan fixen. Laten we een simpel scannetje doen over met SCO, zijn er wat dingen die fout zijn met die pagina's, ja die zijn er dus ga ik tickets voor maken en zorgen dat een developer die zo snel mogelijk oppakt. En eigenlijk gewoon heel pragmatisch beginnen tot zelfs laat ik eens een keer een fiets gaan kopen, tegen wat voor problemen loop ik eigenlijk aan. Dus daar ook een screen recording van gemaakt, screenshots continu gemaakt en dan merkte je gewoon van 'hey dit gaat eigenlijk best wel raar, laten we dit aanpassen' niet perse gelijk uitgeven maar gewoon heel pragmatisch 'kan ik uberhaupt een fiets kopen?' Nou dat was best lastig. Dus dat gingen we gewoon oplossen en nu komen we langzaam op een punt van nu hebben we een stevige fundament staan, een website die daadwerkelijk werkt, nu kunnen we verder gaan optimaliseren, niet meer vanuit de perspectives die we allemaal kennen maar gewoon data gedreven en hypotheses gaan testen.&nbsp;<br> <br>Guido: Ik had dat laatst ook bij een klant en voor mij was het een nieuwe partij en inderdaad even gewoon zelf door de funnel gegaan en ik kon gewoon niet bestellen omdat ik ergens, ze hadden een soort logic ingebouwd als je een bepaald veld niet invulde, dan was de bestelknoop er niet, je moest alle velden invullen dan pas verscheen de bestelknoop. Maar ik had dat veld niet ingevuld en ik zat op mobiel, dus dat veld dat ik moest invullen dat was ik al voorbij gescrold dus ik zat op de bestel pagina en ik dacht 'ik heb geen flauw idee' en omdat ik dat veld niet zag en bij dat veld stond de foutmelding, niet onderaan de pagina. Ik zeg naja het zal wel niet kloppen maar het kan dat ik een uitzondering ben maar het lukt mij niet om uberhaupt wat te bestellen.&nbsp;<br> <br>Simon: Nee en dan het heel raar vinden dat er zo een lage conversie rate op mobiel is.&nbsp;<br> <br>Guido: Ja, inderdaad. Hey en je had het net over wat gebruik onderzoek doen. Doe je dat nog steeds? Hoe pakken jullie dat aan?&nbsp;<br> <br>Simon: Ons kantoor zit boven de winkel, dus we kunnen gewoon de winkel in lopen en gewoon daadwerkelijk aan klanten vragen die beneden staan te wachten op een reparatie of wat dan ook, die duren toch wel vaak een paar minuten. En we hebben ook recentelijk wel user testing gedaan met onze platform voor gebruikers. Dus als mensen eenmaal een fiets hebben dan hebben ze een \"Mijn VanMoof\" omgeving. Nieuwe design dus laten we zorgen dat we echt een user test gaan doen dus hebben we gewoon klanten gevraagd van 'wie wilt er keer langs komen en een user test doen?' En daar hadden we geloof ik iets van 150 aanmeldingen en we hebben een tiental geselecteerd die zijn weleens langsgekomen om de users test te doen. We hebben super veel super interessante feedback van verzameld. Niet alleen maar over design en product maar ook over alles, ook klachten over de fiets of noem het allemaal maar op. En de laatste wat we het meest recentelijk in testen deden is we hadden heel veel investeerders bij ons over de vloer en die kregen ook de mogelijkheid om gelijk een fiets te kopen tegen een leukere prijs en die moeten ze wel gelijk via de website aanschaffen in plaats van onze POS systeem. En toen kwamen erachter dat als heel veel mensen een limiet hebben op hun credit card. En het zijn natuurlijk niet de goedkoopste fietsen, die zijn tussen de 2300 en 2400 euro. En toen kwamen we erachter dat heel veel mensen een limiet van 2000 euro hebben op hun creditcard. Dus stonden ze daar in de winkel, wilden graag een fiets kopen maar kon niet. Ze hadden ook niet zo een identifier of zo een ding van de bank bij hun om met iDeal te betalen. Dus toen hebben we een aantal mensen helaas naar huis moeten sturen en zeggen van 'probeer het thuis nog een keer.' En dan realiseer je je wel dat als dit in de winkel gebeurt, hoe vaak gebeurt het dan bij mensen thuis? Dat ze een fiets willen kopen en dan tegen deze problemen aanlopen? Zijn mensen dan echt bereid om snel die limiet te verhogen of die iDeal identifier op zoek te gaan? Of kopen ze uiteindelijk niets? Dus dat was voor mij persoonlijk een hele leuke insight door een klanten dag eigenlijk houden. En nu zitten na te denken van ja misschien moeten we gespreid betalen mogelijkheid inbouwen. Dat ze het kunnen verspreiden over zes maanden of zo.&nbsp;<br> <br>Guido: En allemaal van die identifiers in de winkels leggen.&nbsp;<br> <br>Simon: Ja bijvoorbeeld, zorgen dat we al die dingetjes in de winkel hebben. Ja dat was eigenlijk een hele simpele manier om mobiel te testen want wij hadden daar nooit over nagedacht en wij dachten daarna zelfs van dan ga je naar je bankieren app en zet een hogere limiet even, zeker als digital minded people die zijn er wat makkelijker vaak in maar ja blijkt dat je klant toch niet zo is.&nbsp;<br> <br>Guido: Het is toch wel een extra drempel waar ze blijven hangen.&nbsp;<br> <br>Simon: Ja precies.&nbsp;<br> <br>Guido: Snap ik wel, ik snap ook dat je dat niet.. daar denk je niet aan zonder gebruikersonderzoek te doen. Dan zit je gewoon naar Google Analytics data te kijken en dan denk je van 'daar haken allemaal mensen af daar maar ja.'&nbsp;<br> <br>Simon: Ja maar dat 'waarom,' daar heb je geen idee van.&nbsp;<br> <br>Guido: Wel super leuk dat jullie inderdaad makkelijk naar de winkel toe kunnen lopen. Maar ik kan me voorstellen, jouw team, jullie zijn voornamelijk bezig met de online funnel, maar de offline funnel pakken jullie ook af en toe bij en die kun je ook verbeteren.&nbsp;<br> <br>Simon: Jazeker, het is ook wel.. 80 bijna 90% van onze verkoop doen we online. Dus dan moeten we ook denken van 'wat is dan de toegevoegde waarde van een winkel hebben?' Is dat alleen meer serviceverlenging, want er zit ook een sales aspect in, maar dat is wel leuk bij Van Moof dat we alles intern hebben qua sales zeg maar en qua verkoop kanalen, dat we echt de mogelijkheid hebben om te proberen van kunnen we online en offline met elkaar te linken? Kunnen we {} attributie modeling doen, dus online of offline, easier said than done maar ja dan ga je toch denken van kunnen we iets bedenken nou dan kunnen we de model gebruiken die we hadden, om dan een connectie te leggen. Er was een dingetje van nu, we kwamen erachter dat als mensen in New York of San Francisco waar we winkels hebben, dan moeten mensen van te voren een waiver tekenen van 'Van Moof is niet aansprakelijk is als je crasht op de fiets' en dat soort zaken. En toen dachten we van stel nou dat je dit formuliertje online maken en dat mensen gewoon een pagina verder gaan, daar de waiver lezen en het signen via middel van een email adres achter te laten. En toen we dat deden, hadden we natuurlijk een email adres van een Amerikaanse test rider, en toen gingen we kijken van staat dat email adres nou ook in de CEM van mensen die daadwerkelijk hier een fiets hebben gekocht? En zo hadden we een link tussen die mensen die een test ride deden niet in de winkel hebben gekocht maar wel online hebben gekocht. Dus andersom, hadden mensen al online gekocht en kwamen ze dan in de winkel om nog even een test ritje te doen.&nbsp;<br> <br>Guido: Grappig.&nbsp;<br> <br>Simon: En zo hebben we dan in de US de eerste uitgehold, het werkte goed, brand was tevreden, klanten waren er blij mee, en nu hebben dat dus wereldwijd uitgehold. Dus elke store waar je een test ride komt doen, moet je dus digitaal even tekenen dat je akkoord gaat met de voorwaarden en dan hebben wij ook je email adres om die check te doen. Verder doen we er niks mee, we doen alleen die check en ja dat biedt ook heel veel mogelijkheden en inzichten met name aan onze brandstores van oké dit is de toegevoegde waarde van de winkel in Parijs bijvoorbeeld.&nbsp;<br> <br>Guido: Ja, cool, en wat nou redelijk uniek is denk ik aan jullie, volgens mij alle mensen die een Van Moof fiets hebben die hebben een account bij jullie toch? Je moet die app hebben. En dan heb je een soort \"Mijn VanMoof omgeving.\"&nbsp;<br> <br>Simon: Ze hebben natuurlijk.. alle fietsen die we verkopen, zijn slim om het zo maar te noemen. Dus je hebt een app erbij, in de app kan je instellingen bij je fiets doen met licht aan en uit, dat soort zaken. Maar ook bijhouden waar je fiets is, ook het slot mee aan en uit stellen. Of zelfs melden als je fiets gestolen wordt dan kan je melden hey mijn fiets is gestolen en dan gaan onze bike hunters op zoek naar je fiets. Dus daarvoor hebben natuurlijk de Mijn VanMoof omgeving dat ze de website maar dus ook in de app staan er allemaal mensen ingelogd ja.&nbsp;<br> <br>Guido: Ja dat is wel uniek voor jullie sector neem ik aan.&nbsp;<br> <br>Simon: Ja ik geloof niet dat Gazelle dat heeft of zo, nee.&nbsp;<br> <br>Guido: Maar dat geeft wel leuke mogelijkheden, maar is dat iets waar jouw team zich bezig houdt? Of zitten jullie vooral op de acquisitie?&nbsp;<br> <br>Simon: De focus is wel altijd op de acquisitie maar omdat we natuurlijk ook een subscription model hebben, dus maandelijks bedrag, dan is de advertentie dat wordt dan ook heel belangrijk, en wordt nog belangrijker in de komende jaren. Dus de focus zal wel wat meer gaan schuiven naar advertentie.&nbsp;<br> <br>Guido: Hoe ziet een gemiddelde week of dag bij jullie eruit? Wat voor werkzaamheden doen jullie?&nbsp;<br> <br>Simon: We zijn dus begonnen met twee graph marketeers en waarbij ik meer focus op organic en analytics en soms ook CRO, en mijn andere collega is meer verantwoordlijk voor AdWords en paid social en alle andere paid kanalen. Maar nu hebben onze nieuwe manager aangenomen dus die regeert ook als een soort umbrella naar management team, en we hebben een trainee aangenomen en die nu ook ons echt aan het helpen is met alles rond graph marketing. En daarnaast zijn we langzaam meer sturend aan het worden in plaats van supporting aan de rest van de marketing team waar eigenlijk in het verleden tot heden in campagnes heeft gedacht, dus was er een campagne en werden wij online voor ingezet en dan was de campagne over en dan ging ie alles ook letterlijk uit. Dat zijn allemaal dingen dus waar we nu allemaal verandering aan het aanbrengen zijn en waar we nu aan't omschakelen zijn van, wij zien dat ze met dit kanaal dit en dit kunnen doen, kunnen jullie als creatief team daar wat tofs voor bedenken? Dus die omschakeling is nu een beetje aan het komen, dan zie je in een keer, dat was ook een van de dingen die wat in het begin al tegenkwamen, alle advertenties, alles videos wat nu gemaakt worden, die waren allemaal horizontaal dus 16 x 9, maar op mobiel heb je daar dus helemaal niks aan, want je hebt je telefoon verticaal aan de hand dus toen hebben we heel snel gezegd 'hey jongens we willen eigenlijk een 4 x 5 of 1 x 1 videos want dan is het voor mobiel ook interessant. Dus dat zijn van de kleine dingetjes die we nu echt, nu inmiddels standaard zijn geworden, en de creatieve team standaard dingen luistert van dialect bijvoorbeeld, we moeten niet alleen maar 16 x 9 videos of zelfs fotografie hebben maar ook staande fotografie en video hebben. Zodat ze op alle mogelijke platformen kunnen gaan gebruiken.&nbsp;<br> <br>Guido: Precies.&nbsp;<br> <br>Simon: We proberen eigenlijk continu alles te testen wat we aan het doen zijn, we proberen ook elk betaald kanaal moet incrementeel waarde toevoegen aan appositie als het waren. We doen gewoon veel op social en als je dat in Google Analytics op last klikt dan doet dat echt helemaal niks, er komt geen enkel {} uit. Dus dan zou je kunnen zeggen, waarom doen we het eigenlijk? Waarom niet die euros in een AdWord stoppen? Of in iets anders? Als je analyses gaat doen, en we doen al veel incrementeel testen, dus dan zitten we op een Facebook campagne in een bepaald land, compleet uit. Of we doen, dat soort geo testen, en dan gewoon kijken van, wat gebeurt er dan? En dan zie je in een keer toch dat de sales in dat betreffende land naar beneden gaat, dus er zit incrementele waarde aan social advertentie.&nbsp;<br> <br>Guido: Ja super lastig dat tracken, maar het heeft wel een soort van impact.&nbsp;<br> <br>Simon: Ja exact. Met Google en Facebook doen we veel brander studies dus dan heb je misschien een keer zo een YouTube survey dat je krijgt van 'ken je een van deze vier merken?' of 'heb je recentelijk een advertentie gezien van een van deze vier merken?' Dat soort branding studies doen we nu ook eigenlijk elk half jaar op YouTube en op Facebook. Om continu steeds een beter beeld te krijgen van 'wat is nou de waarde van deze branding campaign' of branding campaign die we aan het doen zijn. Ook wat is de groei in de markt naar onze naamsbekendheid, dat soort zaken. Dus we trekken allemaal experimenteren naar alle kanalen die we hebben zodat wij dat maar ook hebben.&nbsp;<br> <br>Guido: Je had het net over iets stilzetten in een bepaald land en in hoeveel landen zijn jullie actief?&nbsp;<br> <br>Simon: Circa 35 landen uit mijn hoofd. En we zijn nog actief in vijf landen, dat zijn een beetje onze team markets, Nederland, Duitsland, Frankrijk, UK, US, en daar halen we nog Japan er nog bij. Dus eigenlijk de landen waar we brandstores hebben en daar ook echt op focussen.&nbsp;<br> <br>Guido: En nog gekke dingen die wel eens naar boven komen in experimenten of analyses? Specifiek voor bepaalde landen?&nbsp;<br> <br>Simon: Nou Japan is nou een complete vreemde eend in de bijt. Dat merk je echt aan alles. We zitten daar steeds meer te denken, we hebben eigenlijk niks aan localised campaigns gedaan en we merkten wel dat dat ook echt impact heeft op in de sales in Japan. Dus dat was de learning daar, van we moeten volgend jaar echt gaan localisen en misschien ook een agency in Japan gaan inhuren om ons te helpen erbij. Anders halen we dat niet. We zien met name in Duitsland is echt een goede markt maar ook een specialistische markt, je merkt soms echt dat het Duitsers zijn die echt elke detail van de fiets willen weten, tot de laatste ombouw, dat ringetje zeg maar, ze willen zelfs daarvan weten van welk merk het is. Dus dat was bijvoorbeeld ook in het begin toen ik begon, dat heb ik nog in mijn hoofd, op de product detail pagina, daar stond er niet een lijst van alle details van de fiets. En ik kwam erachter omdat ik zo een poll had gedaan met Hotjar met 'what are you missing on this page?' Zo een simpele vraag had ik gesteld. En daar kwam massaal uit dat mensen dus op zoek waren naar de specifications van de fiets. En toen ging ik kijken en het stond er niet op, das eigenlijk best wel raar dus ging ik naar de RMD team, en ik vroeg 'hebben jullie een lijst van alle onderdelen van de fiets?' Die hebben ze natuurlijk gewoon klaar liggen. We hebben daar gewoon een paar details eruit gehaald die relevant waren en die hebben we gewoon online gezet. Officieel hadden we eigenlijk een AB test moeten doen we hadden zoiets van als zoveel mensen vragen hiernaar vragen, en zo obvious is dat niet mis, dus dat hadden we zo snel mogelijk online. Maar we merkten wel dat de antwoorden die dropte in een keer want mensen wisten in een keer waar ze naar op zoek waren. Je merkte dat zeker in Duitsland ook toen een collega van mij op een beurs daar was van oké we willen echt alle details weten dus dat zou iets waar we nog verder aan kunnen werken, zeker in Duitsland. Maar waarschijnlijk in alle landen van oke details geven.&nbsp;<br> <br>Guido: Maar is het dat nu iets wat in alle landen staat, of allen in Duitsland?&nbsp;<br> <br>Simon: De specification staat nu in alle landen omdat we dat nu eigenlijk obvious vinden om dat overal te hebben. Ik denk dat dat een localisation is, maar zoals in de US is helmen echt een ding. Dus we krijgen ook veel comment op advertenties of gewoon op onze site van 'hey wat raar dat jullie fotografie en film hebben waar mensen geen helm op hebben. Dus dat is ook, daar moet je ook over nadenken, wat gaan we daarmee doen? Willen we ook een campagne maken alleen voor de US waar mensen een helm op hebben? Of blijven we Nederlanders en doen we het zonder helm? En dan merk je ook in een keer in de US, daar moet je echt ook uitleggen dat je een fiets gebruiken om naar je werk toe te gaan.&nbsp;<br> <br>Guido: Ja dat is natuurlijk een heel ander verhaal dat je moet vertellen. Ik kan me voorstellen ja.&nbsp;<br> <br>Simon: Het is in Nederland gewoon natuurlijk common sense en iedereen weet waarom je een fiets gebruikt en zeker een fiets zoals VanMoof. Maar in de US is een fiets vooral een weekend ding, zeker een elektrisch motorbike. Maar ja dat verkopen wij niet, wij verkopen echt een fiets om van maandag tot en met vrijdag, of tot zondag om van A naar B te gaan.&nbsp;<br> <br>Guido: Wat het ook is.&nbsp;<br> <br>Simon: Dus dan merk je wel van, dan moeten we echt gaan uitleggen dat je dus uit de auto kan stappen, of uit de metro kan stappen en op een fiets kan stappen om naar je werk te gaan.&nbsp;<br> <br>Guido: Ja precies, ik had het toen ook toen ik voor Euroflorist werkte ook dat het een heel ander beeld is in verschillende landen van een boeketje bloemen, wat dat betekent voor mensen. Dat het in Nederland, het is zo veel voorkomend zeg maar dat een boeketje bloemen iets is wat je ergens bij geeft. Maar in heel veel andere landen is een boeketje bloemen een stuk duurder dan dat ze in Nederland zijn en is het boeket het hoofdcadeau. Dat is een hele andere manier om je product te positioneren en te verkopen in verschillende landen. Onlangs dat het overal dezelfde website en zelfde propositie en zelfde assortiment wat je hebt maar toch moet je daar even anders over nadenken. Hoe zorgen jullie ervoor dat er een mindset komt van oke we moeten een experiment opzetten, wordt dat bij campagnes al beter over nagedacht? Maar hoe zorg ervoor dat dat blijft zeg maar, dat mensen jullie blijven opzoeken van 'hey we gaan een campagne doen, maar klopt het data wel? Kunnen we wel wat meten? Is het wel action-driven?' Hoe zorgen jullie ervoor dat het cultuur binnen jullie bedrijf blijft? En uitgebreid wordt?&nbsp;<br> <br>Simon: Zeker is VanMoof een beetje een startup, onlangs dat we al tien jaar oud zijn, daar zit natuurlijk een soort van experimenteel cultuur zit er wel in alleen, ik had het ook toen ik CMO was.. eigenlijk realiseer je niet dat je dat altijd aan het doen bent. Zelfs onze oprichters, dat zijn natuurlijk gewoon, die hebben natuurlijk gewoon een experiment gedacht, namelijk laten we een fiets gaan maken, dat is een experiment geweest. Eigenlijk elke strategie die je bedenkt is een experiment, en het enigst wat wij kunnen doen vanuit ons CRO vakgebied is eigenlijk een soort van aan te geven van oke maar als je dus dit idee wat je hebt bedacht en jij noemt misschien een concept en ik noem een experiment. Laten we daar een goeie hypothese opstellen, of laten we een paar goeie matches bij bedenken die helpen om gevoel te krijgen of inzicht te krijgen dat je eigenlijk goed op weg bent. Je merkt dat nu langzaam dat kwartje begint te vallen is, met nieuwe business modellen en dat subscription model wat we vorig jaar hebben gelanceerd. Laten we daar een soort hypothese eromheen maken en maak het heel simpel, vooral niet te moeilijk, en laten we bijvoorbeeld vaste periodes prikken, om te kijken zijn we eigenlijk nog op schema of zijn we tevreden met het resultaat die we hebben gekregen. Het klinkt bijna als zo een bedrijf wat half leeg is. Ik vond het vooral heel grappig, als je dus in een keer neemt wat iedereen al aan het doen is en dat dan kan framen als een experiment dan heb je eigenlijk iedereen heel makkelijk mee en dan is dat niet zo eng meer.&nbsp;<br> <br>Guido: Ja ik zat inderdaad ook heel vaak bij bedrijven, en het experiment ben je eigenlijk al aan het doen, alleen je valideert ze niet. En dat is waar wij binnenkomen, laten we inderdaad nadenken van oke leuk dat je het experiment doet maar je probeert meer mensen op je website te krijgen maar dat meet je helemaal niet. Laten we daar eens gaan kijken hoe we dat kunnen doen.&nbsp;<br> <br>Simon: Met ons creatieve team, toen we binnenkwamen, moest ik mezelf echt even tegenhouden van Simon, nog geen data, geen data, geen data. En op een gegeven moment kom je met Data Tuesdays introduceren, dus elke dinsdag ochtend was er en half uurtje, kwartiertje, niet zo lang waarin we iets over data vertelden, gewoon van weten ze eigenlijk hoeveel mensen op onze website komen elke maand, hoeveel verkoop we daar doen elke maand, waar bezoekers vandaan komen, van Google of Facebook, allemaal dat soort dingetjes. Dus we gingen gewoon mensen, we pakten rapportjes of Google Analytics of mijn collega had de advertentie tools en we maakten daar een kleine prestatie van, sloegen het helemaal plat en gingen gewoon vertellen wat we eigenlijk aan het doen waren, en we kregen daar de reactie van 'oh dit is eigenlijk best wel tof of kun je ook dit of dat zien?' Dus op een gegeven moment wat we creëerden was dat wij aan het pushen waren van 'hier is data, doe er wat mee' en zij kunnen nu gewoon vragen als een campagne live staat, wat voor nieuws je krijgt de week erna, krijgen we vragen van 'hoe gaat het met de campagne? Is het echt goed gegaan dat we die vertical hebben beschoten?' Dus ja mensen vinden het nu ook erg leuk aan het worden om te zien en om te horen wat doet die shoots die we hebben gedaan. Recentelijk was er een team bezig met een campagne en die werd beschoten in Barcelona, en dat kost veel tijd en energie en veel geld aan besteed, dat is wel tof om te zien wat er voor terug komt.&nbsp;<br> <br>Guido: Ja precies heel veel mensen kunnen het natuurlijk zien als een soort van bedreiging van het team gaat ineens analyseren of ik mijn werk, wat de impact van mijn werk is zeg maar.&nbsp;<br> <br>Simon: Dat was onze grootste angst inderdaad dat dat zou gebeuren, maar gelukkig valt dat mee.<br> <br>Guido: Ja het is heel erg de mindset binnen een bedrijf, wat bepaalt wat de standaard reactie daarop is oh het is een bedreiging en ik wil er niks van weten, of mensen denken 'oh dat is interessant en hoe kan ik mijn werk beter doen?'&nbsp;<br> <br>Simon: Bij de PR team hadden we een beetje hetzelfde, omdat ik een beetje de SCO rol hebt, ik wil linkjes hebben. Fantastisch PR team die hebben links met journalisten en we kregen een mooie artikel, maar toen dacht ik ja er onderbreekt gewoon een linkje in het artikel, dus toen hebben we gezegd van kan je PR niet aanpassen en zeggen van 'we willen x aantal artikelen over VanMoof met een linkje erin. Dat was niet heel strikt of zo maar je ziet nu wel in een keer dat, zij komt nu naar me toe en dan zegt ze 'high five' want dan heeft ze een artikel meet een linkje. En dan maakt het niet zoveel uit wat er in de tekst zit maar gewoon heel simpel, dan ben ik al blij.&nbsp;<br> <br>Guido: Je noemt nu over KPI's, die aanpassen, wat zijn jullie main KPI's waarop jullie sturen?&nbsp;<br> <br>Simon: We hadden er laatst inderdaad intern over, ik zei laten we conversion rate als KPI hebben want dat maakt de meeste invloed&nbsp; en toen keek mijn manager mij heel scheel aan en zei van zet gewoon traffic uit en gewoon hoge conversie..&nbsp;<br> <br>Guido: Klinkt bekend ja.&nbsp;<br> <br>Simon: Een simpel trucje, nee we zijn nu weer een beetje mee bezig met keywords maken, en ik heb duidelijk gewoon gezegd van weet je ik kan wel bepalen wat ik van jullie wil hebben maar dat heeft niet zoveel zin, ik wil liever weten wat is de KPI van het bedrijf en kunnen we die dan downbreaken voor mij. Dus we zitten nu in die fase op, het is heel simpel, we zitten gewoon op verkoop van fietsen, dus op zich is het niet zo heel spannend, en we hebben daar een doelstelling voor, die moeten we behalen en die doelstelling splitten we uit over een paar campagnes die we aan het doen zijn en dan weten we wel wat we elke maand moeten doen. Zo zijn we dat nu een beetje aan het opsplitsen en main KPI is gewoon fietsen verkopen.&nbsp;<br> <br>Guido: Ja we zijn met de Shocking Tomorrow groep, die zijn al een paar keer voorbij gekomen in de podcast, dit jaar zijn we bezig met een groepje voor conversie optimalisatie, we zijn bezig om te kijken of er een soort standaard framework voor KPI's kunnen neerzetten of wat guidelines kunnen maken zeg maar. Om dat goed uit te werken want we zien dat heel veel bedrijven daarmee worstelen van conversie, wat je al zegt, niet echt de beste KPI, onlangs de standaard term voor de industrie natuurlijk CRO. Maar goed conversie rate is niet altijd de beste. Ook gewoon puur orders is niet handig want dan ga je heel veel korting geven en dan gaan je orders ook wel om hoog dus dat werkt ook niet. Dus je gaat vaak meer de revenue of naar de lifetime value kijken maar waar precies, en hoe je dat het best kan doen daar zijn we mee, daar zijn we over na aan het denken dus hopelijk komt er iets in januari daar van uit.&nbsp;<br> <br>Simon: Ik denk uiteindelijk dat revenues of orders toch waarschijnlijk wel de main KPI's die nauw samenhangen met elkaar. En dan heb je waarschijnlijk wat sturende KPI's die een beetje indruk geven van 'klopt het allemaal wel?' Dan zou je zelfs een ding als bound trade of zo mee kunnen nemen van 'ho dat geeft een indruk van bijvoorbeeld hoe goed een bepaalde advertentie campagne draait. Het zegt niet alles maar het is wel een metric waarin..<br> <br>Guido: Het zit in de naam, het zijn indicators.&nbsp;<br> <br>Simon: Ja precies.&nbsp;<br> <br>Guido: En je moet ze niet alleen maar als harde doelen behandelen altijd. Waar ik wel benieuwd naar ben, je hebt dit nu anderhalf jaar gedaan hoe zien de komende twaalf maanden voor jou en je team eruit?<br> <br>Simon: We hebben eigenlijk afgelopen anderhalf jaar basics opgezet, we komen nu wel op een punt dat we met de volle gang A/B testen gaan doen. We hebben nu genoeg traffic ervoor dus we hebben afgelopen jaar daar hard aan gewerkt. Dus eigenlijk we hebben alle vlakken van performance marketing en growth marketing en zijn we nu, willen we nu een volgende stap in maken. Dus voor CRO betekent dat A/B testen, ook willen we vaker user testing gaan doen, gewoon systematisch bijvoorbeeld elk half jaar of zo dat we een user test doen. SCO hebben we nog heel veel te doen daar zijn we hard mee bezig, op technisch vlak maar ook op outreach en andere vlakken, en we zijn gewoon continu bezig met incrementeel de waarde aantonen van de kanalen die we inzetten en dat kan zelfs in de toekomst iets zoals tv of radio zijn. We zitten daar echt over na te denken, niet zomaar geld erin pompen maar kunnen we iets opzetten, of neerzetten als experiment zodat we weten wat voor toegevoegde waarde heeft een kanaal. Dus dat proberen we zo across the board te doen.&nbsp;<br> <br>Guido: Ik ga je challengen Simon, user testen moet je eigenlijk elke maand kunnen doen, dus als ik jou over een jaar weer spreek..<br> <br>Simon: Ja op zich wel hè<br> <br>Guido: Elke maand kwalitatieve user test doen, dat moet lukken. Zeker voor jullie inderdaad, ik bedoel je zit inderdaad boven de winkel.&nbsp;<br> <br>Simon: Je hebt helemaal gelijk.&nbsp;<br> <br>Guido: Mochten mensen hierin interesse in hebben, ik zie dat er twee vacatures voor jouw team online staan op de website voor growth marketen en data scientist.&nbsp;<br> <br>Simon: Ja we zijn nu met z'n vieren en we willen eigenlijk eind dit jaar met acht zijn. En volgend jaar ligt ie in de twintig. We zijn op zoek naar een hoop handjes.&nbsp;<br> <br>Guido: En jullie zitten in het centrum van Amsterdam, toch?&nbsp;<br> <br>Simon: Ja we zitten naast het Oosterpark, goede locatie, kan je lekker wandelen door het park.&nbsp;<br> <br>Guido: Wandelen? Oh ik dacht jullie gaan door het park fietsen<br> <br>Simon: Nou in het park gaan we wel nog gewoon even wandelen. Je krijgt een fiets van de zaak dus dat is ook ideaal. Eigenlijk is dat de reden dat ik naar VanMoof ben gegaan. In Amsterdam is er altijd iets met je fiets, als je bij een fietsenmerk gaat werken dan los je al je problemen op.&nbsp;<br> <br>Guido: Jullie verkopen geen fietsen, jullie lossen een vervoersprobleem op? En als laatste nog, waar haal jij persoonlijk je inspiratie voor je werk vandaan? Los van VanMoof zelf.&nbsp;<br> <br>Simon: Het zijn zoveel kleine en grote dingen, ik vind het leuk om naar meetups of conferenties te gaan, mensen spreken, CRO café meet-up, of Oud Conversion Hotel of zelfs Emmerce camp, en daar dan met veel mensen te spreken en ook gekke ideeën te horen maar ook gewoon te kijken naar andere merken die je waardeert en proberen te snappen wat ze aan het doen zijn. Maar soms ja, ik heb het natuurlijk vaak met Arnaud erover en dan hij had ook in zijn podcast over dingen als koken of zelfs afwasmachine inpakken, dat soort dingen. Dat quirkiness snappen daar heb ik last van of wat doe je, en dat dan toepassen naar online toe en naar mijn vak toe en dat is altijd wel grappig.&nbsp;<br> <br>Guido: Ja precies, ja en inderdaad de CRO Café conference die gaat op 30 Juli plaats vinden bij HelloPrint in Rotterdam, eigenlijk eerste evenement, goed dat je ook langskomt en ik hoorde ook van de week wel- we hadden het al eerder erover gehad in de podcast- over de CRO awards. Die zijn verplaatst, die zouden eerst in september plaats vinden maar die gaan nu naar 3 oktober. En dan staan we daar ook als CRO café met een live-stream. Heb je je case al ingediend Simon?&nbsp;<br> <br>Simon: Nee, ik heb nog helemaal niks ingediend, maar ik heb een hele hoop extra tijd dus dat scheelt.&nbsp;<br> <br>Guido: Ja volgens mij staan de inschrijvingen nog open. Ik zal een linkje in de shownotes zetten, kun je kijken.&nbsp;<br> <br>Simon: Awesome.&nbsp;<br> <br>Guido: Hey dankjewel, leuk om te horen hoe dat gaat bij VanMoof en we zien je op 30 juli.&nbsp;<br> <br>Simon: Is goed, tot dan.&nbsp;<br> <br>Guido: Hoi hoi<br> <br>Simon: Doei&nbsp;</p><p>‍</p>",
  "show_notes": "<ul><li><a href=\"https://www.linkedin.com/in/simonvreeman/\" target=\"_blank\" data-rt-link-type=\"external\">Simon op LinkedIn</a></li><li><a href=\"https://twitter.com/vreeman\" target=\"_blank\" data-rt-link-type=\"external\">Simon op Twitter</a></li><li><a href=\"https://vreeman.com/cro.html\" target=\"_blank\" data-rt-link-type=\"external\">Simon's CRO tools en resources</a></li><li><a href=\"https://www.vanmoof.com/en_nl/\" target=\"_blank\" data-rt-link-type=\"external\">VanMoof</a></li><li><a href=\"https://roadmunk.com/blog/shit-umbrella/\" target=\"_blank\" data-rt-link-type=\"external\">Shit Umbrella</a></li><li><a href=\"https://www.shoppingtomorrow.nl/nl/themas/marketing/conversion/conversion-optimization-2019-2020\" target=\"_blank\" data-rt-link-type=\"external\">Shopping Tomorrow</a></li><li><a href=\"https://www.cro.cafe/podcast/waarom-cro-specialisten-goeie-koks-zijn\" target=\"_blank\" data-rt-link-type=\"external\">Podcast met Arnout Hellemans</a></li><li><a href=\"https://dutchcroawards.nl/\" target=\"_blank\" data-rt-link-type=\"external\">CRO Awards</a></li></ul><p>‍</p>",
  "guests": [
    {
      "id": "simon-vreeman",
      "name": "simon-vreeman",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "nl",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/growth-marketing-bij-vanmoof.jpeg",
  "language": "nl",
  "type": "podcast"
}