{
  "id": "het-cro-team-van-bolcom",
  "title": "Het CRO team van Bol.com",
  "description": "Van Melle, Product owner Persuasion bij bol.com, leren hoe het eerste CRO team bij bol.com is opgezet, waar ze nu staan en wat hun ambities zijn.",
  "date": "2025-01-08T20:07:07.531Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/4263fce3/965610be.mp3",
  "transcript_url": "<p>Guido: Ja Melle, welkom in het CRO cafe. Voordat we het over je huidige werk en team gaan hebben. Hoe ben je uberhaupt bij Bol.com terecht gekomen en wat heb je hiervoor gedaan?</p><p>Melle: Ja, Guido. Leuk dat je me hebt uitgenodigd. Ik werk nu ruim 3 jaar bij Bol.com. Daarvoor heb ik 5,5 jaar als eerste baan in mijn werkende leven bij Rabobank Nederland gewerkt. Voordat ik begon werken zaten er twee zaken in mijn hoofd. Dat was: ga ik nu solliciteren op het bedrijf waar ik ooit voor zou willen werken of ga ik op zoek naar een bedrijf waar ik een rol kan vinden waar ik mij het meest comfortabel in voel en daarna op zoek ga naar hét bedrijf waar ik voor wil werken. Ik heb voor dat laatste gekozen. Rabobank was ook in de jaren toen ik begon als beste werkgever van nederland bestempeld. Ik dacht: laat ik mij daar nou eens ontwikkelen tot een niveau waar ik mij dusdanig comfortabel voel, dat ik op zoek ga naar de Champions League in mijn vakgebied. Die heb ik uiteindelijk gevonden bij Bol.com. Ik ben in principe binnengehaald door een oud collega die hier is komen werken als Business Analyst in de UX. Daar heb ik een keer mee geluncht en die wist dat ik openstond voor een nieuwe uitdaging. Zo had hij in het laatste kwartier van de lunch ervoor gezorgd dat er een recruiter aan tafel bijzat zonder dat ik dat van tevoren wist. Dat was een leuke verrassing. Eigenlijk is zo het balletje gaan rollen op de plek waar ik nu al 3 jaar met superveel plezier en energie binnen Bol.com werkzaam ben.</p><p>Guido: toen jij drie jaar geleden begon was er nog geen CRO team, he? Ben jij binnen gehaald om dat op te gaan zetten of voor iets anders en heb je halverwege bedacht dat er een CRO team moest komen?</p><p>Melle: Ik ben helemaal niet binnengehaald als CRO specialist. Ik ben binnengehaald als Business Analyst UX en na een jaar mocht ik mij bezig houden met innovatie en verbetering van het checkout proces. Daar werd het zaadje gepland voor het opzetten van een CRO team binnen Bol.com. Wat ik noteerde toen ik daar startte en wat ik ook had met de Business Architecten was dat ik aannam dat wij binnen onze checkout non stop AB testen hebben draaien. Kijk je dan naar de hoeveelheid verkeer, de potentie die je aan het eind van een formule kan hebben of bij het doen van optimalisaties. En het antwoord bleek daarbij nee te zijn. Dat verbaasde mij enorm, dat het vuurtje was aangewakkerd om in eerste instantie binnen het domein Last Mile meer AB testen op te gaan zetten en anderzijds om mij heen te gaan kijken op andere plekken in onze webshops en te testen hoeveel AB testen en optimalisatie nu op dat soort plekken al worden gedaan. Die werden wel gedaan, daar moet ik zeker mijn toenmalige collega's niet in te kort doen, maar wat ik merkte was dat er geen gestructureerd proces was. Geen afstemming onderling tussen verschillende teams over verschillende domeinen. De manier waarop AB testen werden gedaan verschilden nog al eens van elkaar, ook in analyses vooraf en achteraf. Dat was echt een eye-opener om eens met een groepje enthousiastelingen (Business Analysten, web analysten) in een hok te duiken en te zeggen: laten wij nu eens kijken of wij voor het einde van het jaar (het was mei 2017), 100 AB testen te kunnen bedenken, daar een potentieberekening van te kunnen doen en die daadwerkelijk uit te voeren. Dat was de kickstart geweest van het CRO team binnen Bol.com.</p><p>Guido: Wat is jouw persoonlijke motivatie om CRO te doen?</p><p>Melle: Er zijn een aantal elementen waar ik enorm veel energie van krijg. Ik vind het erg leuk om impact te maken. Voor een grote groep mensen het beter maken van een online ervaring. Daarnaast is het ook nog eens zo, met name bij AB testen, het echt over kort cyclische verbetering gaat. Het is snel intereren, veel testen doen, snel resultaat, al dan niet positief. En dat voedt mijn energie continue. Daarnaast hebben wij ons niet beperkt tot een domein van de webshop om de 100 testen te gaan doen. De hele website door, van productpage, search, homepage, accountomgeving, checkout, basket. Daar waar wij potentie zagen voor verbetering, zijn wij ermee aan de slag gegaan en hebben wij met de redelijk beperkte middelen AB testen gaan doen. Dat zorgt er enerzijds voor dat je op veel fronten veel nieuwe inzichten kan opdoen en je ook overal tegenaan kan en wil gaan bemoeien. Anderzijds, zorgt dat er ook voor dat je enorm veel kennis opdoet van hoe de webshop werkt, het totaalpakket wat wij als bol.com aanbieden aan de klant of gebruiker, hoe dat zich verhoudt tot elkaar en hoe wij ervoor kunnen zorgen dat als de links aan een knop draaien, wat voor effect dat heeft aan de rechterkant.</p><p>Guido: Dat vindt de rest van de organisatie altijd heel erg leuk dat het CRO systeem zich overal mee wil gaan bemoeien.</p><p>Melle: Nee, dat is onzin. De cultuur binnen bol.com maakt ook wel dat wij voldoende ruimte kregen. Het experimenteren en vooral hypothese gedreven werken is iets wat ik tot mij kon nemen toen ik binnenkwam bij bol.com. De vruchtbare grond was er al zeker om veel met het onderwerp bezig te kunnen zijn en die vrijheid te kunnen krijgen. Echter kun je je natuurlijk wel voorstellen toen wij begonnen als team, wij nog niet zo bezig waren met stakeholder management bijvoorbeeld. Bij een van de eerste succesvolle testen vronsten veel collega's of dat wel de beste test was en beste variant die was uitgedacht. Op het moment dat wij de analyse deden en constateerden dat het een winner was, en niet zo'n klein beetje ook, hebben wij dat gecommuniceerd en begint dat begrip en ook de vrijheid die dat met zich meebrengt uiteindelijk, het vertrouwen, begint steeds groter te worden. Dat is heel prettig om dat verder uit te kunnen bouwen.</p><p>Guido: Om een beetje het landschap te schetsen waar jij je in beweegt met het CRO team. Met welke teams is bol.com opgebouwd waarmee jij moet communiceren?&nbsp;</p><p>Melle: we hebben veel categorieteams die verantwoordelijk zijn voor alles wat in hun winkels gebeurd. Elke categorie zien wij als een winkel en daarvoor zijn categorieteams met merchandisingmanagers, productspecialisten, inkopers en dergelijke. Daarnaast heb je de club waarin ik werkzaam ben, dat is shoppingplatform. Dat bestaat uit twaalf scrum teams die zich bezighouden met alle innovatie die je op ons platform als gebruiker tot je kan nemen. Dat gaat van search-, tot checkout en PHP optimalisatie en innovatie teams. Met name binnen het domein van twaalf teams is het CRO team actief en zijn vanuit die verschillende teams mensen die zitting hebben in het CRO team. Het is dus niet zo dat het CRO team opzichzelfstaande functies heeft, maar het is puur een samenstelling van enthousiastelingen, collega's die graag bezig zijn met optimalisatie en die daar ook wel graag buiten hun eigen domein met hun eigen team aan de slag mee willen gaan. Daarnaast een tweetal webanalysten die de volle bak meedraaien en analyses vooraf doen en ook conclusies achteraf in kaart proberen te brengen.</p><p>Guido: Als ik het zo hoor is het dat jullie het validation in every organisation, waar Tom Wester het de vorige keer over had, het in praktijk brengen.&nbsp;</p><p>Melle: Vorige week had ik de podcast van Tom beluisterd. Ik vond wel dat hij iets aanstipte waar ik het mee eens ben. Met ons CRO team zijn wij tot op heden als een eilandje aan de slag gegaan met het vinden van optimalisaties. Een van de doelen die wij voor dit jaar hebben gesteld is om van het eiland af te stappen en meer een faciliterende rol te gaan hebben richting die twaalf scrum teams. Tom had het in zijn interview over de switch maken van CRO team van pride naar humble. Dat is wel iets wat wij als team ook proberen door te maken om ervoor te zorgen dat de andere teams uiteindelijk ook kunnen helpen en een bijdrage richting Henk kunnen leveren in het meer CRO minded zoeken naar optimalisaties en kleine verbeteringen binnen de domeinen waar zij verantwoordelijk voor zijn. We zijn daar nog lang niet; we zijn in de aanloop daar naar toe. De eerste paar jaar hebben wij vooral bewijsvoering gevonden voor ons bestaansrecht. De volgende stap, volwassenheid binnen Bol.com, is naar een meer faciliterende rol te gaan.</p><p>Guido: Dat je mensen van verschillende teams in het CRO team hebt, die het representeren, is al een goede stap.</p><p>Melle: Dat werkt ook heel prettig. Dan krijg je ook veel goede ideeen uit verschillende hoeken van teams die overal in de webshop werken.&nbsp;</p><p>Guido: De productteams proberen jullie te faciliteren. Die mensen hebben natuurlijk gewoon hun eigen werk en experimenteren is vaak ook een beetje eng. Dan ga je ineens bewijs zoeken of iets werkt en misschien ben ik als designer of contentschrijver wel een beetje aangevallen. Hoe zorgen jullie ervoor dat die mensen die mindset krijgen en wat wil je van die mensen? Wil je dat ze experimenten gaan aanleveren, uitvoeren, analyses doen? Hoe probeer je dat te sturen, wat vragen jullie van die productteams?</p><p>Melle: Wat we vooral willen is een bijdrage leveren in het succes van alle scrumteams. Succes kan zitten in het neerzetten van nieuwe innovaties en het verbeteren van technische foundations van de producten waar zij verantwoordelijk voor zijn of de features die zij opleveren. Anderszijds is het zo dat wat zij eerder hebben opgeleverd cyclische verbeteringen in toe te passen. Daar waar wij voorheen nog wel eens zelf als CRO team features van andere teams probeerden te verbeteren, proberen we nu meer te helpen door de vraag te stellen wat ze nodig hebben om succesvol te zijn als scrumteam. Je ziet dat bijvoorbeeld terug dat wij tweewekelijks met een afvaardiging van scrumteams een AB Test alignment te houden. Een half uur waarin we iedereen kort de revue laten passeren. Wat staat er klaar om live te gaan, zien wij daar testen die potentiele interactie effecten ten opzichte van elkaar kunnen hebben. Dan constateren we die en kijken hoe wij daarmee om gaan. Welke richting wij daarin willen nemen. Het faciliteren van dat soort sessies om uiteindelijk te komen tot een punt dat het doen van experimenten en het uitvoeren van AB testen met zo min mogelijk frictie opgepakt kan worden door de teams. Een ander voorbeeld waar wij net een try-out van hebben gehad is om met een brede groep na te denken over optimalisaties van de features waar team X verantwoordelijk voor is. Waarbij team X ook bij die brainstorm sessie aanwezig is, maar een open invite stuurt naar onze afdeling (max. 15 mensen). Dan krijg je ideeen van mensen die normaal gesproken niet binnen dat domein werkzaam zijn. Om op die manier ook na te denken hoe we input kunnen geven aan de optimalisatie backlogs. En hen in gezamenlijkheid meer hypothese gedreven, naar die optimalisaties te gaan kijken en die proberen omhoog te krijgen. Zo zijn er vrij veel andere ideeen die wij nog niet ter uitvoer hebben gebracht. Wij zijn nog maar net deze route ingeslagen en hele leuke reacties op gekregen. we gaan ervoor om dit in ieder geval nog de komende maanden verder uit te bouwen en aan te scherpen hoe wij ons het beste richting die teams kunnen opstellen.</p><p>Guido: Krijgen mensen al een beetje de neiging om bij elke verandering op de website een AB test te doen of is het nog steeds een groot percentage dat gewoon wordt doorgevoerd?</p><p>Melle: Wat je ziet, wat wel prettig is, is dat niet 100% van de wijzigingen wordt doorgevoerd via een AB test. Niet zoals onze vrienden van Booking dat bijvoorbeeld doen. Je ziet wel dat het overgrote deel via een AB test live wordt gebracht. Soms lukt het niet om met de hoeveelheid traffic voor een bepaald segment een AB test statistische significantie te bewerkstelligen. Dan is het wel om te monitoren of wij niet een drop in conversie krijgen. Dan zie je wel dat we er steeds meer toe werken om veel features en appics live brengen in een AB test. Dat is alleen maar hartstikke fijn dat dat al redelijk tussen de oren zit.</p><p>Guido: Ton noemde vorige week ook al een conferentie van Facebook waar hij anderhalf jaar geleden was geweest, dat ze soms te weinig traffic hebben om een AB test te doen.</p><p>Melle: Het ligt maar net aan voor welk segment je een test bedenkt. Een voorbeeld van een klein segment die wij laatst live hebben gehad, was dat we constateerden uit een data analyse dat mensen die op onze winkelwagenpagina komen, een groot percentage nog eens in de header waar het winkelwagenicoontje staat, op klikken. In de control variant is dan dat je weer een redirect krijgt naar dezelfde pagina. De hypothese die we stelden was dat klanten wellicht de verwachting hebben dat ze direct doorgaan naar de checkout. Dat hebben we in de AB Test gedaan en dat was een heel klein segment aan bezoekers. Het heeft wel een conversiestijging van 1,6% opgeleverd. Daarin zie je dus wel dat naarmate je in een fijnmazige gebieden opzoekt om vanuit de analyses die je doet een suggestie voor verbetering te willen toetsen, je wel kritisch moet kijken of AB testen wel de meest geschikte manier is om met statistische zekerheid conclusies te trekken. In dit geval wel, maar het was wel een klein segment. Je ziet dat wij daar ook wel steeds meer naar toe gaan.</p><p>Guido: Hoe komen jullie aan input voor ideeen. Je zegt dat de hypothese was dat mensen verwachten naar de volgende stap te gaan, maar hebben jullie dat zelf bedacht of doe je ook gebruiksonderzoek?</p><p>Melle: In dit specifieke geval hebben wij de hypthese gemaakt op basis van de data analyse. We hebben die hypothese zelf gedestileerd uit dat stukje data. Daarnaast zie je dat binnen ons bedrijf om de twee weken gebruikerstesten worden uitgevoerd. Daar kun je ideeen voor indienen, zoals specifieke nieuwe features of prototypes of concepten. Daar proberen wij vanuit het CRO team ook vaak aansluiting te vinden en op die manier te kijken wat gebruikers doen op het moment dat wij met een camera op hen gericht bepaalde taken uitvoeren. Dat is ook een bron van waaruit wij putten om met nieuwe ideeen te komen.</p><p>Guido: Soms als je zo'n ding tegenkomt uit een data analyse, dan zie je inderdaad dat veel mensen erop klikken. Dan heb je de keuze of je eerst gaat uitzoeken waarom dat zo is met bijvoorbeeld een usability test en een labdag of zo. Je kunt ook een aanname doen dat mensen naar de volgende stap willen, gewoon door willen klikken, en wie weet werkt het wel gewoon. Dat is natuurlijk een stuk sneller. Die balans moet je altijd maken.</p><p>Melle: Die afweging moet je altijd maken natuurlijk. Het is altijd beter om meerdere databronnen ter ondersteuning te laten gelden voor het neerzetten van hypotheses. Dat is altijd de afweging en in dit geval gingen wij voor snelheid. Op het moment dat daar weer uitkomsten uitkomen die niet je hypotheses ondersteunen kun je altijd de stap zetten om er iets kwalitatiefs tegenaan te zetten.</p><p>Guido: Het is lekker dat jullie snel die experimentencyclus door kunnen. Hoe snel is dat nu? Hoe lang duurt voordat jullie resultaat hebben?</p><p>Melle: Dat ligt maar net aan de complexiteit van de variant die live gebracht moet worden. We hebben een aantal testsmechanismes beschikbaar op ons platform waarbij we geen resources van een developer nodig hebben. Op het moment dat we een hypothese hebben neergezet, kunnen we dezelfde dag die test live zetten. Bij andere testen hebben we een frontend developer die meedraait in het sprintritme van een van de frontend teams. Het is maar net afhankelijk van welk type testen het is. We hebben het geluk dat we bij veel testen een looptijd van twee weken kunnen hebben. In onze looptijdberekening komen wij vaak op een week uit, maar we hebben ervoor gekozen om als richtlijn de test in ieder geval twee weken laten lopen. Analyse die we op basis daarna doen in Adobe Analytics kunnen we redelijk snel uitvoeren. Een periode van drie weken zouden wij wel van inzicht uit de data naar testresultaten kunnen komen.</p><p>Guido: Hoe houden jullie het overzicht tussen al die testen die live staan, de ideeen die jullie hebben?</p><p>Melle: Ook wij maken gebruik van documentatietooling. Heel toevallig is dat effect of experiments, een van de sponsoren van jouw podcast. Het is van levensbelang voor het doen van optimalisatie om een goede documentatie te hebben om testen goed terug te kunnen vinden, te kunnen zien welke testen tegelijk lopen en hoe lang testen lopen. Daar zijn wij vanaf het begin af aan al heel nadrukkelijk mee bezig geweest om goed voor elkaar te krijgen. Voorheen deden wij dat in een Wordpress website en dat is verplaatst naar Confluence en momenteel gebruiken wij daar effect of experiments voor.&nbsp;</p><p>Guido: Voor de mensen die daar meer over willen weten is er een aflevering die ik onlangs live heb gezet. Dat is aflevering 18: effect of experiments in de praktijk bij Sanoma met Ruben de Boer. Je had het al over dat stakeholder niet het eerste was waarmee jullie begonnen. Hoe doen jullie dat nu. Hoe gaan jullie om met de resultaten van experimenten?</p><p>Melle: We proberen veel met engagement richting onze collega's te doen. We hebben een intern communicatie platform. Op het moment dat wij testen live zetten plaatsen wij altijd een poll: Which test will win? Daarin laten wij mensen stemmen op welke variant zij denken dat de winnaar gaat zijn van de test. Naderhand zorgen wij er ook voor dat de resultaten van die testen ook op die manier het bedrijf weer in slingeren.&nbsp;</p><p>Guido: Jullie optimaliseren de doelen van die productteams. Die hebben elk hun eigen doel en jullie faciliteren dat. Hebben jullie als CRO team dan ook bepaalde doelen? Hoe willen jullie groeien. Is dat het aantal experimenten dat jullie ondersteunen?</p><p>Melle: Wij zijn dit jaar de eerste aanzet aan het doen naar een meer faciliterende rol. Het doel zit daarin met name in het organiseren van brainstorm workshops, een vinger aan de pols houden rondom het AB test alignment.</p><p>Guido: Je wordt niet afgerekend op de omzetverbetering die jullie teweeg brengen?</p><p>Melle: Niet richting die andere teams, maar wij hebben zeker een omzettarget die wij zelf hebben afgegeven voor de testen die wij ook dit jaar nog doen. Dat is niet zozeer verbonden aan de hoeveelheid testen die wij doen, maar wij weten wel op basis van het aantal testen dat wij vorig jaar hebben gedaan en het succes wat wij hebben behaald, wat ons team moet zijn aan het eind van het jaar om onze target te halen. Dat zijn wel belangrijke inzichten en KPI's die wij continue in de gaten houden.</p><p>Guido: Een andere vraag, experimenteren jullie ook op het Marktplaats onderdeel?</p><p>Melle: Wij experimenteren eigenlijk op alle domeinen maar wat je ziet is dat we zeker wat optimalisatie testen gedaan die specifiek gericht zijn op ons Plaza platform assortiment. Je ziet wel dat we de grootste impact kunnen maken als wij ons richten op al ons assortiment en niet specifiek op onze Plaza assortiment. Wij zijn zeker continue aan het kijken met data analyses hoe wij ervoor kunnen zorgen dat wij ons platform nog interessanter maken voor externe verkopers en dat doen wij door de content en de features die zij kunnen aanbieden steeds verder te verbeteren.&nbsp;</p><p>Guido: Experimenteren jullie puur frontend wat consumenten kunnen zien of ook usability testen in de backend die bijvoorbeeld webwinkeliers zien?</p><p>Melle: We hebben naast de webshop een verkopersplatform. Daar zijn ook veel teams voor verantwoordelijk. Je ziet dat de behoefte steeds groter wordt om optimalisatie en AB testen uit te voeren. Aan die zijde komt redelijk wat verkeer en is er genoeg om op basis van AB testen kort cyclische verbeteringen in te gaan opzoeken. Je ziet wel dat die kant van ons bedrijf nog iets meer in de kinderschoenen staat.&nbsp;</p><p>Guido: De vraag van Marten hebben we misschien al een beetje beantwoord. Hoe doen jullie honderden AB testen dan specifiek zonder tussenkomst van IT?</p><p>Melle: Toen wij twee jaar geleden van start gingen en ons als doel hadden gesteld om honderd AB testen te doen in 2017 van mei tot december, constateerden wij al dat het waarschijnlijk lastig zou zijn om development tijd voor elkaar te krijgen bij een van de scrumteams. Dus laten wij eens gaan kijken naar de methodieken die wij beschikbaar hebben op ons platform, waarbij wij niet gebonden zijn aan het hebben van een developer voor het optuigen van onze testen. Daar hadden en hebben wij nog steeds een vijftal mechanismes voor die wij tot op heden nog steeds gebruiken. In 2017 konden we vrijwel alleen die gebruiken.</p><p>Guido: Wat zijn die mechanismes dan?</p><p>Melle: Dat is dat veel contentzaken zijn beschikbaar gemaakt in een contentmanagement systeem waar een AB test mechanisme op beschikbaar is. Dat kunnen testen met verschillende varianten van onze USP's die wij aanbieden op onze productpages. Het kunnen inriteren van CSS overright files, zodat je opmaakdingen op ons platform kunt doen. Daar heb je natuurlijk wel enige kennis van CSS voor nodig. Die hebben wij ook beschikbaar binnen het team zonder dat wij daar een developer voor nodig hebben. Het laatste is dat onze productpages zijn opgedeeld in allerlei blokken, sloten noemen wij dat. Bijvoorbeeld een review of recommendation slot. Die kunnen wij ook via ons CMS op verschillende plekken zetten. Dat zijn de mechanismen die al groot aantal jaar geleden beschikbaar zijn gemaakt om zonder tussenkomst van IT resources AB testen te kunnen doen.</p><p>Guido: De volgende stap is natuurlijk: wat moet er gebeuren om jullie op te schalen naar minimaal 2000 experimenten per jaar? Ik weet ook niet hoeveel jullie er nu uberhaupt doen.&nbsp;</p><p>Melle: Wat je ziet is dat binnen Bol.com zo'n zestig scrumteams zijn. Twaalf daarvan zijn gesitueerd in de afdelingen waarin ik werkzaam ben. Als wij alle zestig teams AB en optimalisatie testen kunnen laten uitvoeren, dan zijn we al een stap in de goede richting aan het gaan. Je ziet wel dat daar waar wij nu met name nog frontend georienteerde testen doen en testen met recommendations, wij vanuit backend nog wel veel meer testen zouden moeten initiëren. Dus op een aantal fronten zou je daar een opschaling kunnen en moeten doen op het moment dat je naar 2000 testen per jaar toe gaat werken.</p><p>Guido: Dus als elk van de 60 teams drie experimenten per maand doet, dan ben je er al. Dan klinkt het ineens niet zoveel meer toch? Waar hopen jullie over een paar jaar te staan. Jullie zijn lekker aan het groeien, die volwassenheid en CRO mindset aan het overbrengen naar alle frontend en backend teams. Waar hoop je te staan over 2/3 jaar?</p><p>Melle: Wij zijn momenteel toe aan het werken naar onze eigen experimentation tooling, zodat wij alle losse elementen in het AB testproces bundelen in een tooling. Dat is iets waarvan ik hoop dat over een aantal jaar wij volledig alle AB testen via die route uitvoeren. Anderzijds vind ik het streven van 2000 testen per jaar een hele mooie. Ik zou het supergaaf op persoonlijke titel dat de route die we nu aan het inslaan zijn in het faciliterend zijn richting de 12 scrumteams binnen het shoppingplatform, uiteindelijk samen met die teams naar het totaal van 60 te gaan. En het op die manier als een olievlek te kunnen gaan verspreiden binnen Bol.com. Dat lijkt mij wel een mooi doel om na te streven voor over een aantal jaar.</p><p>Guido: Jullie zijn je eigen platform aan het bouwen. Wat zijn de beperkingen van de beschikbare platforms. Waar lopen jullie tegen aan dat jullie die niet kunnen gebruiken? Dat lijkt mij een forse investering.</p><p>Melle: Dat is zeker een forse investering, maar wij denken daarin toch wel aan de lange termijn. Daarnaast willen wij volledige controle houden over alle data die wij tot onze beschikking hebben, zodat wij richting onze klanten de waarborg kunnen dienen dat wij op de meest zorgvuldige manier met data omgaan die wij op ons platform gebruiken om uiteindelijk de gebruikservaring te verbeteren. Als je daar meer informatie over wilt hebben, dan wil ik je zeker uitnodigen om mijn collega Denise Visser eens in het cafe te ontvangen. Zij is momenteel productmanager experimentation en is de aangewezen persoon om ervoor te zorgen dat de experimentation tooling ook het daglicht kan zien.</p><p>Guido: Mooie uitdaging, leuk. De laatste vraag die ik eigenlijk aan veel gasten stel: waar haal jij je inspiratie vandaan?</p><p>Melle: Ik probeer veel boeken te lezen over het onderwerp, productmanagement, UX. Daarnaast struin ook ik wekelijks mijn RSS feed af met blogs over het domein en vakgebied. Dat zijn toch wel de dingen die voor mij het belangrijkste zijn. Hier en daar probeer ik wel een conferentie mee te pakken, maar over het algemeen vind ik het leuk om zelf een verhaal te komen houden dan er een bij te wonen.</p><p>Guido: Van een presentatie leer je ook weer veel, toch?</p><p>Melle: Zeker weten. Dat vind ik alleen maar leuk en uiteindelijk zorgt het er ook voor dat je steeds meer mensen uit je vakgebied te spreken komt. Die geinteresseerd zijn om nog eens iets te horen nadat je een verhaal hebt gehouden. Alleen maar hele leuke extraatjes om uiteindelijk weer meer inspiratie op te doen in het vinden in het zien en vinden van verbeteringen binnen je eigen platform.&nbsp;</p><p>Guido: Precies. En goed om te horen dat er nog meer oude rotten in het vak zijn die er RSS gebruiken.&nbsp;</p><p>Melle: Zeker weten.</p><p>Guido: Het doet mij nog steeds een beetje pijn dat Google Reader dood is.&nbsp;</p><p>Melle: Feedly is mijn read of choice.&nbsp;</p><p>Guido. Die van mij ook. Melle, dankjewel. Superleuk dat je de tijd hebt genomen om hier wat vragen te beantwoorden. Kunnen wij jou binnenkort nog ergens zien? Heb je al een nieuwe spreeksessie op de rol staan of?</p><p>Melle: Binnenkort heb ik voorlopig even niet staan. Ik vind het prima hoor. Zo kan ik mij 100% focussen op mijn team binnen Bol.com. Dus dat vind ik geen straf.</p><p>Guido: Hartstikke goed. Dankjewel.</p><p>Melle: Graag gedaan.&nbsp;</p>",
  "show_notes": "<p>In deze aflevering van het CRO CAFE praat ik met Melle Moorman, Product owner Persuasion binnen de - volgens hemzelf - gaafste afdeling van bol.com, genaamd het Shopping Platform. Hij heeft bij bol.com het eerste CRO team opgezet en is tot op heden lead van dat team. Hoe hij dat heeft opgezet, waar ze nu staan en wat hun ambities zijn is waar ik hem vandaag over aan de tand ga voelen.</p><ul><li><a href=\"/podcast/effective-experiments-in-de-praktijk-bij-sanoma\">Aflevering met Ruben over Effective Experiments</a></li><li><a href=\"/podcast/validation-in-every-organization\">Aflevering met Ton over Validation in every organization</a></li></ul>",
  "guests": [
    {
      "id": "melle-moorman",
      "name": "melle-moorman",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "nl",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/het-cro-team-van-bolcom.jpeg",
  "language": "nl",
  "type": "podcast"
}