{
  "id": "hoe-leer-je-iemand-om-te-programmeren",
  "title": "Hoe leer je iemand om te programmeren?",
  "description": "In deze bonusaflevering - live opgenomen op het Marketing Insights Event (#MIE20) - hebben we het over hoe je kinderen en studenten leert programmeren, Data Sci",
  "date": "2025-01-08T20:07:07.532Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/3aed45d8/970d301f.mp3",
  "transcript_url": "",
  "show_notes": "<p>Felienne is universitair hoofddocent bij het Leiden Institute of Advanced Computer Science (LIACS) van de Universiteit van Leiden, waar ze de PERL-groep leidt die onderzoek doet naar programmeren voor iedereen. </p><p>Op zaterdagmiddag geeft Felienne programmeerlessen aan kinderen. Ze is een van de organisatoren van de CurryOn conferentie, die als doel heeft om het bedrijfsleven en de academische wereld dichterbij elkaar te brengen. Van 2012 tot 2018 organiseerde ze de Joy of Coding-conferentie. Felienne is host van de SE-radio podcast, een van de populairste podcasts over software op het web. Als ze niet aan het programmeren, bloggen of lesgeven is, dan is ze vast aan het breien, aan het hardlopen of een bordspelletje aan het doen.</p><ul><li>‍<a href=\"https://www.mie.nl/\" target=\"_blank\">mie.nl</a></li><li><a href=\"https://www.mie.nl/\" target=\"_blank\">‍</a><a href=\"https://www.felienne.com/\" target=\"_blank\">Felienne.com</a></li><li>Publicatie: <a href=\"https://dl.acm.org/doi/abs/10.1145/3287324.3287358\" target=\"_blank\">Early Programming Education and Career Orientation: The Effects of Gender, Self-Efficacy, Motivation and Stereotypes</a></li></ul>",
  "guests": [
    {
      "id": "felienne-hermans",
      "name": "felienne-hermans",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "nl",
      "type": "guest"
    }
  ],
  "youtube_url": "https://youtu.be/MWQf3TcQaIU",
  "main_image": "src/assets/images/episodes/hoe-leer-je-iemand-om-te-programmeren.jpeg",
  "language": "nl",
  "type": "podcast"
}