{
  "id": "luister-naar-je-klanten-weet-je-eigenlijk-wel-wat-ze-nodig-hebben-met-marieke-schulte-digital-power",
  "title": "Luister naar je klanten: weet je eigenlijk wel wat ze nodig hebben?",
  "description": "Leer meer over Social Listening (een methode voor het analyseren van klantbehoeftes) en zie hoe non-profit RNW Media dit gebruikt om engagement te verbeteren.",
  "date": "2025-01-09T14:26:30.811Z",
  "duration": 1861,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/d49da350/c1145a82.mp3",
  "transcript_url": "",
  "show_notes": "<p>Listening to your customers: do you know what they really need? - In today’s rapidly changing society, it’s crucial to stay up to date on your customers’ needs. When you tailor new products to (predicted) trends instead of measuring customer satisfaction in hindsight, you’re always one step ahead. In this session, we’ll dive into social listening, a method for analyzing your customers’ needs, and see how our non-profit client RNW Media used it to support the advocacy work of other Sexual and Reproductive Health and Rights organizations.</p><p>Het <strong>Digital Analytics Congres</strong> 2019 vond plaats op 8 oktober 2019 in de Jaarbeurs in Utrecht en wij deden live verslag vanaf de conferentie. Meer over het congres kun je vinden op <a href=\"https://www.digitalanalyticscongres.nl/\">https://www.digitalanalyticscongres.nl/</a>.<br><br>DAC19 werd georganiseerd door het Expertise Center voor Marketing Insights, Onderzoek en Analytics beter bekend als <strong>MOA</strong>. Meer daarover kun je terugvinden op <a href=\"https://www.moaweb.nl/\">https://www.moaweb.nl/</a>.</p>",
  "guests": [
    {
      "id": "marieke-schulte",
      "name": "marieke-schulte",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "nl",
      "type": "guest"
    }
  ],
  "youtube_url": "https://youtu.be/NC9zTGnJ50w",
  "main_image": "src/assets/images/episodes/luister-naar-je-klanten-weet-je-eigenlijk-wel-wat-ze-nodig-hebben.jpeg",
  "language": "nl",
  "type": "podcast"
}