{
  "id": "redesign-bij-fonq",
  "title": "Redesign bij fonQ",
  "description": "Vandaag praat ik met Jurrien Schouten, CRO en UX lead bij fonQ in Utrecht en wij gaan het o.a. hebben over het valideren van een nieuwe huisstijl.",
  "date": "2025-01-08T20:07:07.531Z",
  "duration": 0,
  "audio_url": "https://chtbl.com/track/D992D/media.transistor.fm/ea22c4bc/cf790ba8.mp3",
  "transcript_url": "<p>Guido: Ja Jurrien echt leuk dat ik jou in het café mag ontvangen, en je bent maar liefs 8 jaar al werkzaam bij fonQ, dat is best wel lang in onze industrie en ik ben wel benieuwd hoe dat in al de jaren tot je huidige rol als CRO en UX lead heeft geleid.&nbsp;<br> <br>Jurrien: Ja nou dat kan ik wel even uitleggen. Als eerste dankjewel voor deze uitnodiging in je altijd gezellige café, als ik hoor hoe gezellig het er altijd is dan wil ik daar graag deel van uitmaken.&nbsp;<br> <br>Guido: Ja, bijdeze.&nbsp;<br> <br>Jurrien: Dankjewel. Ik ben tijdens mijn stage, in mijn studententijd, bij MailOrder Solutions, dat was in 2010. fonQ was toen nog niet zo heel bekend, sterker nog, het merk bestond niet. En ik heb eigenlijk, toen leerde ik pas e-commerce voor het eerst kennen. En dat was in de tijd dat MailOrder Solution nog niches op zat. En daar ben ik op de online marketing afdeling terecht gekomen. Daar heb ik eigenlijk voor het eerst het vak leren kennen, dus CO, CA, en na een tijdje heb ik daar een contract gekregen verantwoordlijk voor diverse niche shops. En daar de advertising voor gedaan maar dat was uiteindelijk niet mijn passie, ik heb digitale communicatie gestudeerd in Arnhem en mijn passie was altijd optimaliseren van het platform zelf. En na een jaar of vijf heb ik de mogelijkheid gekregen bij fonQ om dat te gaan doen. Dat was ook het moment dat we van Mail Order Solutions naar het merk fonQ gingen. En daar was niemand voor convert optimalisatie voor en in Nederland had het al wat meer bekendheid maar bij fonQ was er niemand die dat deed dus die kans heb ik gekregen en die heb ik met beide handen aangegrepen, ik heb dat een jaar of vijf gedaan en ik ben in het begin geholpen door Google. Jordan Lance heeft mij de eerste stappen leren..hoe noem je dat, aan de hand genomen eigenlijk.&nbsp;Super waardevol en in een jaar heel veel geleerd en hij wat hij mij het meest geleerd heeft is zorgen dat het een duidelijk proces is. Dat je heel snel waarde creëert voor wat je doet want collega's gaan waarschijnlijk niet direct de meerwaarde ervan zien. De samenwerking met Jordan heeft een jaar geduurd en toen heb ik het zelf opgepakt, dat heb ik een jaar of drie gedaan en sinds vorig jaar april de kans gekregen om een klein team op te bouwen bij fonQ waar we CRA met zijn drieën doen en is het een continue proces van optimalisatie. Dat is de status van hoe het er nu voor staat.&nbsp;<br> <br>Guido: Ja ik probeer Jordan al een tijdje te stikken voor de podcast maar ja, booking en legal en zo. Gaat nog even duren denk ik, maar het komt vast wel. Hij wilt vooral over de dood van de hamburger menu hebben volgens mij.&nbsp;<br> <br>Jurrien: Ja daar begon ie toen ook al mee inderdaad.&nbsp;<br> <br>Guido: Ja precies. We spraken elkaar al eerder in deze podcast, jij was ook bij e-mmerce live waar we een uitzending deden en daar vertelde je ook dat bij fonQ, jouw werkzaamheden vallen onder het product team. Bij de meeste bedrijven, volgens mij is er zelf een poll op de facebook groep voor CRO café.. waar vallen CRO werkzaamheden bij jou in t bedrijf. Of als je bij een agency zit, waar valt het bij de meeste klanten, en veruit is de meest populaire antwoord dan marketing. Das bij jullie dus anders, kan je daarover vertellen?&nbsp;<br> <br>Jurrien: Het is niet helemaal waar, het is namelijk ook zo, product team valt dus ook onder marketing. Dus een onderdeel van de marketing afdeling staat daar om de performance, communicatie, dat stukje brand en product en UX, dus drie verschillende pijlers en product team is eigenlijk één pijl daarvan, en wij zijn een klein team met zes leden, twee product owners, ik als lead, we hebben nog een junior conversie specialist en een {} designer. Met dat team van zes zijn we we verantwoordelijk voor de hele platform van heel fonQ. Dus dat is best wel klein team met veel verantwoordelijkheden, zeker een uitdaging.<br> <br>Guido: Maar de meeste product teams zijn behoorlijk gefocust op functionaliteit en technische ontwikkeling van iets. Het product team wat jij omschrijft klinkt heel erg als een CRO team.&nbsp;<br> <br>Jurrien: Dat wil ik graag zo uitdragen, ik ben daar wel een beetje tegen, we zijn ook heel erg veel bezig met het ondersteunen van de complexe projecten. Wij moeten bijdragen aan de business doel stellingen. Maar sinds een jaar, sinds de start proberen we altijd tijd te reserveren voor pure {} improvements die we ook als inzicht van klanten willen hebben. Voor de beeldvorming, het is altijd wel werk om.. de CRO team werkt op twee niveau's: improvements, en projecten waarbij de product owners, de andere kant van de products team ook nog een stuk onderhoud met ze meedragen.<br> <br>Guido: Oke en jullie hebben een bepaald budget bij development om dat uit te voeren?<br> <br>Jurrien: Ja, development is extern, en in principe is dat op boekjaar basis een vastgesteld budget maar daar hebben wij geen directe omkijk naar. Er is altijd ruimte voor improvements, het gaat meer om de tijd die we hebben gereserveerd voor de improvements die we willen.&nbsp;<br> <br>Guido: Ja oke, en voor context, wat zijn de andere teams bij fonQ waarmee jullie moeten samenwerken? Als het gaat om CRO.<br> <br>Jurrien: Dat is een goede vraag, wat wij nu vooral proberen te doen is de kennis die wij hebben proberen weg te zetten bij de andere teams. Direct hebben we heel veel contact met de andere marketing teams dus performance marketing, campagnes, stellen we op klant inzicht uit. Als we bijvoorbeeld nieuwe campagnes online zetten zit daar best wel wat snelheid achter. En vanuit mijn team proberen we daarom bij te dragen om ervoor te zorgen dat we de campagnes testen, de beste manier vinden om ze online te zetten. Binnen marketing teams waar we veel mee samenwerken, verder in het bedrijf heb je een stuk {} merchandising, dat zijn een paar teams, die zijn vooral verantwoordelijk voor de customer journey van de specifieke product team zeg maar. En daar zit dan geen conversie specialist in maar wel een merchandisers. En die proberen vanuit CRO en UX klanten inzichten te voeden maar ook te helpen met het ophalen van klant inzichten zodat zij bijvoorbeeld customer journeys kunnen opbouwen voor iemand die een bank of een stoel koopt.&nbsp;<br> <br>Guido: Ja en schuiven die mensen ook weleens aan voor productontwikkeling bij jullie?&nbsp;<br> <br>Jurrien: Jazeker, dat zijn ook wel teams die invloed leveren op de dingen die we moeten ontwikkelen. We weten bijvoorbeeld dat als je een bank koopt is het zitcomfort heel belangrijk. Samen met de betreffende merchandiser gaan we dan bedenken hoe kunnen we iets ontwikkelen waardoor we zitcomfort beter uit kunnen leggen op de website. De lastigheid daar zit in wel dat, we zijn één team verantwoordelijk voor alles en je wilt één probleem oplossen, maar is dat misschien te weinig impact die je gaat doen. Dus de uitdaging is hoe kunnen we dat soort oplossingen zo generiek mogelijk maken zodat de andere teams ook weer daar wat aan hebben.&nbsp;<br> </p><p>Guido: Maken jullie gebruik van een bepaald model om te prioriteren of..?<br> <br>Jurrien: Ja we hebben twee verschillende modellen eigenlijk, één voor de improvements die we doen, daar prioriteren we meer op business gericht pijlers bijv. een lange termijn strategie, direct conversie, hoeveel draagt het bij aan de data waarmee we werken, dat zijn een aantal pijlers die we gebruiken. En als je het hebt over de pijlers die we puur voor onze eigen optimalisaties gebruiken, onze AB test proces, een geavanceerde zelf ontwikkeld variant van de test.&nbsp;<br> <br>Guido: Een funnel model?&nbsp;<br> <br>Jurrien: Exact.&nbsp;<br> <br>Guido: We hadden een tijdje geleden ook een podcast met Ton Wesseling van Online Dialogue en een belangrijk onderdeel was dat je niet zo zeer als CRO team, dat begint vaak met een persoon, die maniac die hierin gelooft aan de slag gaat en dan bouw je een team maar op een gegeven moment wat je eigenlijk wil is dat iedereen dat experimenteren gaat omarmen en ook dat bleek uit die facebook poll van vanmorgen, niet alleen waar zit CRO in jouw bedrijf maar zou het moeten zitten, en daar is overal het antwoord 'bij het hele bedrijf.' En dat is volgens mij iets waar jij mee bezig bent, toch? Hoe pak je dat aan?&nbsp;<br> <br>Jurrien: Ja waar begin je? Ik heb al meerdere keren geprobeerd om verschillende methodes te gebruiken, maar wat het meest effect heeft is beginnen bij waar je allemaal voor doet en dat is de klant. Samen met mijn team zijn we vorig jaar gestart met heel eenvoudig user tests te organiseren en faciliteren, dus zelf hebben het proces gestart, mensen uitgenodigd via een poll op de bedank pagina. Er kwam super veel respons op en mensen zijn voor een giftcard van vijftig euro wel bereid om mee te doen aan user tests bij ons op kantoor.&nbsp;<br> <br>Guido: Ja in de vorige aflevering zei je dat er een paar honderd mensen kwamen in een paar dagen op af, toch?&nbsp;<br> <br>Jurrien: Ja dat zeker, ook in Utrecht dat er allemaal mensen die wat verder willen reizen. En het grappige daarvan is dat we de poll hebben kunnen optimaliseren omdat de communicatie ging verkeerd of mensen hadden verwacht dat het iets anders was. Maar door de klanten echt in huis te halen en ook letterlijk in het bedrijf in één van de vergaderruimtes creëerden we gewoon draagvlak voor de problemen die klanten eigenlijk ervaren op het platform. En zelfs de kleine dingetjes die wij al lang niet meer zien, die voor sommige klanten super frustrerend zijn die kan je dan veel makkelijker neerleggen ook bij verschillende {} dus. We hebben ook de hele bedrijf uitgenodigd. Dat was eigenlijk de eerste stap die ik heb gedaan, zorgen dat de bedrijf kennis maakt met daadwerkelijk klant en beter snapt wat verschillende problemen zijn waar ze meelopen en dat hebben we ook nog een vervolging gegeven door een customer insight mailtje sturen, een soort interne nieuwsbrief. Met de verschillende insights die we hebben opgedaan uit dit user test maar ook de AB testjes die we hebben gelopen. En als laatste hebben we een slack ingezet bij onze interne communicatie kanaal met een 'Which Test Will Win\" slack groep en daar konden mensen stemmen op welke test variant zij denken dat heeft gewonnen, hebben we een soort ladder competitie van gemaakt en diegene die het wist kreeg het \"Ik weet het ABeter\" test bokaal. Dus het was meer zichtbaar, je kon een mooie prijs winnen. En die zichtbaarheid heeft er wel voor gezorgd dat mensen beter gingen nadenken over hoe de klant de website ervaart.&nbsp;<br> <br>Guido: En Jurrien laat maar raden, de winnaar van de \"ik weet het ABeter\" test bokaal die kwam zeker niet uit het product of marketing team?<br> <br>Jurrien: Nee. Klantenservice.&nbsp;<br> <br>Guido: Ja ik wou het niet zeggen maar dat verbaast me niks.&nbsp;<br> <br>Jurrien: Ja nee zeker het grappige daarin is ook dat er mensen zijn die als je ze wat meer activeert hebben ze hele goeden ideeën hebben en dat is niet grappig, maar dat geeft ons meer een soort van idee dat we moeten vaker de mensen laten spreken.&nbsp;<br> <br>Guido: Ja het is voor mensen bij de klantenservice vaak ook lastig om mee te denken van hoe groot een probleem nou is en ze komen dingen wel vaker tegen maar denken \"dat kunnen we niet veranderen, dat is gewoon zo.\" Terwijl als jij ernaast zit dat je denkt \"ja maar wacht even dit is iets wat we binnen twee uur gefixt kunnen hebben en dan krijg jij die vraag nooit meer.\"&nbsp;<br> <br>Jurrien: Precies. De uiteindelijke doel was wel zoveel mensen zelf experimenten te laten draaien op de platform. Maar je hebt ook te maken met als je heel specifiek naar een producten groep bekijkt, hebben ze kleinere sample sizes waardoor dat testen wat lastiger wordt. Wat dat betreft kan je veel meer impact doen met de klant inzichten naar de juiste mensen toe leiden en ook laten zien hoe makkelijk het is om dat te doen.&nbsp;<br> <br>Guido: En wat was de ding van wat je net genoemd hebt, wat heeft het meest en minst impact zeg maar? Wat zorgt ervoor dat het niks levert?&nbsp;<br> <br>Jurrien: User tests organiseren en iedereen daaraan te laten werken heeft natuurlijk het meeste impact omdat je dan letterlijk door de website ziet gaan en het gedrag ziet en ook erover praat met zijn alle.&nbsp;<br> <br>Guido: Is het dan live als je mensen uitnodigt of krijgen ze een filmpje achteraf?&nbsp;<br> <br>Jurrien: We nodigen iedereen uit en dat is het inderdaad gewoon bijwonen dus bijwonen en mee noteren, notuleren wat je ziet. Achteraf delen we de filmpjes niet, tenminste de team die presenteert deelt dan wel de belangrijkste insights met iedereen, die op kantoor aanwezig kon zijn. Dat doet wel meest impact maar het is aan de andere kant is het ook het meest intensief om te organiseren maar het is super waardevol voor klanten inzichten.&nbsp;<br> <br>Guido: En wat had het minste impact waarvan je dacht van..<br> <br>Jurrien: Ik denk de AB bokaal omdat het gewoon een fun element is en meer de spel element toevoegen aan het strategie. Maar als je daarmee mensen echt laat testen.. niet echt. Het is allemaal best wel korte termijn insights.&nbsp;<br> <br>Guido: Jullie hebben afgelopen tijd een project gedaan qua rebranding van de website. Daar waren jullie ook bij betrokken. Ik ben wel heel benieuwd hoe jullie dat hebben aangepakt.&nbsp;<br> <br>Jurrien: Ja we wilden weten, wat we meekregen was dat onze {} verouderd was van reactie van de doelgroep. Dus we wilden een meer vrouwelijke kleur laten draaien op ons platform. De kleurkeuze, en het gevoel van brand identity daar zijn we niet bij betrokken maar toen eenmaal het concept lag hebben wij last minute dat concept kunnen meepakken in de user tests. Dus dat was oude design versus nieuwe design subtiel {} bij de klanten. En het grappige daar aan was, tuurlijk zijn er wel een paar mensen die wat zeggen, dat je echt.. de mannen die zeiden allemaal \"ik vind het helemaal niks de nieuwe stijl die er ligt, veel te vrouwelijk voor mij.\" Terwijl de vrouwen, vrouwelijke klanten heel positief waren over de nieuwe stijl.&nbsp;<br> <br>Guido: De meeste experimenten die ik heb gedaan, bijzonder weinig mannen-vrouwen verschil maar wel grappig om dat te zien.<br> <br>Jurrien: Ja het zijn natuurlijk maar een paar klanten maar het is wel een rigoureuze kleurwijziging geweest van blauw naar warm sunset zoals we dat noemen<br> <br>Guido: Je had het daar inderdaad over die kleur, ik had opgezocht, we zitten natuurlijk in een podcast, de mensen kunnen de kleuren niet zien, ik had het opgezocht en de kleuren die ik tegenkwam die heten burnt sienna, cinnabar, en abrikoos, dan weet je dat ook. Is de kleur die enige die jullie getest hebben met de nieuwe design? Of zijn er wel meerdere dingen aangepakt?&nbsp;<br> <br>Jurrien: Het is een heel groot project geweest. Er zat best wel wat snelheid achter dus we hebben de header ook kunnen AB testen, de oude header versus de nieuwe header en daar zag je dat de nieuwe header gewoon veel beetje aansloot bij onze doelgroep dus dat is wel mooi. Verder hebben we best wel veel subtiel wil ik niet zingen, veel UA dingen moeten aanpassen en dat project loopt nog steeds. En daar ook proberen we alles te testen om te zien of het geen conversie problemen oplevert.&nbsp;<br> <br>Guido: Jullie hebben tijdens die switch vast wel wat {} in gaten gehouden, ging dat goed? Of ging het om hoog allemaal of bleef het allemaal gelijk?&nbsp;<br> <br>Jurrien: Ja we hebben het iteratief gedaan zeg maar, de grootse gedeelte is allemaal in stand gebleven. EN voor de header, dat is de grootse wijziging geweest, daar zagen we een positieve stijging. Ik ben nog wel bezig geweest om inderdaad het stukje kwalitatief klant onderzoek door te trekken naar meer kwantitatief klant onderzoek bij verschillende merchandising teams. En wat we daar eigenlijk zien is dat we heel veel hebben opgebouwd en dat we hebben duizend verschillende producten en honderden verschillende product groepen. Dat is heel generiek maar dat wilt niet zeggen dat de specifieke journeys dat daar een oplossing is. Dus gingen we kijken van hoe kunnen we nou voor specifieke customer journeys de product pagina's optimaliseren en dat gaat van onderzoeken aanzetten op product groepen als stoelen en dan aan de klant vragen van wat is de grootse zorg bij de aanschaf van een stoel. Nou daar komen insights out en dat is geniaal. Daar kan je de business zoveel mee voeden, dat zijn misschien een beetje open deuren maar anders denk je \"ja hoezo hebben we hier geen oplossing voor bedacht?\"<br> <br>Guido: Als het een open deur is maar blijkbaar word er niks mee gedaan dan blijkbaar was het niet zo een open deur.&nbsp;<br> <br>Jurrien: Exact ja. Mensen gaan vaak mee met de dagelijks gang van zaken waarvan ik denk ja als je nou hier meer tijd in steekt dan kan je daar een lange termijn oplossing bedenken waardoor je er veel meer uithaalt. Maar bijvoorbeeld een test die we gedaan hebben, we merkten dat voor stoelen zitcomfort super belangrijk is, we hebben heel veel stoelen, maar hoe ga je zitcomfort uitleggen op de site? En ze willen zelf ervaren wat nou lekker zit of niet. Dus hebben de data uit de reviews gebruikt om te kijken in hoe verre een stoel voldoet aan zitcomfort en hoeveel sterren, we hebben die data gebruikt nog een keer voor een AB test waarbij we zeiden dat andere klanten die het hadden gekocht het 'zeer prettig' qua zitcomfort beoordeelden, dus dat was een klein stukje tekst boven de stoelen op de site. We dachten super goed idee, super relevant, en je gaat hier een probleem oplossen, en uiteindelijk maakte het niet zoveel uit, qua conversie zagen we helemaal geen verschil. Dat is ook super grappig want je denkt super goed idee maar in the end, ja, mensen vinden dat waarschijnlijk toch wel denk je dan.<br> <br>Guido: Ja of dat het niet, dat heb je ook heel vaak dat je een probleem ziet en dan verzin je een oplossing maar die oplossing, de probleem is er nog steeds maar die oplossing die je net bedenkt heeft geen impact. Zitcomfort is nog steeds belangrijk maar dat is dan net niet de manier om het over te brengen of dan valt het niet op.&nbsp;<br> <br>Jurrien: Ja dus ze zijn alweer bezig om andere ideeën te ontwikkelen om het op te lossen. <br>Guido: Ja mooi, dus je hebt draagvlak gecreëerd om het zitcomfort duidelijker te maken. <br> <br>Jurrien: Ja met een heel eenvoudig klant onderzoekje via Hotjar.&nbsp;<br> <br>Guido: Nice, je hebt ook een experiment gedaan samen met campagne team.<br> <br>Jurrien: Ja dat is ook een beetje wat we erin willen slijpen zeg maar, als je een campagne voert die zijn vaak best wel kort, of relatief kort, maar je hebt {} verkeer over die pagina's heen alleen wat wij merken hier is dat we best wel snel campagnes live zetten en vanwege de snelheid en druk, is dat we eigenlijk nooit kijk naar wat de prestaties zijn tijdens de campagne van het betreffende uiting of na de campagne. Dus daar proberen we de effect op te vergroten, dus wat we hebben gedaan is bijvoorbeeld is op een campagne die we op maandagochtend online zetten is dan iets zetten op de homepage maar wel gebaseerd op een hypothese zodat we die learning kunnen behouden. We hadden een hypothese dat we duidelijker moesten inspelen op de hoeveelheid producten die in aanbieding zat dus uit mijn hoofd, tot 40% korting op twee duizend producten of zo en die hoeveelheid die wij bedacht hadden, hadden we expliciet genoemd alleen werd er veel minder op geklikt dus dat was ook weer grappig want dan heb je een hypothese bedacht en dan heeft het campagne team een fijne tijd maar dat zijn wel..het kan ook de andere kant op werken en als je dat te pakken hebt heeft dit super veel waarde voor de rest van de campagne.<br> <br>Guido: Het is belangrijk om te valideren dat de mensen zoals jij en ik die hier dagelijks mee bezig zijn ook allemaal hypotheses bedenken en dan voer je het uit en denk je oh shit.&nbsp;<br> <br>Jurrien: Ja dat weet ik inmiddels wel, als mensen vragen hoe het gaat werken, ja geen idee! Ik geloof er niks meer van.&nbsp;<br> <br>Guido: Ja je moet wel sterk in je schoenen staan als CRO specialist want continu word je eigen hypothese onderuit gehaald.&nbsp;<br> <br>Jurrien: Ja nou goed, het gaat om het proces en het feit dat je kan experimenteren en zolang je een goede hypothese hebt dan leer je er altijd wat van denk ik. En soms werkt het en sta je een stuk beter op je schoenen.<br> <br>Guido: Ja, dan ben je de held.&nbsp;<br> <br>Jurrien: Precies.<br> <br>Guido: Maar ja dat is ook maar het topje van de ijsberg, de rest van de werk zien ze niet. Maar het is wel belangrijk om bij dat topje te komen inderdaad, dat je een goede basis hebt. Wat is het lastigst onderdeel van het werk?&nbsp;<br> <br>Jurrien: Zoals ik zei, we zijn een klein team en we hebben heel veel ballen die we in de lucht moeten houden, alle improvements die we moeten doen over het platform die moeten we prioriteren alle projecten die we doen, daar moeten we tijd voor reserveren. En eigenlijk is dat enerzijds goed dat er zoveel input komt vanuit de organisatie, het is een uitdaging maar het is ook wel een goed teken dat mensen of collega's de meerwaarde in zien wat je doet. Maar het zorgt wel voor dat we steeds strenger moeten prioriteren en eigenlijk veel meer tijd kwijt zijn aan het prioriteren zelf ipv voor de klant echt optimaliseren. Dus de grootse uitdaging is eigenlijk: hoe kunnen we ervoor zorgen dat nog steeds we de meeste impact doen met de dingen die we doen waarbij we ook niet de klant uit het oog verliezen. En de uitdaging is ook zorgen dat iedereen of tenminste de organisatie zelf ook durft te experimenteren, zeker als je verantwoordlijk bent voor de specifieke customer journeys op producten groepen. Dan heb je zoveel mogelijkheden, en je moet altijd je content opbouwen, als je daar goed over nadenkt dan kan je ook met de kleine kussentjes impact doen. Dat is niet meteen te AB testen, maar je kan kijken of je met een wijziging vooruit ging.&nbsp;<br> <br>Guido: Doen jullie aan personalisaties? Of one size fits all?&nbsp;<br> <br>Jurrien: Het is redelijk one size fits all, we hebben wel wat logica en personalisatie erop zitten maar het gaat niet verder dan een paar horizontale product siders waar er een paar gepersonaliseerde producten op staan op basis van je eerdere bezoek.&nbsp;<br> <br>Guido: Lijkt me ook heel lastig want als ik op jullie website kijk. Ik heb ook bij emergent gewerkt in de gifting group, ik denk dat jullie ook wel een redelijke bezoek krijgen van mensen die iets aan iemand anders willen geven, het is een ontzettend lastige doelgroep om te personaliseren want als je iets moet kopen voor iemand anders dan ja.&nbsp;<br> <br>Jurrien: Die kant heeft minder prioriteit bij ons, we focussen op de wonen segment. Maar zeker in de cadeau periode, einde van het jaar, dan wordt die doelgroep wel belangrijk.&nbsp;<br> <br>Guido: Jullie hebben tuinmeubelen, verlichting, keuken, en tafelen, stoelen, dat is allemaal wonen maar dat zijn ook allemaal dingen die ouders aan hun kinderen willen geven toch?&nbsp;<br> <br>Jurrien: Dat hoop ik wel ja.&nbsp;<br> <br>Guido: Of omgekeerd. Genoeg gifting opportunities zijn er.&nbsp;<br> <br>Jurrien: Ja dat blijft sowieso lastig, dus we hebben wat kleine dingen voor personaliseren online maar een volledig strategie dat weten we gewoon niet.&nbsp;<br> <br>Guido: Je noemde net al Hotjar, ik ben wel benieuwd wat voor tools gebruiken jullie allemaal in jullie proces?&nbsp;<br> <br>Jurrien: We gebruiken voor de client site AB testing, dat is in principe AB tests zelf die we daar doen, we hebben wel een frontend developer maar dat is een extern bureau, die kunnen ons wel helpen maar we hebben een hele handige product owner die super technisch is dus die kan ook onze AB testjes schrijven. Verder Hotjar gebruiken we veel, we gebruiken dat ook veel in combinatie met Javascript triggers. Op basis van de data kunnen we heel precies targeten op de juiste producten dus daar kunnen we heel veel relevante informatie uit halen en dat is het eigenlijk, Google Analytics natuurlijk standaard analytics pakket, voor user tests gebruiken we lookback.io ook een hele handige tool om tijdens de user tests te notuleren.&nbsp;<br> <br>Guido: Je doet ook video recording? Ik heb zelf nooit gebruikt.&nbsp;<br> <br>Jurrien: Ja video recording en je kan dus inderdaad tijdens de user tests als je een comment plaatst wordt dat getimestamped. Dus je weet precies wanneer iemand wat gezegd heeft.&nbsp;<br> <br>Guido: Oh ja, gaan we naar kijken. Ik ben benieuwd waar jullie de komende twaalf maanden aan gaan werken. Waar hoop je over een jaar te staan?<br> <br>Jurrien: Nou dat is een goede vraag. We hebben heel veel grote projecten waar ik niet zo heel veel over kan vertellen.&nbsp;<br> <br>Guido: Oh dat is dan heel kort.&nbsp;<br> <br>Jurrien: Ja dat is jammer. Maar die staan dus over twaalf maanden online. Als dat afgelopen is dan wil ik eigenlijk focussen op kleine improvements, user testing ligt een beetje stil. En als dat afgelopen is hebben we een hele mooie website die volledig in de nieuwe stijl en dan kunnen dat meer optimaliseren. Dus het is lastig te zeggen waar we over twaalf maanden zijn maar ik hoop vooral dat we de nieuwe software kunnen challengen en de features die daar in verdwenen zijn een stuk meer optimaliseren.&nbsp;<br> <br>Guido: En een stuk meer testen van buiten de team.&nbsp;<br> <br>Jurrien: Ja dat zeker. Er is in ieder geval heel veel motivatie van andere teams om meer met klanten te vergaderen, laten we daarmee starten.&nbsp;<br> <br>Guido: Heel veel succes ermee en dank voor je deelname aan deze podcast, een hoop nuttig informatie denk ik, interessant om te horen waar jullie mee bezig zijn. Gaan we jou binnenkort ergens op een evenement zien?&nbsp;<br> <br>Jurrien: Ik heb eigenlijk nog niks in de planning staan maar als er {} is ben ik wel in voor een evenementje.&nbsp;<br> <br>Guido: Ja sowieso want 8 oktober hebben wij een CRO café conference in Utrecht om de hoek. Zet hem in je agenda. Hey dankjewel, we spreken elkaar weer wel.&nbsp;<br> <br>Jurrien: Yes, is goed, dankjewel Guido.&nbsp;<br> <br>Guido: Is goed, dankjewel, hoi hoi.&nbsp;</p>",
  "show_notes": "<ul><li>LinkedIn: <a href=\"https://nl.linkedin.com/in/jurrienschouten\" data-rt-link-type=\"external\">https://nl.linkedin.com/in/jurrienschouten</a></li><li>Twitter: <a href=\"https://twitter.com/jurascho?lang=en\" data-rt-link-type=\"external\">https://twitter.com/jurascho</a></li><li>fonQ.nl: <a href=\"https://www.fonq.nl/\" data-rt-link-type=\"external\">https://www.fonq.nl/</a> </li><li><a href=\"https://www.shoppingtomorrow.nl/nl/themas/marketing/conversion/conversion-optimization-2019-2020\" target=\"_blank\" data-rt-link-type=\"external\">Conversion Optimization groep van Shopping Tomorrow</a></li><li><a href=\"https://www.cro.cafe/podcast/emerce-interview-jurrien-schouten-stefan-van-ballegooie-melle-moorman\" target=\"_blank\" data-rt-link-type=\"external\">Podcast met Jurrien @ Emerce Conversion</a></li><li><a href=\"http://www.lookback.io\" target=\"_blank\" data-rt-link-type=\"external\">lookback.io</a></li></ul>",
  "guests": [
    {
      "id": "jurrien-schouten",
      "name": "jurrien-schouten",
      "role": "Guest",
      "bio": "",
      "image_url": "",
      "social_links": [],
      "language": "nl",
      "type": "guest"
    }
  ],
  "youtube_url": "",
  "main_image": "src/assets/images/episodes/redesign-bij-fonq.jpeg",
  "language": "nl",
  "type": "podcast"
}